[
  {
    "sectionId": "0",
    "sectionTitle": "ACKNOWLEDGEMENTS",
    "subSections": [
      {
        "subSectionId": "0.1",
        "subSectionTitle": "Contributors",
        "content": [
          {
            "ruleId": "0.1.1",
            "ruleTitle": "Acknowledgements",
            "description": "This rulebook was produced by and for the use of the International Quadball Association. The IQA would like to thank the following individuals who have contributed to its development:",
            "details": [
              {
                "point": "New Content",
                "subPoints": [
                  "Amel Sadikovic",
                  "Eliane Wyss",
                  "Jenny Krafczyk",
                  "Joe Dodd",
                  "Matt Blissenden",
                  "Michael Clark-Polner",
                  "Nicholas Weir"
                ]
              },
              {
                "point": "Editing & Design",
                "subPoints": [
                  "Arkady English",
                  "Jannis Grimm"
                ]
              },
              {
                "point": "Photography",
                "subPoints": [
                  "Front cover image © Ajantha Abey Photography.",
                  "Ajantha Abey Photography"
                ]
              },
              {
                "point": "Board of Trustees",
                "subPoints": [
                  "Alex Benepe",
                  "Andy Marmer",
                  "Ariel Heiblum",
                  "Brenda “Negra” Flores",
                  "Daniel Price Croft",
                  "Marc Alcalà-i-Rams",
                  "Vitória Alves"
                ]
              },
              {
                "point": "Thanks",
                "subPoints": [
                  "Aldo Mastellone",
                  "Caleb Ragatz",
                  "Christos Kaldis",
                  "Clay Dockery",
                  "Crystal Hutcheson",
                  "Cynthia Holden",
                  "Elisa Scorrano",
                  "Eric Schnier",
                  "Fredric Armstrong Nelson IV",
                  "Jamie Turbet",
                  "Jared Leggett",
                  "Joke Daems",
                  "Katie Bone",
                  "Lucy Nicholls",
                  "Max D. Gutierrez",
                  "Mary Kimball",
                  "Matthew Niederberger",
                  "Sarah Kneiling",
                  "Sarah Woolsey"
                ]
              },
              {
                "point": "Past Contributors",
                "subPoints": [
                  "Alex Greenhalgh",
                  "Andrés Vargas Beato",
                  "Arkady English",
                  "Armand Cosseron",
                  "Chris LeCompte",
                  "Chula Bruggeling",
                  "Daniel Scharf",
                  "Dave Goddin",
                  "Eamonn Harrison",
                  "Emma Morris",
                  "Eva Baisan",
                  "Hugo Petit-Jean",
                  "Jelmer Lokman",
                  "Kyle Ross",
                  "Irene Velasco",
                  "Keith Jones",
                  "Larsen Price",
                  "Lisa Tietze",
                  "Luke Nickholds",
                  "Natalie Astalosh",
                  "Nicole Stone",
                  "Pauline Raes",
                  "Ragnhild W. Dahl",
                  "Rebecca Alley",
                  "Steffen Wirsching",
                  "Stephen Cockram",
                  "Steven Daly"
                ]
              }
            ],
            "violations": []
          }
        ]
      }
    ]
  },
  {
    "sectionId": "1",
    "sectionTitle": "TEAM COMPOSITION AND SUBSTITUTIONS",
    "subSections": [
      {
        "subSectionId": "1.1",
        "subSectionTitle": "Leadership and staff",
        "content": [
          {
            "ruleId": "1.1.1",
            "ruleTitle": "Mandatory speaking captain",
            "description": "Each team must designate one individual on the team's official roster to serve as the speaking captain for a game.",
            "details": [
              {
                "point": "A. The speaking captain has the power to speak for the team when conversing with officials.",
                "subPoints": [
                  "i. Individual players may speak to officials on their own behalf.",
                  "ii. Officials may direct any person to stop talking with any official."
                ]
              },
              {
                "point": "B. If the team's speaking captain is unable to continue the duties of the position for any reason, their team must select an alternate speaking captain.",
                "subPoints": [
                  "i. If the team's original speaking captain for the game legally returns to the bench or pitch, they shall resume the role of speaking captain."
                ]
              },
              {
                "point": "C. Speaking captains must not enter the pitch while play is not stopped unless they are entering as an active player.",
                "subPoints": [
                  "i. If the speaking captain substantially illegally enters the pitch or affects play while illegally on the pitch, they are encroaching on the pitch."
                ]
              }
            ],
            "violations": [
              {
                "description": "encroaching on the pitch",
                "penalty": "BlueCard"
              }
            ]
          },
          {
            "ruleId": "1.1.2",
            "ruleTitle": "Team staff",
            "description": "Non-playing members of the team, including non-playing coaches, are \"team staffers.\"",
            "details": [
              {
                "point": "A. Event directors may limit the number of team staffers allowed in the player area.",
                "subPoints": [
                  "i. This number cannot be limited to less than three.",
                  "ii. Officials may direct any person to stop talking with any official."
                ]
              },
              {
                "point": "B. Team staffers are not eligible to enter play."
              },
              {
                "point": "C. If a team staffer engages in any action that would result in a penalty for a substitute, the team staffer shall receive the same penalty."
              },
              {
                "point": "D. Team staffers must not enter the pitch while play is live.",
                "subPoints": [
                  "i. If a team staffer substantially illegally enters the pitch or affects play while illegally on the pitch, they are encroaching on the pitch."
                ]
              }
            ],
            "violations": [
              {
                "description": "encroaching on the pitch",
                "penalty": "BlueCard"
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "1.2",
        "subSectionTitle": "Rosters and players",
        "content": [
          {
            "ruleId": "1.2.1",
            "ruleTitle": "Rosters",
            "details": [
              {
                "point": "A. Each team is made up of between seven and 21 players."
              },
              {
                "point": "B. A team must be able to field a legal set of eligible players to begin or continue a game, including during the seeker floor.",
                "subPoints": [
                  "i. A legal set of eligible players must",
                  "a. Consist of seven players prior to overtime",
                  "b. Consist of six players during overtime.",
                  "c. Be able to legally be in play at the same time without violating the gender maximum rule.",
                  "ii. If a team has insufficient eligible players to continue at any time during the game, that team must forfeit the game.",
                  "iii. If a player's injury would cause their team to forfeit, and the onsite medical staff believes the player can safely return to the field with approximately a minute or less of treatment, the Head Referee shall keep the game stopped until the player returns, rather than declaring a forfeit."
                ]
              }
            ],
            "violations": [
              {
                "description": "having insufficient eligible players to continue the game",
                "penalty": "Forfeit"
              }
            ]
          },
          {
            "ruleId": "1.2.2",
            "ruleTitle": "Positions",
            "details": [
              {
                "point": "A. A team shall have four chasers in play, one of whom is the keeper",
                "subPoints": [
                  "i. The keeper must wear a green headband on their forehead.",
                  "ii. The remaining chasers must wear a white headband on their forehead.",
                  "iii. Chasers may use the volleyball in any legal manner.",
                  "iv. Keepers and chasers shall be treated as separate positions for the purpose of substitutions and position changes."
                ]
              },
              {
                "point": "B. A team shall have two beaters in play.",
                "subPoints": [
                  "i. Beaters must wear a black headband on their forehead.",
                  "ii. Beaters may use the dodgeballs in any legal manner."
                ]
              },
              {
                "point": "C. A team must have one seeker in play from the end of the seeker floor until the flag is legally caught. Otherwise, a team must not have a seeker in play.",
                "subPoints": [
                  "i. Seekers must wear a yellow headband on their forehead."
                ]
              },
              {
                "point": "D. Any players not in play are substitutes.",
                "subPoints": [
                  "i. Substitutes are not designated as being at any position.",
                  "ii. Substitutes are not required to wear a headband."
                ]
              },
              {
                "point": "E. Players in the penalty box are considered in play and count towards the position requirements for their teams."
              },
              {
                "point": "F. No penalty shall be given if teams are lacking a full complement of players either due to an active substitution or if a seeker accidentally neglects to enter the field at the end of the seeker floor."
              }
            ],
            "violations": [
              {
                "description": "illegal set of players in play",
                "penalty": "CaptainYellowCard"
              },
              {
                "description": "intentionally failing to send a seeker into the game",
                "penalty": "CaptainYellowCard"
              }
            ]
          },
          {
            "ruleId": "1.2.3",
            "ruleTitle": "Gender maximum rule",
            "details": [
              {
                "point": "A. A team may not have more than three players who identify as the same gender in play at the same time during either the seeker floor or overtime and not more than four players who identify as the same gender otherwise.",
                "subPoints": [
                  "i. The league governing an event may grant exemptions to this rule consistent with that league's gameplay policy."
                ]
              },
              {
                "point": "B. The gender that a player identifies as is considered to be that player's gender."
              }
            ],
            "violations": [
              {
                "description": "illegal set of players in play",
                "penalty": "CaptainYellowCard"
              }
            ]
          },
          {
            "ruleId": "1.2.4",
            "ruleTitle": "Correcting illegal sets of players",
            "description": "When the speaking captain receives a penalty for having an illegal set of players in play, they must correct the violation with as few substitutions as possible before play is restarted."
          }
        ]
      },
      {
        "subSectionId": "1.3",
        "subSectionTitle": "Substitutions",
        "content": [
          {
            "ruleId": "1.3.1",
            "ruleTitle": "Substitution procedure",
            "description": "To replace a player with a substitute while play is live, the following conditions must be observed:",
            "details": [
              {
                "point": "A. The player substituting out is on stick."
              },
              {
                "point": "B. The player substituting out exits the pitch within the team's substitution area and then promptly dismounts.",
                "subPoints": [
                  "i. The player must not dismount before crossing out of the pitch.",
                  "ii. The player substituting out is no longer eligible to be knocked off stick once they have dismounted."
                ]
              },
              {
                "point": "C. If any other equipment must be traded (including headbands) it must be traded while off the pitch."
              },
              {
                "point": "D. The substitute entering play must then mount the stick in the substitution area and step onto the pitch before interacting with play.",
                "subPoints": [
                  "i. The substitute enters the pitch along the boundary of the team's substitution area at roughly the same place as the outgoing player had left the pitch.",
                  "ii. A substitution is complete when the substitute crosses the boundary of the team's substitution area into the pitch and is only touching the ground inside the pitch.",
                  "a. The substitute is then immediately eligible to engage in gameplay and is eligible to be knocked off stick."
                ]
              },
              {
                "point": "E. The entering player receives any penalty card for violations of this procedure."
              },
              {
                "point": "F. If a player enters play through a substitution that violates this procedure, but has not yet interacted with play, the official shall call a substitution violation instead of an illegal substitution.",
                "subPoints": [
                  "i. If the entering player interacts with play before the call, or before correcting the substitution violation, they must be penalized for an illegal substitution.",
                  "ii. A player who repeatedly commits substitution violations must be penalized for an illegal substitution."
                ]
              }
            ],
            "violations": [
              {
                "description": "substitution violation",
                "penalty": "RepeatProcedure"
              },
              {
                "description": "illegal substitution",
                "penalty": "BlueCard"
              }
            ]
          },
          {
            "ruleId": "1.3.2",
            "ruleTitle": "Position change",
            "description": "Players may exchange positions by following the substitution procedure and changing headbands while dismounted in the substitution area.",
            "details": [
              {
                "point": "A. When a player switches positions with a teammate, they shall be treated as participating in two separate substitutions. Substituting out at their old position in one, and substituting in at their new position in the other."
              }
            ]
          },
          {
            "ruleId": "1.3.3",
            "ruleTitle": "Substitution guidelines",
            "details": [
              {
                "point": "A. Substitutions may only be made while play is live with the following exceptions:",
                "subPoints": [
                  "i. Replacing an ejected player (See rule 9.1.6 Ejection).",
                  "ii. Replacing an injured player (See rule 1.3.4 Substitutions due to injury).",
                  "iii. A keeper changing positions with another player in play when sent to the penalty box (See rule 9.4.2.B. Proceeding to the penalty box).",
                  "iv. A speaking captain changing positions with another player in play when assessed a speaking captain penalty card while in play (See rule 9.4.2.C. Proceeding to the penalty box).",
                  "v. Replacing a player in play with a fouling substitute (See rule 9.4.5 Penalties to substitutes and team staffers).",
                  "vi. Correcting violations after receiving a penalty for having an illegal set of players in play (See rule 1.2.4 Correcting illegal sets of players)."
                ]
              }
            ]
          },
          {
            "ruleId": "1.3.4",
            "ruleTitle": "Substitutions due to injury",
            "details": [
              {
                "point": "A. If a player is injured and play is live, any substitution must follow all of the substitution procedure as outlined in 1.3.1 Substitution procedure."
              },
              {
                "point": "B. Play must be stopped for an injury when a player in play is openly bleeding or is down and too injured to continue to play or substitute while play continues.",
                "subPoints": [
                  "i. Play should be stopped immediately if the injured player is obstructing gameplay or has a serious injury, including any non-superficial head injury.",
                  "ii. If the injury is not serious and the player is not obstructing active gameplay, the head referee should allow play to continue until stopping play would not significantly advantage either team or play moves into the area of the injured player."
                ]
              },
              {
                "point": "C. If play is stopped and a player is injured:",
                "subPoints": [
                  "i. The injured player may leave the pitch to be replaced by a substitute.",
                  "a. If play is stopped for a player's injury, that player must leave the pitch.",
                  "b. If the injured player is openly bleeding, they must leave the pitch.",
                  "1. The bleeding player is ineligible to return to play until receiving permission from an official, who must be satisfied that the bleeding has stopped.",
                  "c. The injured player's stick is left on the field where they were when play was stopped."
                ]
              },
              {
                "point": "D. Any injured player who leaves the pitch must be replaced by an eligible substitute.",
                "subPoints": [
                  "i. While play is stopped, the substitute replaces the player at the point indicated by the stick.",
                  "ii. The substitute is given possession of any ball that would have been possessed by the injured player upon the restart of play.",
                  "iii. If a player is forced, by rule, to leave the pitch for a non-severe injury and there is no eligible substitute, that player may take their stick and resume play at the boundary of their substitution area."
                ]
              },
              {
                "point": "E. A player may not feign an injury for any reason."
              }
            ],
            "violations": [
              {
                "description": "feigning an injury",
                "penalty": "YellowCard"
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "1.4",
        "subSectionTitle": "Substitution area and the team bench",
        "content": [
          {
            "ruleId": "1.4.1",
            "ruleTitle": "Team bench and substitution area restrictions",
            "details": [
              {
                "point": "A. All substitutions must occur in the substitution area and not in the team bench."
              },
              {
                "point": "B. Any extra equipment or property not necessary for play that is brought into the player area by a team must be kept securely stored in the team's bench.",
                "subPoints": [
                  "i. Any extra balls kept in the bench must be stored in a bag or other storage container."
                ]
              },
              {
                "point": "C. Substitutes and team staff must remain in the team bench whenever play is live unless about to substitute into the game.",
                "subPoints": [
                  "i. A player is about to substitute into the game if the player they are replacing is actively moving in the direction of the bench, or is off stick and is signaling their intent to substitute out after completing the back to hoops procedure.",
                  "ii. Players about to substitute into the game may enter the substitution area."
                ]
              },
              {
                "point": "D. One substitute or team staffer at a time may leave the substitution area or team bench to check information with the scorekeeper or timekeeper but must neither interfere with the scorekeeper's or timekeeper's duties, nor enter the pitch."
              },
              {
                "point": "E. One player or team staff member at a time may enter the substitution area or coaching area to coach their team.",
                "subPoints": [
                  "i. While in the coaching area, this person must cover their team jersey if they are wearing one."
                ]
              },
              {
                "point": "F. Players and team staff may leave the bench and substitution area for any reason that would allow them to leave the player area under rule 1.4.2 Leaving the substitution area, bench, or player area."
              },
              {
                "point": "G. Violations of this rule are sideline infractions.",
                "subPoints": [
                  "i. The first called violation of this rule by each team shall result in a warning instead of a sideline infraction call."
                ]
              }
            ],
            "violations": [
              {
                "description": "sideline infraction",
                "penalty": "BlueCard"
              }
            ]
          },
          {
            "ruleId": "1.4.2",
            "ruleTitle": "Leaving the substitution area, bench, or player area",
            "details": [
              {
                "point": "A. The team's speaking captain may leave the player area in order to communicate with event staff."
              },
              {
                "point": "B. Any person in need of medical attention may leave the player area to receive it.",
                "subPoints": [
                  "i. All players who leave the player area in this way may return to the game if they are medically cleared.",
                  "ii. If necessary, anyone designated by the team's speaking captain may leave the player area to attend to an injured teammate.",
                  "iii. In cases of head injuries, the head referee may, at their discretion, require that the injured person leave the player area to receive medical attention."
                ]
              },
              {
                "point": "C. Intentionally and illegally leaving the substitution area or bench with the intent of circumventing other rules is illegal circumvention."
              }
            ],
            "violations": [
              {
                "description": "illegal circumvention",
                "penalty": "BlueCard"
              }
            ]
          },
          {
            "ruleId": "1.4.3",
            "ruleTitle": "Sideline interference",
            "description": "Substitutes must not commit sideline interference.",
            "details": [
              {
                "point": "A. It is sideline interference if a substitute directly affects play when either of the following are true:",
                "subPoints": [
                  "i. The substitute is intentionally and illegally outside of both the substitution area and team bench.",
                  "ii. The substitute failed to make every reasonable effort to avoid the play."
                ]
              }
            ],
            "violations": [
              {
                "description": "sideline interference",
                "penalty": "BlueCard"
              },
              {
                "description": "intentional sideline interference",
                "penalty": "RedCard"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "sectionId": "2",
    "sectionTitle": "EQUIPMENT AND DIMENSIONS",
    "subSections": [
      {
        "subSectionId": "2.1",
        "subSectionTitle": "Field lines and marks",
        "content": [
          {
            "ruleId": "2.1.1",
            "ruleTitle": "Boundary lines",
            "description": "The pitch consists of four boundary lines that form a 33 by 60 meter rectangle.",
            "details": [
              {
                "point": "A. The 33-meter boundary lines are the endlines."
              },
              {
                "point": "B. The 60-meter boundary lines are the sidelines.",
                "subPoints": [
                  "i. The sideline closest to the scorekeeper's table is the \"scorekeeper's sideline.\"",
                  "ii. The sideline farthest from the scorekeeper's table is the \"starting sideline.\""
                ]
              }
            ]
          },
          {
            "ruleId": "2.1.10",
            "ruleTitle": "Coaching areas",
            "description": "Each team's coaching area is a 5.5 by 7 meter rectangle between the pitch and player area boundary and adjacent to their penalty box."
          },
          {
            "ruleId": "2.1.11",
            "ruleTitle": "Ball positions",
            "description": "There are four ball positions on the pitch.",
            "details": [
              {
                "point": "A. One dodgeball position is located at the midpoint of each keeper zone line."
              },
              {
                "point": "B. One dodgeball position is located at the intersection of the midfield and volleyball runner starting lines."
              },
              {
                "point": "C. The volleyball position is located at the midpoint of the midfield line."
              }
            ]
          },
          {
            "ruleId": "2.1.12",
            "ruleTitle": "The player area",
            "description": "The player area is a rectangle enclosing the pitch with the pitch at its center.",
            "details": [
              {
                "point": "A. This rectangle is:",
                "subPoints": [
                  "i. 44 meters wide and 66 meters long."
                ]
              },
              {
                "point": "B. The player area must be clear of obstacles and dangerous terrain.",
                "subPoints": [
                  "i. No event-specific obstructions, such as a scorekeeper's table, may be set up within the player area."
                ]
              },
              {
                "point": "C. During gameplay, the player area is reserved for:",
                "subPoints": [
                  "i. Players on the active roster of the teams in play.",
                  "ii. Referees and officials assigned to the game currently in play.",
                  "iii. Event staff given access to the player area (at their own risk) at the discretion of the head referee or event director.",
                  "iv. Team staffers as designated in 1.1.2 Team staff."
                ]
              },
              {
                "point": "D. No spectators may enter the player area."
              }
            ]
          },
          {
            "ruleId": "2.1.13",
            "ruleTitle": "Field markings",
            "description": "Various parts of the pitch and surrounding area should be marked in a clear manner. These markings are usually made with cones or lines.",
            "details": [
              {
                "point": "A. The following must be marked in some way:",
                "subPoints": [
                  "i. The pitch boundary as described in 2.1.1.",
                  "ii. The midfield line as described in 2.1.2.",
                  "iii. The keeper zone lines as described in 2.1.3.",
                  "iv. The volleyball runner starting line as described in 2.1.5."
                ]
              },
              {
                "point": "B. The following markings are optional, though recommended:",
                "subPoints": [
                  "i. The goal lines as described in 2.1.4.",
                  "ii. The starting runner zone as described in 2.1.6.",
                  "iii. The team benches as described in 2.1.8.",
                  "iv. The penalty boxes as described in 2.1.9.",
                  "v. The remaining ball positions as described in 2.1.11.",
                  "vi. The player area as described in 2.1.12.",
                  "vii. The hoop positioning as described in 2.2.3.",
                  "a. These markings must not interfere with the stability of the hoops."
                ]
              }
            ]
          },
          {
            "ruleId": "2.1.2",
            "ruleTitle": "Midfield line",
            "description": "The midfield line connects the midpoints of the sidelines."
          },
          {
            "ruleId": "2.1.3",
            "ruleTitle": "Keeper zone lines",
            "description": "There are two keeper zone lines, which run parallel to the endlines, connect the sidelines, and are positioned 11 meters away from the midfield line on either side of it."
          },
          {
            "ruleId": "2.1.4",
            "ruleTitle": "Goal lines",
            "description": "There are two goal lines, which run parallel to the endlines, connect the sidelines, and are positioned 16.5 meters away from the midfield line on either side of it."
          },
          {
            "ruleId": "2.1.5",
            "ruleTitle": "Volleyball runner starting line",
            "description": "The volleyball runner starting line is located 8.25 meters from the starting sideline and extends 2 meters in each direction, perpendicular to the midfield line."
          },
          {
            "ruleId": "2.1.6",
            "ruleTitle": "Starting runner zone",
            "description": "The starting runner zone is the area within 4 meters of the midline, from the volleyball runners' starting line, to the starting sideline, and extended to the player area boundary.",
            "details": [
              {
                "point": "A. If the starting runner zone is marked, it should only be marked at the starting sideline, outside of the pitch."
              }
            ]
          },
          {
            "ruleId": "2.1.7",
            "ruleTitle": "Substitution areas",
            "description": "Each team's substitution area is a 19 by 2.75 meter rectangle outside of the pitch and bordering their own keeper zone.",
            "details": [
              {
                "point": "A. One side of the substitution area is the section of the scorekeeper's sideline inside the keeper zone."
              },
              {
                "point": "B. The substitution area extends 2.75 meters away from the sideline."
              }
            ]
          },
          {
            "ruleId": "2.1.8",
            "ruleTitle": "Team benches",
            "description": "Each team's bench is a 19 by 2.75 meter rectangle between their substitution area and the player area boundary",
            "details": [
              {
                "point": "A. Event directors may elect to expand the benches across the player area boundary to be up to 7 meters in width. If they elect to do so, the expanded portion must also be off limits to all personnel not allowed in the player area.",
                "subPoints": [
                  "i. The expanded portion of the bench shall be treated as part of the player area but is not subject to rule 2.1.12.B.."
                ]
              },
              {
                "point": "B. Both benches on the same pitch must be the same size."
              }
            ]
          },
          {
            "ruleId": "2.1.9",
            "ruleTitle": "Penalty boxes",
            "description": "Each team has a penalty box outside of the pitch.",
            "details": [
              {
                "point": "A. Each box is a 5.5 by 4 meter rectangular area that begins at the midfield line and extends 4 meters along the scorekeeper's sideline in the direction of the team's bench."
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "2.2",
        "subSectionTitle": "Hoops",
        "content": [
          {
            "ruleId": "2.2.1",
            "ruleTitle": "Hoop composition and construction",
            "details": [
              {
                "point": "A. Each hoop must be made up of a post and a circular loop attached to the top. These may be made of any material other than metal or concrete and must not be dangerous to players."
              },
              {
                "point": "B. A hoop may be attached to a base to keep it upright.",
                "subPoints": [
                  "i. This base should not affect the hoop height.",
                  "ii. Other than metal fasteners, the base must not be made of hard metal or concrete."
                ]
              },
              {
                "point": "C. Hoops must be freestanding and able to withstand play.",
                "subPoints": [
                  "i. Referees must disallow any hoops or bases that they believe are dangerous to the players."
                ]
              }
            ]
          },
          {
            "ruleId": "2.2.2",
            "ruleTitle": "Hoop shape",
            "description": "Each set of hoops must have hoop loops attached to the top of posts of three different heights.",
            "details": [
              {
                "point": "A. The required heights are measured from the ground to the lowest part of the outer edge of the hoop loop. The heights are as follows:",
                "subPoints": [
                  "i. The short hoop is between 89 and 93 centimeters high.",
                  "ii. The medium hoop is between 135 and 139 centimeters high.",
                  "iii. The tall hoop is between 181 and 185 centimeters high."
                ]
              },
              {
                "point": "B. A hoop loop must be fastened to the top of each post.",
                "subPoints": [
                  "i. The inner diameter of each hoop loop must be between 81 centimeters and 86 centimeters."
                ]
              }
            ]
          },
          {
            "ruleId": "2.2.3",
            "ruleTitle": "Hoop positioning",
            "details": [
              {
                "point": "A. Three hoops are positioned on each goal line.",
                "subPoints": [
                  "i. The tall hoop must be placed at the center of the goal line.",
                  "ii. The other two hoops are placed on the goal line, 2.75 meters away from the tall hoop on either side.",
                  "iii. Facing either set of hoops from midfield, the short hoop must be on the left and the medium hoop must be on the right."
                ]
              },
              {
                "point": "B. The hoop loops must be in line with the goal line."
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "2.3",
        "subSectionTitle": "Game balls",
        "content": [
          {
            "ruleId": "2.3.1",
            "ruleTitle": "The volleyball",
            "description": "The volleyball must be:",
            "details": [
              {
                "point": "A. A volleyball."
              },
              {
                "point": "B. Between 65 centimeters to 67 centimeters in circumference."
              },
              {
                "point": "C. The volleyball must maintain its spherical shape and must be neither inflated all the way nor so flat that the average player could grip a bulk of the leather in one hand."
              }
            ]
          },
          {
            "ruleId": "2.3.2",
            "ruleTitle": "Dodgeballs",
            "description": "The dodgeballs must be:",
            "details": [
              {
                "point": "A. Spherical balls made of flexible rubber or rubber-like cover."
              },
              {
                "point": "B. Between 68 centimeters and 70 centimeters in circumference."
              },
              {
                "point": "C. The dodgeballs must maintain their spherical shape and must be neither inflated all the way nor so flat that the average player could grip a bulk of the rubber in one hand."
              }
            ]
          },
          {
            "ruleId": "2.3.3",
            "ruleTitle": "The flag",
            "description": "The flag must be:",
            "details": [
              {
                "point": "A. A ball held within a sleeve.",
                "subPoints": [
                  "i. The ball must be between 65 and 69 millimeters in diameter and weigh between 55 and 60 grams (such as a tennis ball).",
                  "ii. The flag must have a visible and unobstructed length of between 25 and 30 centimeters.",
                  "a. If the flag is attached to the outside of the shorts, up to 5 centimeters of the attachment may be counted toward this minimum length."
                ]
              },
              {
                "point": "B. The sock must be tucked in or attached to the shorts of the flag runner in a manner that is secure and allows for the removal of the sock by the seeker."
              }
            ]
          },
          {
            "ruleId": "2.3.4",
            "ruleTitle": "Defective balls mid-play",
            "description": "If a game ball becomes defective (e.g. deflates) while in play, the head referee must stop play to replace the ball. The following conditions apply:",
            "details": [
              {
                "point": "A. The head referee must stop play immediately when any ball becomes defective."
              },
              {
                "point": "B. If a ball is in midair when it becomes defective, the replaced or repaired ball is returned to the player who last held possession, except the volleyball after a good goal.",
                "subPoints": [
                  "i. If this player is off stick before play is stopped, then the ball is given to the nearest eligible player on the same team to this player's current location.",
                  "a. If no such player exists, then the ball shall be left at the player's current location."
                ]
              },
              {
                "point": "C. No goals or beats may happen with a ball an official recognized as defective before the goal or beat occurred."
              },
              {
                "point": "D. If a dodgeball becomes defective while hitting a player, the beat counts and the dodgeball is considered dead.",
                "subPoints": [
                  "i. If the dodgeball becomes defective in the final motion of being otherwise successfully caught, that catch shall count."
                ]
              },
              {
                "point": "E. If the flag becomes defective during the flag catch (e.g. the sock breaks in half and the seeker gets half of it), the catch counts if the seeker cleanly removed the actual ball.",
                "subPoints": [
                  "i. If the flag becomes defective before the catch, the catch must be called no good."
                ]
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "2.4",
        "subSectionTitle": "Sticks",
        "content": [
          {
            "ruleId": "2.4.1",
            "ruleTitle": "Stick regulations",
            "description": "All players in play must have a stick. The stick:",
            "details": [
              {
                "point": "A. Must consist of a rigid pole made of plastic.",
                "subPoints": [
                  "i. This pole must be between 98 and 102 centimeters long.",
                  "ii. This pole must have an outer diameter between 25 and 35 millimeters.",
                  "a. If the ends of the pole are capped, the caps may slightly exceed 35 millimeters in diameter."
                ]
              },
              {
                "point": "B. Must not have splinters or sharp points.",
                "subPoints": [
                  "i. If the stick is hollow, the stick ends must be sufficiently covered."
                ]
              },
              {
                "point": "C. Must not be attached to the body, clothing, or other equipment of the player."
              },
              {
                "point": "D. Must not be reinforced by additional materials with the following exceptions:",
                "subPoints": [
                  "i. Grip tape or other adhesive materials may be applied to a single 20 centimeter section of the stick shaft.",
                  "ii. Tape being reasonably used to cover the ends of a hollow stick shall be allowed, and shall not count as part of the 20 centimeter exception."
                ]
              }
            ]
          },
          {
            "ruleId": "2.4.2",
            "ruleTitle": "Broken sticks",
            "description": "If a stick breaks during the course of play, the head referee must immediately stop play and it must be replaced before its player may make any play.",
            "details": [
              {
                "point": "A. It is illegal to knowingly initiate a new play while using a broken stick."
              }
            ],
            "violations": [
              {
                "description": "knowingly initiating a new play with a broken stick",
                "penalty": "RedCard"
              }
            ]
          },
          {
            "ruleId": "2.4.3",
            "ruleTitle": "Providing sticks",
            "description": "The event director for a game must provide at least 10 equal sticks to both teams. Teams may provide their own sticks unless this is disallowed by event policy prior to the event."
          }
        ]
      },
      {
        "subSectionId": "2.5",
        "subSectionTitle": "Player equipment",
        "content": [
          {
            "ruleId": "2.5.1",
            "ruleTitle": "Safety",
            "description": "Players must not use any equipment or wear anything that is dangerous to themselves or other players.",
            "details": [
              {
                "point": "A. Players must not have, at the discretion of the head referee, sharp or long fingernails. Nails that are visible when the hand is held palm up are generally considered long."
              }
            ],
            "violations": [
              {
                "description": "entering play with illegally long or sharp fingernails",
                "penalty": "BlueCard"
              }
            ]
          },
          {
            "ruleId": "2.5.10",
            "ruleTitle": "Forbidden equipment",
            "description": "The following are forbidden equipment and may never be worn by players while in play:",
            "details": [
              {
                "point": "A. Audio or visual recording devices."
              },
              {
                "point": "B. Jewelry of any kind.",
                "subPoints": [
                  "i. Flexible plastic piercing retainers that are flush with the skin are allowed.",
                  "ii. Players with significantly stretched piercings may use hard plastic retainers that are flush with the skin and completely fill the piercing.",
                  "iii. Medical Alert Bracelets that are specifically designed for contact sports shall not be treated as jewelry.",
                  "iv. If a player's jewelry has not affected play, the player shall receive the penalty for wearing forbidden jewelry instead of wearing forbidden equipment."
                ]
              },
              {
                "point": "C. Grip enhancing substances that might transfer to and affect a ball."
              }
            ],
            "violations": [
              {
                "description": "wearing forbidden jewelry",
                "penalty": "Ejection"
              },
              {
                "description": "wearing forbidden equipment",
                "penalty": "RedCard"
              }
            ]
          },
          {
            "ruleId": "2.5.11",
            "ruleTitle": "Equipment rule exemptions",
            "description": "Players may request appropriate exemptions to any personal player equipment rules from the league governing an event through that league's equipment waiver policy. The governing body shall approve or deny the request after considering the safety of players and officials, the compatibility of the request with fair gameplay and smooth adjudication of the game, and any other factors the governing league deems appropriate."
          },
          {
            "ruleId": "2.5.2",
            "ruleTitle": "Mandatory equipment",
            "description": "While in play, each player must properly wear the following equipment:",
            "details": [
              {
                "point": "A. A colored headband, which must be worn on the forehead, distinguishing the player's position."
              },
              {
                "point": "B. A shirt or jersey.",
                "subPoints": [
                  "i. Jerseys for players on the same team must be readily identifiable, of the same base color, and distinguishable from the opposing team.",
                  "ii. The primary jersey color may not be yellow or gold.",
                  "iii. The jersey design must not primarily consist of vertical black and white stripes."
                ]
              },
              {
                "point": "C. Some sort of bottom (such as shorts, pants, or a skirt).",
                "subPoints": [
                  "i. The primary color of the outermost layer of the bottoms must not be yellow or gold.",
                  "ii. Some form of undergarment must be worn under the bottoms."
                ]
              },
              {
                "point": "D. Shoes or cleats.",
                "subPoints": [
                  "i. Spikes or studs must not be sharp.",
                  "ii. Spikes or studs made wholly or partially of metal may only be allowed if the following requirements are met:",
                  "a. The venue hosting the game has explicitly permitted the use of metal studs.",
                  "1. It is the responsibility of the player to ensure the venue allows them.",
                  "b. The studs must not have any burrs or sharp edges, including edges created by wear.",
                  "c. The studs must be no longer than 21 mm.",
                  "d. The ends must have a diameter of at least 10 mm.",
                  "e. The base of the stud must have a diameter of at least 13 mm.",
                  "f. The studs must have no external projections, except for a logo",
                  "1. The logo may not project more than 0.3 mm from the surface.",
                  "g. The studs must be smooth and rounded, with no radius less than 1 mm."
                ]
              },
              {
                "point": "E. A mouthguard that shall:",
                "subPoints": [
                  "i. Include an occlusal (protecting and separating the biting surfaces) portion.",
                  "ii. Include a labial (protecting the teeth and supporting structures) portion.",
                  "iii. Cover the posterior teeth with adequate thickness."
                ]
              }
            ],
            "violations": [
              {
                "description": "entering play without wearing mandatory equipment",
                "penalty": "BlueCard"
              },
              {
                "description": "intentionally removing mandatory equipment while in play",
                "penalty": "BlueCard"
              }
            ]
          },
          {
            "ruleId": "2.5.3",
            "ruleTitle": "Headband requirements",
            "description": "Position headbands are subject to the following standards.",
            "details": [
              {
                "point": "A. The color of the headband must be distinct enough to unambiguously identify the player's position."
              },
              {
                "point": "B. The headband must be easily visible from a reasonable distance and be identifiable through a player's hair or other equipment."
              },
              {
                "point": "C. Hats or other headgear may not be used as headbands.",
                "subPoints": [
                  "i. The positional headband must be worn over the headgear and the headgear must be a color that is clearly distinguishable from the headband.",
                  "ii. Headwear that is both in the shape of a band and is a positional color shall be considered a headband.",
                  "a. No other positional headband may be worn over this item."
                ]
              },
              {
                "point": "D. If a player's headband is lost mid-play, they may continue to play without it. However, they must replace the headband whenever any of the following occur:",
                "subPoints": [
                  "i. They are off stick.",
                  "ii. There is a stoppage in play.",
                  "iii. A goal is scored.",
                  "a. Seekers and beaters do not have to replace their headband when a goal is scored."
                ]
              },
              {
                "point": "E. If an official deems a player's headband unacceptable for any reason, the player must immediately correct the issue.",
                "subPoints": [
                  "i. If this cannot be completed immediately on the pitch, the accidental equipment infringement procedure shall be applied (See rule 2.5.7 Accidental equipment infringement)."
                ]
              }
            ],
            "violations": [
              {
                "description": "illegally failing to replace a lost headband",
                "penalty": "BackToHoops"
              }
            ]
          },
          {
            "ruleId": "2.5.4",
            "ruleTitle": "Jersey numbers",
            "description": "Each player must have an integer between 0 and 99, inclusive, clearly visible on the back of their jersey.",
            "details": [
              {
                "point": "A. The number may not exceed two digits, including preceding zeros."
              },
              {
                "point": "B. No two players in the player area for the same team may share the same number.",
                "subPoints": [
                  "i. Leading zeros are ignored when determining a player's number.",
                  "ii. If a team is penalized for having two players wearing the same number in the player area, the speaking captain must designate one of the players to change their number.",
                  "a. The designated player is ineligible to be in play until they have a new number affixed to their back and the new number is reported to the scorekeeper."
                ]
              },
              {
                "point": "C. If a player's number becomes damaged beyond recognition while in play:",
                "subPoints": [
                  "i. Play is live.",
                  "ii. The referee informs the player that their jersey number has been damaged.",
                  "iii. The player must fix the number the next time they substitute out of the game, or during the next stoppage in play, whichever occurs first.",
                  "a. If there is a stoppage in play and the number cannot be quickly fixed, the player must substitute out during that stoppage.",
                  "b. If the issue can only be addressed by giving the player a new number, that new number must be reported to the scorekeeper."
                ]
              },
              {
                "point": "D. No player may enter play without a legal and recognizable number on their back."
              }
            ],
            "violations": [
              {
                "description": "entering play without a legal and recognizable jersey number",
                "penalty": "BlueCard"
              },
              {
                "description": "having two players wearing the same number in the player area",
                "penalty": "BlueCard"
              }
            ]
          },
          {
            "ruleId": "2.5.5",
            "ruleTitle": "Additional equipment",
            "description": "The following are considered \"additional equipment\" and may be worn with the listed limitations.",
            "details": [
              {
                "point": "A. Padding — all padding must:",
                "subPoints": [
                  "i. Be 2.5 centimeters or less in thickness.",
                  "ii. Pass the \"knock test,\" i.e., when a referee raps on it with a knuckle, it should not make a knocking sound.",
                  "iii. Bend easily when a minimal amount of force is applied to it."
                ]
              },
              {
                "point": "B. Braces — athletic braces are allowed but must generally meet the standards of padding above.",
                "subPoints": [
                  "i. A brace may include a hard element; however, any hard plastic or metal in a brace must be covered at all times during a game and, once covered, must pass the knock test.",
                  "ii. If any hard plastic or metal becomes exposed, the player must leave the pitch and fix the problem (See rule 2.5.7 Accidental equipment infringement).",
                  "iii. Referees reserve the right to refuse any brace that they believe presents a danger to anyone on the field."
                ]
              },
              {
                "point": "C. Shin guards — Shin guards must be worn properly and be covered by the player's socks.",
                "subPoints": [
                  "i. Only non-plastic portions of shin guards are subject to the padding requirements."
                ]
              },
              {
                "point": "D. Athletic supporters — athletic supporters (cups) that are used to protect the groin are allowed."
              },
              {
                "point": "E. Glasses and eyewear — players may wear glasses, goggles, or other eyewear.",
                "subPoints": [
                  "i. No eyewear actually made of glass is allowed unless it is worn underneath goggles so the glass is not exposed.",
                  "ii. Goggles made of metal, such as lacrosse \"cage\" goggles, are not allowed."
                ]
              },
              {
                "point": "F. Gloves — gloves are allowed and are subject to the same rules as padding."
              },
              {
                "point": "G. Hats — hats with one or more horizontal stripes in any of the four positional headband colors may not be worn, even if the stripe is covered by the headband."
              },
              {
                "point": "H. Additional equipment on the arm — nothing other than sleeves, gloves, braces, or medical alert bracelets designed for contact sports are allowed to be worn on the forearm."
              },
              {
                "point": "I. Any additional equipment must be approved by the head referee before the game. Any equipment that the referee determines to be dangerous or unfair to either team must not be permitted."
              }
            ],
            "violations": [
              {
                "description": "using illegal additional equipment in play",
                "penalty": "BlueCard"
              }
            ]
          },
          {
            "ruleId": "2.5.6",
            "ruleTitle": "Approving additional equipment",
            "description": "All padding, braces, and special equipment must be presented to the head referee or their designated representative before each game for approval whether or not the officials choose to perform a full team equipment check.",
            "violations": [
              {
                "description": "using equipment in play that was disallowed by a game official",
                "penalty": "RedCard"
              }
            ]
          },
          {
            "ruleId": "2.5.7",
            "ruleTitle": "Accidental equipment infringement",
            "description": "In the event that a player's previously legal equipment becomes illegal as a result of play:",
            "details": [
              {
                "point": "A. Play is not stopped unless the referee determines the infringement presents a danger to players."
              },
              {
                "point": "B. The player at fault must leave the pitch to correct the infringement immediately and may be replaced with a substitute.",
                "subPoints": [
                  "i. Players do not need to leave the pitch to replace a broken stick."
                ]
              },
              {
                "point": "C. Any player required to leave the pitch to correct equipment must not re-enter until the equipment has been replaced, repaired, or removed.",
                "subPoints": [
                  "i. Mandatory equipment must be replaced or repaired.",
                  "a. If there is no replacement for a stick or headband available, the head referee must stop play until the equipment is provided."
                ]
              },
              {
                "point": "D. If the player does not leave the pitch upon being informed of the infringement, or re-enters play without correcting the infringement, that player is subject to penalty for disregarding an official's directive."
              }
            ],
            "violations": [
              {
                "description": "disregarding an official's directive",
                "penalty": "YellowCard"
              }
            ]
          },
          {
            "ruleId": "2.5.8",
            "ruleTitle": "Venue specific equipment restrictions",
            "description": "Event directors may ban non-required equipment in order to comply with venue requirements",
            "violations": [
              {
                "description": "using equipment explicitly barred by the event director",
                "penalty": "RedCard"
              }
            ]
          },
          {
            "ruleId": "2.5.9",
            "ruleTitle": "Intentionally altering equipment",
            "description": "It is illegal to intentionally alter any game equipment, including the game balls and hoops, in order to gain an advantage.",
            "violations": [
              {
                "description": "illegally altering game equipment",
                "penalty": "RedCard"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "sectionId": "3",
    "sectionTitle": "GAME PROCEDURES",
    "subSections": [
      {
        "subSectionId": "3.1",
        "subSectionTitle": "Preliminaries",
        "content": [
          {
            "ruleId": "3.1.1",
            "ruleTitle": "Pregame meeting",
            "description": "Before any game, the head referee calls together representatives of the two teams to go over general rules.",
            "details": [
              {
                "point": "A. Each team must designate one person to serve as speaking captain to represent the team during the game.",
                "subPoints": [
                  "i. The speaking captain must attend the pregame meeting.",
                  "ii. Additional team representatives may also attend the pregame meeting."
                ]
              },
              {
                "point": "B. At this time, the head referee should discuss the following with the team representatives:",
                "subPoints": [
                  "i. Any ground rules specific to the field.",
                  "ii. The identity of the flag runner.",
                  "iii. Any players the officials should be aware of regarding the gender maximum rule.",
                  "iv. Any other concerns from the attending parties that are specific to the game."
                ]
              }
            ]
          },
          {
            "ruleId": "3.1.2",
            "ruleTitle": "Coin toss",
            "description": "There shall be a coin toss at the conclusion of the pregame meeting.",
            "details": [
              {
                "point": "A. The toss shall be called while the coin is in the air by the team that has traveled farthest from its point of origin.",
                "subPoints": [
                  "i. Prior to the first game of the event, the event director may choose to set a different method of determining which team shall call the coin toss to be used during the event."
                ]
              },
              {
                "point": "B. The winner of the toss shall have first choice from among the three options listed in 3.1.2.C., or may defer that first choice to the opposing captain. The team that does not select first shall make the choices on the remaining two options."
              },
              {
                "point": "C. The options for the game shall be:",
                "subPoints": [
                  "i. Which set of hoops to defend.",
                  "ii. Which team's volleyball runner shall choose their starting position first.",
                  "iii. Which team's dodgeball runner shall choose their starting position first."
                ]
              },
              {
                "point": "D. The teams shall make their choices in the chosen order immediately after the coin toss."
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "3.2",
        "subSectionTitle": "Starting the game",
        "content": [
          {
            "ruleId": "3.2.1",
            "ruleTitle": "Starting lineup",
            "description": "At the call of the head referee, each team shall send their starting players to the starting lines.",
            "details": [
              {
                "point": "A. Each team must send one chaser and one beater to line up at the starting positions in the starting runner zone. These players will be the designated runners."
              },
              {
                "point": "B. The designated runners shall line up with their inside shoulder at least 0.5 meters away from the midline and within the starting runner zone.",
                "subPoints": [
                  "i. The volleyball runners shall start on the volleyball runner starting line, and the dodgeball runners shall start on the starting sideline.",
                  "ii. For each contested ball, the runner designated to choose their position first shall indicate their choice by placing their stick on their preferred side of the midline. The opposing runner shall then place their stick on the other side of the midline."
                ]
              },
              {
                "point": "C. One chaser from each team shall line up on the starting sideline in their opponent's half, outside of the starting runner zone and at least 1.5 meters away from the keeper zone line, and place their stick on the ground at that location."
              },
              {
                "point": "D. Once each team's offensive zone chaser has chosen their starting location, the remaining beater and chasers on both teams shall line up on the starting sideline in their own halves outside of the starting runner zone.",
                "subPoints": [
                  "i. No player may line up within 1 meter, as measured shoulder-to-shoulder, of the opposing chaser in their half."
                ]
              },
              {
                "point": "E. A player chooses their starting location by placing their stick on the ground at that location as a marker. Once the marker has been set, it is a locked-in player violation for a player to:",
                "subPoints": [
                  "i. Move any marker stick.",
                  "ii. Leave the immediate vicinity of their marker stick without permission from an official.",
                  "iii. Change their position headband.",
                  "iv. Change which player is starting, unless the original player is ejected or becomes too injured to play. This penalty should only be assessed against the original player."
                ]
              },
              {
                "point": "F. If any penalty cards are assessed prior to the start of the game, the player serving the penalty time shall start in the penalty box instead of on their starting line.",
                "subPoints": [
                  "i. If a designated runner receives a penalty, the team may replace them on their starting line with one of the other starting players of the same position."
                ]
              }
            ],
            "violations": [
              {
                "description": "locked-in player violation",
                "penalty": "BlueCard"
              }
            ]
          },
          {
            "ruleId": "3.2.2",
            "ruleTitle": "Sticks up procedure",
            "details": [
              {
                "point": "A. Once all players have taken their positions, the head referee confirms that both teams, all assistant referees, and any other officials are ready, and that all balls are resting in their appropriate positions (See rule 2.1.11 Ball positions).",
                "subPoints": [
                  "i. Any ball that moves off of its mark before sticks up, for any reason, must be reset before the head referee calls \"sticks up.\""
                ]
              },
              {
                "point": "B. The head referee calls \"sticks down.\" Starting players must take their stick in their hand, and hold it flat on the ground at the location where they placed it. Once \"sticks down\" has been called, the following applies until \"sticks up\" is called:",
                "subPoints": [
                  "i. Players may not contact the ground beyond their starting line with any part of their body or equipment, except the stick.",
                  "ii. Players must have their stick in hand but otherwise flat on the ground until the call of \"sticks up.\""
                ]
              },
              {
                "point": "C. The head referee shouts \"ready.\"",
                "subPoints": [
                  "i. Players may assume a starting position at the call of \"ready,\" but in doing so the stick must remain flat on the ground."
                ]
              },
              {
                "point": "D. A few seconds after the head referee calls \"ready\" the head referee then calls \"sticks up.\"",
                "subPoints": [
                  "i. On the first \"S\" sound of \"sticks up\" all players must immediately mount their sticks and begin play.",
                  "ii. If there is a false call of \"sticks up\" or a foul is committed prior to the \"sticks up\" call the head referee shall:",
                  "a. Adjudicate any appropriate penalties.",
                  "b. Reset the players to their positions at the \"sticks down\" call.",
                  "c. Repeat the sticks up procedure."
                ]
              },
              {
                "point": "E. A player has committed a false start if:",
                "subPoints": [
                  "i. The player already has their stick off the ground at the call of \"sticks up.\"",
                  "ii. The player moves early and touches the ground on the other side of their starting line prior to the call of \"sticks up.\""
                ]
              }
            ],
            "violations": [
              {
                "description": "false start",
                "penalty": "BlueCard"
              }
            ]
          },
          {
            "ruleId": "3.2.3",
            "ruleTitle": "Starting restrictions",
            "details": [
              {
                "point": "A. The two balls that start on the midline are the contested balls.",
                "subPoints": [
                  "i. Each ball remains a contested ball until it is either legally touched or no longer has any designated runners assigned to it.",
                  "ii. The referee should call a ball \"free\" if they believe that it may be unclear to the players that it is no longer a contested ball."
                ]
              },
              {
                "point": "B. A contested ball may only be touched by a designated runner."
              },
              {
                "point": "C. Designated runners may not push each other, slide, or dive.",
                "subPoints": [
                  "i. It is a designated runner violation if a player violates this rule in a way that would be legal between two players who are not designated runners."
                ]
              },
              {
                "point": "D. It is designated runner interference for a player who is not a designated runner to contact a designated runner or block their path. Designated runner interference is illegal."
              },
              {
                "point": "E. A player ceases to be a designated runner when any of the following occur:",
                "subPoints": [
                  "i. Their assigned ball has been legally touched.",
                  "ii. They leave the vicinity of the midline.",
                  "iii. They become off stick.",
                  "iv. They have a penalty assessed against them.",
                  "v. Their assigned ball is turned over."
                ]
              }
            ],
            "violations": [
              {
                "description": "illegally touching a contested ball",
                "penalty": "BlueCard"
              },
              {
                "description": "designated runner violation",
                "penalty": "BlueCard"
              },
              {
                "description": "designated runner interference",
                "penalty": "YellowCard"
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "3.3",
        "subSectionTitle": "Stoppages",
        "content": [
          {
            "ruleId": "3.3.1",
            "ruleTitle": "Stopping play",
            "description": "To stop play:",
            "details": [
              {
                "point": "A. The referee blows a whistle in paired short blasts."
              },
              {
                "point": "B. The timekeeper stops the game time and all other time clocks."
              },
              {
                "point": "C. All players currently in play must stop, drop their sticks, and hold their respective positions.",
                "subPoints": [
                  "i. The players maintain any balls they possessed at the stoppage whistle, unless the ball is turned over.",
                  "a. Players must not take hold of or otherwise move any other balls during a stoppage.",
                  "ii. Any players who are paused in an illegal position are adjusted immediately to a legal position.",
                  "iii. Any players who accidentally and significantly moved after the whistle are returned to their location at the time the whistle was blown."
                ]
              }
            ],
            "violations": [
              {
                "description": "intentionally illegally moving during a stoppage",
                "penalty": "YellowCard"
              },
              {
                "description": "intentionally illegally moving or taking hold of a ball during a stoppage",
                "penalty": "YellowCard"
              }
            ]
          },
          {
            "ruleId": "3.3.2",
            "ruleTitle": "Stoppage procedures",
            "description": "While play is stopped:",
            "details": [
              {
                "point": "A. The head referee consults with other officials as necessary."
              },
              {
                "point": "B. The head referee adjudicates any fouls and communicates the type of foul to the players, scorekeeper, and spectators:",
                "subPoints": [
                  "i. Any player who receives penalty time is sent to the penalty box.",
                  "ii. Any player who is ejected is removed from the player area."
                ]
              },
              {
                "point": "C. If a change of possession occurs, the appropriate procedure shall be followed before play is restarted."
              },
              {
                "point": "D. Any loose live ball that was propelled and had not touched anything (including other players, equipment, or the ground) before the whistle to stop play is returned to the player who propelled it.",
                "subPoints": [
                  "i. This rule does not take effect if the ball is otherwise turned over.",
                  "ii. If the propelling player is not eligible to receive the ball, it shall not be moved by this rule."
                ]
              },
              {
                "point": "E. Any loose ball that was propelled and had touched something (including other players, equipment, or the ground) before the whistle to stop play shall continue its motion until it comes to rest or becomes out of bounds.",
                "subPoints": [
                  "i. If the ball became out of bounds after the whistle, it is placed approximately 2 meters inbounds from the point where it crossed the boundary line and does not need to be inbounded by either team.",
                  "ii. If the ball moves after coming to rest, it shall be placed at the spot where it initially came to rest.",
                  "iii. This rule does not take effect if another rule would move this ball elsewhere."
                ]
              },
              {
                "point": "F. Any external interference is removed."
              },
              {
                "point": "G. Any other concerns, including injured players and defective equipment, are addressed."
              },
              {
                "point": "H. If the volleyball will be dead when play is restarted, it is given to the formerly defending keeper."
              }
            ]
          },
          {
            "ruleId": "3.3.3",
            "ruleTitle": "Restarting play",
            "description": "In order to restart play:",
            "details": [
              {
                "point": "A. The head referee indicates to the players that play is about to resume by calling for the players to \"remount!\"",
                "subPoints": [
                  "i. Players must remount their sticks where the sticks were left when play was stopped.",
                  "ii. Players must stand at the call to remount.",
                  "iii. Players must release all contact with their opponents during the stoppage, and must release their hold on any jointly controlled balls.",
                  "a. If a player had an opponent legally wrapped when play was stopped, they still must release all contact. Prior to the restart whistle the player may choose to move to any side of the formerly wrapped player.",
                  "1. The player must remain within 1 meter of their opponent.",
                  "2. If either the formerly wrapped player would not resume play with possession of a ball, or a penalty card or turnover penalty is assessed against the wrapping player's team during the stoppage, the player shall not be allowed to move around their opponent.",
                  "b. If two or more players shared joint control of a ball at the moment when play was stopped, each may retake hold of that ball before the restart.",
                  "1. They do not need to hold it in the same way they had when play was stopped, but they must not prevent the other players involved from getting an equal grip.",
                  "iv. While preparing for play to resume, players may:",
                  "a. Lean towards a loose ball, but they may not place any part of their body or equipment directly over the ball, unless it is impossible to do so.",
                  "b. lean towards and reach around their opponents to prepare for contact after the whistle, but must not contact their opponent.",
                  "v. Players may otherwise reposition themselves to prepare for the restart but must not commit a false restart.",
                  "a. It is a false restart if a player does any of the following before the restart whistle:",
                  "1. Begins the forward motion of a throw.",
                  "2. Initiates new contact.",
                  "3. Begins to move off of their location.",
                  "4. Attempts to directly affect a ball that the player does not solely possess.",
                  "5. Enters the cylinder above a loose ball.",
                  "b. If there is a false restart, play remains stopped, and any player who moved is returned to their previous location.",
                  "c. The first false restart of a stoppage will result in a warning to all players on the field.",
                  "1. Any subsequent false restart by any player on the same stoppage shall result in a penalty."
                ]
              },
              {
                "point": "B. The head referee blows one short whistle blast. On this whistle blast:",
                "subPoints": [
                  "i. Play resumes.",
                  "ii. The timekeeper resumes the game time and all other time clocks."
                ]
              }
            ],
            "violations": [
              {
                "description": "second false restart",
                "penalty": "BackToHoops"
              }
            ]
          },
          {
            "ruleId": "3.3.4",
            "ruleTitle": "Timeouts",
            "details": [
              {
                "point": "A. There are two methods for calling a timeout.",
                "subPoints": [
                  "i. The speaking captain may request a timeout during any stoppage.",
                  "ii. The speaking captain may request a timeout during any lull in play during the first 19 minutes of game time. A lull in play occurs whenever there is no active play happening on the field.",
                  "a. The timekeeper must clearly announce the 19-minute mark of game time.",
                  "b. The referee should quickly check the field for any active plays, including plays involving beaters or dodgeballs, before granting this type of stoppage.",
                  "iii. The timeout shall be denied if neither of these conditions are met.",
                  "a. If the timeout is not granted, the referee must explicitly deny the request.",
                  "iv. Each team may only call one timeout in each game.",
                  "v. A penalty for an illegal timeout request shall only apply if the request was intentionally illegal or if the referee stops play or otherwise grants the request before realizing it was illegal.",
                  "a. If play was stopped in error because the referee was unaware of an active play somewhere, the speaking captain should not be penalized as long as the request was made in good faith."
                ]
              },
              {
                "point": "B. When a timeout is properly called:",
                "subPoints": [
                  "i. If play is live, the head referee shall stop play.",
                  "ii. The head referee shall inform the scorekeeper that a timeout has been called.",
                  "iii. Once all applicable stoppage procedures in rule 3.3.2 are completed, the one minute of the timeout starts.",
                  "iv. The head referee shall blow one long whistle blast 45 seconds into the timeout.",
                  "v. After the completion of the timeout, the head referee shall resume play using the standard restart procedure (See rule 3.3.3 Restarting play).",
                  "a. Any player who is not mounted on their stick at the restart whistle is dismounted."
                ]
              }
            ],
            "violations": [
              {
                "description": "illegal timeout request",
                "penalty": "BlueCard"
              }
            ]
          },
          {
            "ruleId": "3.3.5",
            "ruleTitle": "Heat stoppages",
            "description": "At some point within 24 hours of the start of an event day, the event director or their designated representative shall check the weather forecast for the location and hours of the event. If the conditions in Appendix B are met or exceeded at any point during the event day, heat stoppages shall be in effect for the event's games that day.",
            "details": [
              {
                "point": "A. When in effect, heat stoppages shall be triggered when the game clock reaches 15 minutes, 25 minutes, and every 5 minutes thereafter.",
                "subPoints": [
                  "i. If a team is within one goal of the target score when a heat stoppage would have been called, the head referee shall verbally declare a skipped heat stoppage instead of stopping play.",
                  "a. If a heat stoppage is skipped in this manner, the following heat stoppage shall not be skipped and may be extended to 4 minutes at the discretion of the head referee."
                ]
              },
              {
                "point": "B. For each heat stoppage, the head referee shall stop play at the end of the drive that is in progress when the trigger time is reached.",
                "subPoints": [
                  "i. If the volleyball is dead when the trigger time is reached, the head referee shall stop play immediately.",
                  "ii. If play stops for any other reason prior to the end of the drive, the heat stoppage shall occur as an extension of that stoppage."
                ]
              },
              {
                "point": "C. The first heat stoppage shall last 4 minutes. Other heat stoppages shall last 2 minutes."
              },
              {
                "point": "D. If both heat index and hourly humidity information are not reasonably available to the event director, they may use a \"feels like\" temperature or similar metric. If used, a \"feels like\" temperature of 32 °C or greater during the event hours shall require the use of heat stoppages."
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "3.4",
        "subSectionTitle": "Regulating game time",
        "content": [
          {
            "ruleId": "3.4.1",
            "ruleTitle": "Game time",
            "description": "Game time is measured beginning from the first \"S\" sound of \"sticks up.\"",
            "details": [
              {
                "point": "A. The game time, and any time associated with it, must be paused for all complete stoppages of play and resumed when play is resumed."
              }
            ]
          },
          {
            "ruleId": "3.4.2",
            "ruleTitle": "Seeker floor",
            "description": "The seeker floor is the first 20 minutes of game time, during which the flag may not be caught.",
            "details": [
              {
                "point": "A. Seeker floors must be measured in game time."
              },
              {
                "point": "B. During a seeker floor, there are no seekers in play."
              },
              {
                "point": "C. A seeker from each team should report to the timekeeper at or before the 19-minute mark of game time.",
                "subPoints": [
                  "i. Seekers are considered substitutes during the seeker floor and may not enter the pitch until they are released by the timekeeper.",
                  "ii. There is no penalty for failing to report to the timekeeper prior to the 19-minute mark of game time. However, each team's initial seeker for the game must check in with the timekeeper and be released onto the pitch directly from the penalty box.",
                  "a. A player who enters the pitch as their team's initial seeker for the game before being released by the timekeeper has committed a seeker false start and must serve the penalty time as a seeker."
                ]
              },
              {
                "point": "D. The flag runner must enter the player area between the 19- and 20-minute marks of game time."
              },
              {
                "point": "E. At the end of the seeker floor, the timekeeper releases the seekers into play from their respective penalty boxes."
              }
            ],
            "violations": [
              {
                "description": "seeker false start",
                "penalty": "BlueCard"
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "3.5",
        "subSectionTitle": "Ending the game and overtime",
        "content": [
          {
            "ruleId": "3.5.1",
            "ruleTitle": "Resolving the flag catch",
            "description": "After the flag catch has been confirmed and the catching team has been awarded 30 points:",
            "details": [
              {
                "point": "A. If the catching team has more points than the other team, the catching team wins, and the head referee must blow three long whistle blasts to indicate the end of the game."
              },
              {
                "point": "B. If the catching team does not have more points than the other team, the game shall proceed to overtime."
              }
            ]
          },
          {
            "ruleId": "3.5.2",
            "ruleTitle": "Proceeding to overtime",
            "description": "When a game proceeds to overtime:",
            "details": [
              {
                "point": "A. The flag runner leaves the player area."
              },
              {
                "point": "B. Seekers return to their benches as substitutes.",
                "subPoints": [
                  "i. If a seeker would be serving time in the penalty box when play resumes, they must immediately switch positions by switching headbands with a player in play other than the keeper. They serve the remainder of the penalty in that position and the new seeker returns to the bench as a substitute.",
                  "ii. If this causes a team to violate the gender maximum rule, that team must correct the violation with as few substitutions as possible before play is restarted."
                ]
              },
              {
                "point": "C. All other players remain where they are during the stoppage."
              },
              {
                "point": "D. The target score is set at the non-catching team's score plus 30 points."
              },
              {
                "point": "E. The head referee announces the current scores and the target score."
              },
              {
                "point": "F. Play resumes using the standard restart procedure. (See rule 3.3.3 Restarting play)."
              }
            ]
          },
          {
            "ruleId": "3.5.3",
            "ruleTitle": "Reaching the target score",
            "description": "When a team reaches the target score:",
            "details": [
              {
                "point": "A. The head referee shall stop play."
              },
              {
                "point": "B. After confirming with all officials that there are no remaining issues or penalties to address, the head referee must blow three long whistle blasts to indicate the end of the game."
              },
              {
                "point": "C. The team that reached the target score wins."
              }
            ]
          },
          {
            "ruleId": "3.5.4",
            "ruleTitle": "Conceding during overtime",
            "description": "At any point during overtime, either team may concede the game.",
            "details": [
              {
                "point": "A. If the conceding team is trailing, the referee shall signal the end of the game using three long whistle blasts. The score at the time of concession shall be the final score, and the non-conceding team wins."
              },
              {
                "point": "B. If the conceding team is not trailing, the non-conceding team shall be awarded goals sufficient to give them a 10 point lead. The head referee shall signal the end of the game using three long whistle blasts. The resulting score shall be the final score, and the non-conceding team wins."
              },
              {
                "point": "C. Only the speaking captain may concede the game for their team. A speaking captain's concession is final."
              },
              {
                "point": "D. The captain may concede at any time during overtime, including when play is not stopped or before play resumes after the catch."
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "3.6",
        "subSectionTitle": "Forfeits",
        "content": [
          {
            "ruleId": "3.6.1",
            "ruleTitle": "Declaring a forfeit",
            "details": [
              {
                "point": "A. The head referee must declare a game forfeit if:",
                "subPoints": [
                  "i. The speaking captain of a team officially requests a forfeit.",
                  "ii. A team refuses to resume a suspended game without the agreement of their opponent and the event director.",
                  "iii. A forfeit penalty is administered."
                ]
              },
              {
                "point": "B. A game may be declared forfeit due to violations of league or event policy."
              },
              {
                "point": "C. In the event of a forfeit:",
                "subPoints": [
                  "i. The game is over immediately and the forfeiting team is declared the losing team.",
                  "ii. All players should clear the pitch."
                ]
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "3.7",
        "subSectionTitle": "Suspended games",
        "content": [
          {
            "ruleId": "3.7.1",
            "ruleTitle": "Declaring a suspended game",
            "details": [
              {
                "point": "A. The head referee or event director may declare a game suspended due to weather, safety concerns, extreme or inappropriate conduct, external interference, a change of pitches, or an extended stoppage that requires the balls or sticks to be moved significantly."
              },
              {
                "point": "B. Suspended games must be recorded with the current game time, score, players in the penalty box and their remaining penalty time, and which team is in possession of all game balls.",
                "subPoints": [
                  "i. Loose balls, other than the flag, shall be assigned to the teams based on which team the head referee reasonably believes would have next possessed them.",
                  "a. The head referee shall generally assign the ball based on the closest eligible player without a ball unless:",
                  "1. The ball was clearly guarded by an armed beater.",
                  "2. A beater's position would be used to assign two different balls.",
                  "b. No more than two dodgeballs may be assigned to one team.",
                  "c. If both beaters on one team are in the penalty box, they shall still be assigned at least one dodgeball."
                ]
              },
              {
                "point": "C. Suspended games should be resumed as soon as possible after it has become safe to do so."
              }
            ]
          },
          {
            "ruleId": "3.7.2",
            "ruleTitle": "Resuming a suspended game",
            "details": [
              {
                "point": "A. If any of the game's original officials are unavailable, the event director or head referee shall replace them."
              },
              {
                "point": "B. Teams may make substitutions during the suspension without following the substitution procedure.",
                "subPoints": [
                  "i. Any player serving time in the penalty box may not be substituted out during the suspension.",
                  "a. If the player in the penalty box is unavailable, their remaining penalty time must be served by another eligible player on the roster.",
                  "ii. If a player receives a penalty card for a foul occurring during the suspension, it shall be treated as a penalty against a substitute, and the speaking captain may choose the position at which the penalty shall be served."
                ]
              },
              {
                "point": "C. All players to be in play for the restart shall line up anywhere in their respective keeper zones.",
                "subPoints": [
                  "i. The teams shall take possession of the balls which they possessed or were assigned when the game was suspended.",
                  "ii. In the event that a team has both beaters in the penalty box, their dodgeball shall be placed next to their center hoop."
                ]
              },
              {
                "point": "D. If the suspension occurred after 19 minutes and before the flag had been legally caught, the flag runner should enter the pitch before the game resumes.",
                "subPoints": [
                  "i. If seekers had not yet been released, a seeker from each team should report to the scorekeeper before the game is restarted.",
                  "ii. Any flag handicaps that had been implemented prior to the suspension are still in effect when the game resumes."
                ]
              },
              {
                "point": "E. The head referee checks that both teams and all officials are ready."
              },
              {
                "point": "F. The referee calls \"ready\""
              },
              {
                "point": "G. A few seconds later, the head referee blows one short whistle blast. On this whistle blast:",
                "subPoints": [
                  "i. Play resumes.",
                  "ii. The timekeeper resumes the game time and all other time clocks."
                ]
              },
              {
                "point": "H. It is a false start if a player touches the ground in front of their keeper zone line between the ready call and the whistle to restart play."
              }
            ],
            "violations": [
              {
                "description": "false start",
                "penalty": "BlueCard"
              }
            ]
          },
          {
            "ruleId": "3.7.3",
            "ruleTitle": "Abandoned games",
            "details": [
              {
                "point": "A. If a suspended game cannot be resumed during the event at which it is being held, the event director must declare the game abandoned."
              },
              {
                "point": "B. If the speaking captains of both teams and the event director mutually decide to not restart a suspended game, then the event director may declare the game abandoned.",
                "subPoints": [
                  "i. If one or both teams refuses to resume play without the agreement of the opposing team and the event director, the team(s) shall be declared to have forfeited the game."
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "sectionId": "4",
    "sectionTitle": "SCORING",
    "subSections": [
      {
        "subSectionId": "4.1",
        "subSectionTitle": "Goal scoring",
        "content": [
          {
            "ruleId": "4.1.1",
            "ruleTitle": "Good goal",
            "description": "Ten points are scored by a team when the volleyball passes entirely through their opponent's hoops, regardless of who propelled it, and the goal is confirmed as good.",
            "details": [
              {
                "point": "A. All of the following must be true for a goal to be counted as good:",
                "subPoints": [
                  "i. The whole volleyball passed through one of the hoops.",
                  "a. Goals may be scored through either side of the hoops.",
                  "ii. The volleyball was not dead.",
                  "iii. The volleyball was not unscorable (See rule 5.6.3 Unscorable volleyball).",
                  "iv. The goal did not occur between a foul resulting in a penalty card by any member of the scoring team and the time the card was given to the player.",
                  "v. The goal did not occur between a foul resulting in a volleyball turnover by any member of the scoring team and the completion of that turnover.",
                  "vi. The scoring player did not commit a foul resulting in a back to hoops penalty, penalty card, or ejection immediately before receiving the volleyball or while in contact with a live volleyball.",
                  "vii. The hoop was not dislodged or otherwise unplayable (See rule 4.3.1 Scoring through a dislodged hoop)."
                ]
              },
              {
                "point": "B. The volleyball becomes dead as soon as a good goal has been scored."
              },
              {
                "point": "C. The head referee must confirm that a goal is good by blowing one long whistle blast and raising both arms."
              },
              {
                "point": "D. Any otherwise good goal made after the flag was legally caught must be disallowed (See rule 4.4.3 Closely timed plays)."
              }
            ]
          },
          {
            "ruleId": "4.1.2",
            "ruleTitle": "Goaltending",
            "details": [
              {
                "point": "A. A play is considered goaltending, and is scored as if the volleyball had gone through the hoop, if either of the following are true:",
                "subPoints": [
                  "i. A player within their own keeper zone, other than the keeper, touches the volleyball with a part of themselves or their equipment that is extended through a hoop from the side where the volleyball would exit.",
                  "ii. A player within their own keeper zone, other than the keeper, touches the volleyball while it is part way through a hoop with a part of themselves or their equipment that is positioned on the opposite side of the hoop from where the volleyball entered and is not extended through that hoop."
                ]
              },
              {
                "point": "B. A beater or seeker who intentionally goaltends has committed intentional interposition goaltending."
              }
            ],
            "violations": [
              {
                "description": "intentional interposition goaltending",
                "penalty": "RedCard"
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "4.2",
        "subSectionTitle": "Restarting after a goal",
        "content": [
          {
            "ruleId": "4.2.1",
            "ruleTitle": "Dead volleyball",
            "description": "After a goal is scored and before volleyball play is restarted, the volleyball is dead.",
            "details": [
              {
                "point": "A. Any player on the formerly defending keeper's team may carry or pass the dead volleyball to the keeper in that keeper's own keeper zone, but may not otherwise interact with the dead volleyball.",
                "subPoints": [
                  "i. Substitutes may pass the dead volleyball to their keeper in this manner, but must always remain in the substitution area or bench while doing so."
                ]
              },
              {
                "point": "B. The formerly offensive team may not pick up or otherwise intentionally interact with the dead volleyball unless it is providing it to the keeper at the formerly defending team's request.",
                "subPoints": [
                  "i. The formerly offensive team may choose to decline that request."
                ]
              },
              {
                "point": "C. Players shall not be penalized for playing as if the volleyball is live before the goal is confirmed.",
                "subPoints": [
                  "i. This shall not apply if the player is ruled to be acting with the intent to affect the restart of the volleyball game."
                ]
              },
              {
                "point": "D. The formerly defending keeper may request that a referee deliver the volleyball."
              },
              {
                "point": "E. If a penalty turns over a dead volleyball to the formerly offensive team, the volleyball becomes live upon the restart after the turnover."
              }
            ],
            "violations": [
              {
                "description": "intentionally and illegally interacting with a dead volleyball",
                "penalty": "BlueCard"
              }
            ]
          },
          {
            "ruleId": "4.2.2",
            "ruleTitle": "Keeper restart",
            "description": "If the formerly defending keeper is the first person to possess the dead volleyball after the confirmation of a goal, it becomes live, restarting the volleyball game, once they possess it anywhere in their half of the pitch.",
            "details": [
              {
                "point": "A. If anyone else possesses the volleyball first, the keeper must possess the volleyball in their own keeper zone to make it live."
              },
              {
                "point": "B. The head referee must blow one short whistle blast after volleyball play is restarted by the keeper's possession."
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "4.3",
        "subSectionTitle": "Broken or fallen hoops",
        "content": [
          {
            "ruleId": "4.3.1",
            "ruleTitle": "Scoring through a dislodged hoop",
            "description": "No one may score on a hoop that has become dislodged. A dislodged hoop is defined as being broken, displaced, in any way knocked down, or unplayable.",
            "details": [
              {
                "point": "A. If a hoop is in the process of falling when the volleyball passes completely through it, the goal still counts.",
                "subPoints": [
                  "i. A falling hoop is considered dislodged when the hoop-loop touches the ground or the hoop otherwise comes to at least temporary rest in a non-upright position, including on top of a player."
                ]
              },
              {
                "point": "B. Hoop loops that are turned in such a way that they are no longer in line with the goal line are not dislodged and may be scored upon.",
                "subPoints": [
                  "i. Turned hoops should be returned to the proper position once active play leaves the area."
                ]
              },
              {
                "point": "C. A hoop is broken when the pole or hoop loop breaks or when the hoop loop detaches from the pole."
              },
              {
                "point": "D. If the head referee determines a hoop is dislodged, they may verbally declare it dislodged."
              },
              {
                "point": "E. A dislodged hoop must be fixed and returned to its correct position before a goal may again be scored on that hoop."
              }
            ]
          },
          {
            "ruleId": "4.3.2",
            "ruleTitle": "Dislodged hoop procedure",
            "description": "When a hoop is dislodged, play generally continues.",
            "details": [
              {
                "point": "A. If a hoop is dislodged and any of the following occur, play must be stopped:",
                "subPoints": [
                  "i. A broken hoop poses a threat to the safety of the players.",
                  "ii. A broken hoop requires extra parts or an unusually long time to fix and the team defending that broken hoop is the offensive team.",
                  "a. The head referee may wait for a lull in play to initiate this stoppage.",
                  "iii. All three hoops in the same keeper zone are dislodged."
                ]
              },
              {
                "point": "B. Any dislodged hoops must be reset to their proper positions during any stoppage."
              },
              {
                "point": "C. If play is not stopped for a dislodged hoop, it must be fixed while play has moved away from the area."
              },
              {
                "point": "D. The volleyball carrier may request play be stopped to fix an opponent's dislodged hoop if the volleyball carrier is in their own half of the player area and is not contacted by an opposing player.",
                "subPoints": [
                  "i. If the request meets the above conditions, the head referee shall grant the request."
                ]
              }
            ]
          },
          {
            "ruleId": "4.3.3",
            "ruleTitle": "Dislodging, spinning, and resetting hoops",
            "details": [
              {
                "point": "A. Players may not reset their opponent's dislodged hoops while their team is the offensive team."
              },
              {
                "point": "B. Players may not recklessly or repeatedly dislodge hoops.",
                "subPoints": [
                  "i. This rule does not apply in the following instances:",
                  "a. A hoop is dislodged by a thrown ball.",
                  "b. An offensive volleyball player dislodges a hoop while attempting a contested score.",
                  "c. A player dislodges a hoop as a result of their own physical interaction with an opposing player.",
                  "ii. If a player illegally dislodges a hoop while successfully attempting to score a goal, that goal shall not be negated by the penalty for dislodging the hoop."
                ]
              },
              {
                "point": "C. A player may not intentionally dislodge a hoop."
              },
              {
                "point": "D. A player may not move or alter a hoop for the purpose of affecting whether the volleyball will pass through it."
              }
            ],
            "violations": [
              {
                "description": "illegally resetting an opponent's hoop",
                "penalty": "BlueCard"
              },
              {
                "description": "unintentionally dislodging hoops repeatedly",
                "penalty": "BlueCard"
              },
              {
                "description": "recklessly dislodging a hoop",
                "penalty": "YellowCard"
              },
              {
                "description": "intentionally dislodging a hoop",
                "penalty": "RedCard"
              },
              {
                "description": "moving or altering a hoop to affect whether the volleyball will pass through it",
                "penalty": "RedCard"
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "4.4",
        "subSectionTitle": "The flag catch",
        "content": [
          {
            "ruleId": "4.4.1",
            "ruleTitle": "The flag catch",
            "description": "Thirty points are scored for a team when their seeker catches the flag and the catch is confirmed as good.",
            "details": [
              {
                "point": "A. A flag catch is confirmed when all of the following are true:",
                "subPoints": [
                  "i. A seeker has detached the flag ball from the flag runner and holds sole possession of the flag ball during the instant that it is separated from the flag runner.",
                  "ii. The flag ball was securely attached to the shorts of the flag runner before the catch.",
                  "iii. The flag runner was not down at the time of the catch (See rule 8.4.1 Down flag runner).",
                  "iv. The catching seeker did not commit a foul resulting in a back to hoops penalty, penalty card, or ejection immediately before or during the catch.",
                  "v. The catch did not occur between a foul resulting in a penalty card by any member of the catching team and the time the card was given to the player.",
                  "vi. The catch did not occur between the catching team committing third dodgeball interference and the time the penalty for third dodgeball interference was administered.",
                  "vii. The flag was not physically impeded by any game official or member of the catching team in a way that may have contributed to the catch.",
                  "a. Physical impediments caused solely by the actions listed under 6.3.1.A. (Seeker interactions with the flag runner) shall be ignored, if those actions were executed legally by the seeker.",
                  "viii. The seeker was on stick at the time of the catch.",
                  "ix. The seekers did not simultaneously remove the flag from the flag runner.",
                  "x. Play was live when the flag was caught."
                ]
              }
            ]
          },
          {
            "ruleId": "4.4.2",
            "ruleTitle": "Signaling the catch",
            "details": [
              {
                "point": "A. If the head referee or flag referee believes that there may have been a good flag catch, play must be stopped."
              },
              {
                "point": "B. If the catch is confirmed, the catching team is awarded 30 points and the head referee signals whether the game is over or proceeds to overtime (See rule 3.5.1 Resolving the flag catch)."
              }
            ]
          },
          {
            "ruleId": "4.4.3",
            "ruleTitle": "Closely timed plays",
            "details": [
              {
                "point": "A. When a valid flag catch and either a foul by the catching team or a good goal by either team occur in quick succession, the head referee must determine which happened first based on the available evidence.",
                "subPoints": [
                  "i. Only statements by game officials shall be treated as evidence.",
                  "ii. If an otherwise good goal was scored after a valid flag catch was made, the goal will not be considered when determining whether the game will end or proceed to overtime.",
                  "a. If the flag catch would end the game, the goal must be disallowed.",
                  "b. If the game proceeds to overtime, the goal shall be counted after the set score is determined. The goal shall be considered to have been scored during overtime, and is not considered when setting the target score.",
                  "iii. If a valid flag catch occurred before the foul, the flag catch must be counted.",
                  "iv. If, and only if, there is no evidence whatsoever available as to which event occurred first, the head referee may declare the events synchronous.",
                  "a. If a flag catch-negating foul and an otherwise good flag catch are declared synchronous, the flag catch shall be disallowed.",
                  "b. If an otherwise good goal and an otherwise good flag catch are declared synchronous, the goal shall be treated as occurring first."
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "sectionId": "5",
    "sectionTitle": "DODGEBALLS AND KNOCKING PLAYERS OFF STICK",
    "subSections": [
      {
        "subSectionId": "5.1",
        "subSectionTitle": "The mounted stick",
        "content": [
          {
            "ruleId": "5.1.1",
            "ruleTitle": "Mounting the stick",
            "description": "All players must be mounted on a stick in order to participate in play.",
            "details": [
              {
                "point": "A. To mount the stick the player must have their stick straddled between their legs and touching some part of their body."
              },
              {
                "point": "B. The player remains mounted until one of the following occurs:",
                "subPoints": [
                  "i. Their stick (or arm that is holding the stick) no longer crosses the plane between the player's legs.",
                  "ii. The player loses contact with their stick.",
                  "iii. Their stick lays flat on the ground without the player's hand underneath it."
                ]
              }
            ]
          },
          {
            "ruleId": "5.1.2",
            "ruleTitle": "Dismounting",
            "description": "If a player becomes dismounted while in play, the player is immediately knocked off stick and must follow the back-to-hoops procedure.",
            "details": [
              {
                "point": "A. If a player is dismounted by the illegal actions of an opponent, an official may allow the player to immediately remount and continue play. If the player does not immediately remount, then they must follow the back-to-hoops procedure."
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "5.2",
        "subSectionTitle": "Knocking players off stick",
        "content": [
          {
            "ruleId": "5.2.1",
            "ruleTitle": "Becoming off stick",
            "details": [
              {
                "point": "A. A player is \"knocked off stick\" when either of the following occur:",
                "subPoints": [
                  "i. The player becomes dismounted.",
                  "ii. The player is struck by an opponent's live dodgeball.",
                  "a. This includes being struck on the player's hair, clothing, or equipment other than a game ball.",
                  "b. The term \"beat\" is used to mean a player being knocked off stick by an opponent's live dodgeball.",
                  "c. The following players are not beat when struck by an opponent's live dodgeball:",
                  "1. Protected keepers (See rule 7.2.2 Keeper-specific powers).",
                  "2. Beaters with dodgeball immunity (See rule 5.5.2 Claiming dodgeball immunity).",
                  "3. Inbounding players while out of bounds to inbound a ball (See rule 7.5.4 Inbounding procedure).",
                  "d. Beaters who are not immune may delay dismounting in order to attempt to catch the dodgeball that struck them, until it becomes dead (See rule 5.4.3 Struck beater)."
                ]
              },
              {
                "point": "B. Players must immediately follow the back-to-hoops procedure once knocked off stick (See rule 5.3.1 Back-to-hoops procedure).",
                "subPoints": [
                  "i. Players must not willfully ignore being off stick."
                ]
              }
            ],
            "violations": [
              {
                "description": "willfully ignoring being off stick",
                "penalty": "YellowCard"
              }
            ]
          },
          {
            "ruleId": "5.2.2",
            "ruleTitle": "Live dodgeball",
            "description": "In order to knock a player off stick, a dodgeball must be live.",
            "details": [
              {
                "point": "A. To be live, a dodgeball:",
                "subPoints": [
                  "i. Must either:",
                  "a. Be thrown, kicked, or otherwise intentionally propelled by a beater or",
                  "b. Be intentionally dropped by a beater when not required to be dropped by rule.",
                  "ii. Must not have been in contact with an opponent at the moment it was released, or otherwise finished being propelled.",
                  "iii. Must not have touched the ground, become out of bounds, or been caught.",
                  "a. In these cases, the dodgeball is live until the action indicated has occurred.",
                  "iv. Must not have been knocked loose by an opponent's body, another dodgeball, or the volleyball."
                ]
              },
              {
                "point": "B. Any dodgeball that is not live is considered \"dead.\""
              }
            ]
          },
          {
            "ruleId": "5.2.3",
            "ruleTitle": "Held dodgeballs",
            "details": [
              {
                "point": "A. A beater may not attempt to deceive an opponent by contacting them using a held dodgeball.",
                "subPoints": [
                  "i. Incidental contact with a held dodgeball shall not be penalized."
                ]
              }
            ],
            "violations": [
              {
                "description": "illegally contacting an opponent with a held dodgeball",
                "penalty": "BlueCard"
              }
            ]
          },
          {
            "ruleId": "5.2.4",
            "ruleTitle": "Friendly fire",
            "description": "A player cannot be beat by a dodgeball most recently made live by themselves or their teammate."
          },
          {
            "ruleId": "5.2.5",
            "ruleTitle": "Safe calls",
            "description": "If a player is struck by a dodgeball that cannot knock them off stick, the referee shall call that player \"safe\" or \"clear\" unless they otherwise become off stick.",
            "details": [
              {
                "point": "A. Players struck by a dodgeball should dismount and begin the back-to-hoops procedure immediately (unless the player is a struck beater attempting to catch the live dodgeball).",
                "subPoints": [
                  "i. If a player has been struck by a dodgeball, and is not called \"safe\" or \"clear\" by an official, then that player is knocked off stick."
                ]
              },
              {
                "point": "B. If the player dismounts due to being struck by a dodgeball but is then called \"safe\" or \"clear,\" the player may remount at an official's direction and continue play.",
                "subPoints": [
                  "i. If the player does not quickly remount at the official's direction, that player must instead complete the back-to-hoops procedure."
                ]
              },
              {
                "point": "C. If the player fails to begin the back-to-hoops procedure immediately, a penalty may apply.",
                "subPoints": [
                  "i. If the final call on that dodgeball hit is \"safe\" or \"clear,\" play shall continue and no penalty shall apply.",
                  "ii. If an official called the player \"safe\" or \"clear\" but the call changes to \"beat,\" the player shall receive no penalty for failing to dismount as long as the player responds to the \"beat\" call by dismounting.",
                  "iii. If no referee called the player \"safe\" or \"clear\" and the final call on that dodgeball hit is \"beat,\" the player shall be considered to be willfully ignoring being off stick.",
                  "a. If the official believes that the player was unaware that the dodgeball touched them, then the official may treat it as an unnoticed knock off stick (See rule 5.3.4 Unnoticed knock off stick).",
                  "1. A player's belief that they are otherwise safe from the dodgeball shall not be taken into consideration when determining any appropriate penalty."
                ]
              }
            ],
            "violations": [
              {
                "description": "willfully ignoring being off stick",
                "penalty": "YellowCard"
              }
            ]
          },
          {
            "ruleId": "5.2.6",
            "ruleTitle": "Head beats",
            "description": "A headbeat occurs when a player releases a dodgeball, and the first contact it makes after being released is with the head or neck of an opponent.",
            "details": [
              {
                "point": "A. A headbeat is illegal unless any of the following apply:",
                "subPoints": [
                  "i. The struck player changes the speed or direction of their head after the possessing beater begins the final motion of their beat attempt and as a result puts their head into the path of the dodgeball.",
                  "ii. It grazes the head or makes contact with negligible force.",
                  "iii. It is propelled without excessive force when the opposing player is approximately 5 meters or farther away."
                ]
              },
              {
                "point": "B. Any illegal headbeat that is also propelled using excessive force shall be penalized as an excessive force headbeat."
              }
            ],
            "violations": [
              {
                "description": "illegal headbeat",
                "penalty": "YellowCard"
              },
              {
                "description": "excessive force headbeat",
                "penalty": "RedCard"
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "5.3",
        "subSectionTitle": "Back-to-hoops procedure",
        "content": [
          {
            "ruleId": "5.3.1",
            "ruleTitle": "Back-to-hoops procedure",
            "description": "Off stick players remain off stick until they complete the following procedure, in order:",
            "details": [
              {
                "point": "A. Immediately give up possession of any ball by dropping it and dismount their stick.",
                "subPoints": [
                  "i. The player must not pass, toss, roll, or kick the ball, unless completing a natural motion already begun (See rule 5.6.2 Natural motion conditions).",
                  "ii. A dodgeball dropped in this way is dead.",
                  "iii. A volleyball dropped in this way is unscorable."
                ]
              },
              {
                "point": "B. Touch one of their own hoops.",
                "subPoints": [
                  "i. The player must touch either the hoop loop or pole, not the hoop base.",
                  "ii. The player must touch the hoop with some part of their body, not with their stick.",
                  "iii. The hoop must not be dislodged."
                ]
              },
              {
                "point": "C. Remount their stick before leaving the vicinity of the hoops."
              }
            ],
            "violations": [
              {
                "description": "violating the back-to-hoop procedure",
                "penalty": "RepeatProcedure"
              },
              {
                "description": "intentionally or repeatedly violating the back-to-hoops procedure",
                "penalty": "YellowCard"
              }
            ]
          },
          {
            "ruleId": "5.3.2",
            "ruleTitle": "Off stick players",
            "description": "Off stick players must not interact with play and must therefore:",
            "details": [
              {
                "point": "A. Not make any plays."
              },
              {
                "point": "B. Not propel or otherwise play any game ball other than in cases of natural motion (See rule 5.6.2 Natural motion conditions).",
                "subPoints": [
                  "i. If the player illegally propels a ball immediately after the player is knocked off stick, it shall be adjudicated as a natural motion violation."
                ]
              },
              {
                "point": "C. Drop any balls that are currently possessed."
              },
              {
                "point": "D. Actively avoid interactions with other players."
              },
              {
                "point": "E. Not substitute out while play is live."
              }
            ],
            "violations": [
              {
                "description": "illegally interacting with play while off stick",
                "penalty": "BlueCard"
              }
            ]
          },
          {
            "ruleId": "5.3.3",
            "ruleTitle": "Making contact as an off stick player",
            "details": [
              {
                "point": "A. An off stick player may not initiate any physical contact, other than incidental contact.",
                "subPoints": [
                  "i. If a player is in the final motion of making contact before becoming knocked off stick, they may complete that motion if it could not reasonably be stopped.",
                  "a. The player still must immediately act to cease that contact under the provisions of 5.3.3.B..",
                  "b. If a player takes multiple steps between being knocked off stick and initiating contact with an opponent, then that is illegally initiating contact while off stick.",
                  "ii. If a player initiates a push, body block, charge, or wrap after becoming off stick by dismounting, it is illegally initiating contact while off stick."
                ]
              },
              {
                "point": "B. If a player becomes off stick while already in contact with an opponent, they must immediately act to cease contact safely and with as little effect on the opponent as reasonably possible.",
                "subPoints": [
                  "i. Failure to do so is illegally continuing contact while off stick.",
                  "ii. If the player was off stick by dismounting, and then adds force to the contact that brings their opponent to the ground, that player must be penalized regardless of whether there was sufficient time to react to the dismount."
                ]
              }
            ],
            "violations": [
              {
                "description": "illegally continuing contact while off stick",
                "penalty": "BlueCard"
              },
              {
                "description": "illegally initiating contact while off stick",
                "penalty": "YellowCard"
              }
            ]
          },
          {
            "ruleId": "5.3.4",
            "ruleTitle": "Unnoticed knock off stick",
            "description": "If a player unintentionally continues play after dismounting or being beat:",
            "details": [
              {
                "point": "A. The referee should verbally and visually inform the player that the player has been knocked off stick."
              },
              {
                "point": "B. The referee may stop play in order to inform the player that they have been knocked off stick.",
                "subPoints": [
                  "i. If this occurs, any ball the player possessed when play was stopped is turned over to the opposing team."
                ]
              },
              {
                "point": "C. If a player affects play while unaware that they had been dismounted or beat, they shall be penalized for affecting play while unknowingly off stick.",
                "subPoints": [
                  "i. If the player makes otherwise legal contact while unaware of being off stick, they are only subject to this penalty for that contact.",
                  "ii. If a player propels a ball in violation of the natural motion rules immediately after being knocked off stick, they are not subject to this penalty for that propulsion (See rule 5.6.2 Natural motion conditions)."
                ]
              }
            ],
            "violations": [
              {
                "description": "affecting play while unknowingly off stick",
                "penalty": "BlueCard"
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "5.4",
        "subSectionTitle": "Redirecting and catching live dodgeballs",
        "content": [
          {
            "ruleId": "5.4.1",
            "ruleTitle": "Blocking and batting dodgeballs",
            "description": "A player in possession of a ball may attempt to block or bat an incoming live dodgeball with the ball in their possession:",
            "details": [
              {
                "point": "A. The held ball may be used to bat or otherwise propel the incoming dodgeball."
              },
              {
                "point": "B. A block or bat does not affect whether the dodgeball is live."
              },
              {
                "point": "C. A dead volleyball may not be used to intentionally interact with a dodgeball."
              },
              {
                "point": "D. Players may not intentionally use a held ball to interact with a dead dodgeball or a dodgeball that was made live by a teammate.",
                "subPoints": [
                  "i. If the referee determines that the player was not reasonably aware that the dodgeball was either dead or made live by their own teammate, and the play was otherwise legal, the player shall not be penalized."
                ]
              }
            ],
            "violations": [
              {
                "description": "illegal bat",
                "penalty": "BlueCard"
              },
              {
                "description": "illegal block",
                "penalty": "BlueCard"
              }
            ]
          },
          {
            "ruleId": "5.4.2",
            "ruleTitle": "Swatting dodgeballs",
            "description": "Any attempt to swat or otherwise intentionally propel a live dodgeball, other than through the use of another ball, is considered a dodgeball swat.",
            "details": [
              {
                "point": "A. Beaters may generally swat or make any attempt to alter the course of a live dodgeball.",
                "subPoints": [
                  "i. A struck beater may not swat any dodgeball, except as part of an attempt to catch it (See rule 5.4.3 Struck beater).",
                  "ii. A beater who is in possession of a dodgeball may not swat another dodgeball.",
                  "a. This rule does not prohibit batting a live dodgeball with a held dodgeball (See rule 5.4.1 Blocking and batting dodgeballs).",
                  "iii. If the dodgeball was already live, it remains live for the original team.",
                  "a. If it was live for the opposing team, the swatting beater becomes a struck beater."
                ]
              },
              {
                "point": "B. Chasers and seekers may not swat dodgeballs at any time.",
                "subPoints": [
                  "i. This rule does not prohibit batting a live dodgeball with a held volleyball (See rule 5.4.1 Blocking and batting dodgeballs).",
                  "ii. This rule does not prohibit shielding (See rule 7.1.2 Interposition ball interactions)."
                ]
              },
              {
                "point": "C. If a player is repeatedly illegally swatting dodgeballs, no harm no foul may not be called."
              }
            ],
            "violations": [
              {
                "description": "illegal dodgeball swat",
                "penalty": "BlueCard"
              }
            ]
          },
          {
            "ruleId": "5.4.3",
            "ruleTitle": "Struck beater",
            "description": "A non-immune beater is a struck beater, rather than beat, from the time they are hit by an opponent's live dodgeball until that dodgeball becomes dead. A struck beater is subject to the following restrictions:",
            "details": [
              {
                "point": "A. A struck beater is unable to make a dodgeball live."
              },
              {
                "point": "B. A struck beater must immediately drop any dodgeball that they are holding.",
                "subPoints": [
                  "i. The player must not pass, toss, roll, or kick the dodgeball, unless completing a natural motion already begun (See rule 5.6.2 Natural motion conditions).",
                  "ii. Failure to release the dodgeball is a struck beater violation."
                ]
              },
              {
                "point": "C. A struck beater must either attempt to catch the live dodgeball that struck them or immediately follow the back-to-hoops procedure.",
                "subPoints": [
                  "i. A beater is allowed to propel a dodgeball further into the air in the process of attempting a catch.",
                  "ii. After the initial hit, any intentional attempt by the struck beater to change the direction of any dodgeball, in any manner, other than to attempt to catch the dodgeball that struck them is a struck beater violation."
                ]
              },
              {
                "point": "D. If a struck beater takes any actions other than those outlined elsewhere in this rule, they are subject to the same rules and penalties for those actions as an off stick player."
              },
              {
                "point": "E. If a struck beater catches the dodgeball before it otherwise becomes dead, that beater is not beat by that dodgeball.",
                "subPoints": [
                  "i. A struck beater is still beat by all live dodgeballs propelled by opponents that hit them while they are a struck beater unless they also catch those dodgeballs before they become dead."
                ]
              },
              {
                "point": "F. A struck beater who fails to catch the dodgeball before it becomes dead is beat and must immediately begin the back-to-hoops procedure."
              }
            ],
            "violations": [
              {
                "description": "struck beater violation",
                "penalty": "BlueCard"
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "5.5",
        "subSectionTitle": "The third dodgeball and dodgeball immunity",
        "content": [
          {
            "ruleId": "5.5.1",
            "ruleTitle": "The third dodgeball",
            "description": "When one team has possession of two dodgeballs and the remaining dodgeball is unpossessed and dead, the free dead dodgeball becomes the third dodgeball.",
            "details": [
              {
                "point": "A. This ball remains the third dodgeball until one of the following occurs:",
                "subPoints": [
                  "i. The possessing team makes a reasonable beat attempt.",
                  "ii. The possessing team loses a dodgeball directly due to the actions of an opposing player.",
                  "iii. The team without a dodgeball gains possession of any dodgeball."
                ]
              },
              {
                "point": "B. Players on the possessing team may not commit third dodgeball interference.",
                "subPoints": [
                  "i. It is third dodgeball interference if either:",
                  "a. A player from the possessing team takes possession of or in any way attempts to move the third dodgeball.",
                  "b. A player from the possessing team prevents or delays the other team from getting to the third dodgeball by continually or intentionally moving into their path.",
                  "ii. The two dodgeballs turned over for third dodgeball interference are chosen at the referee's discretion, but should generally include the third dodgeball.",
                  "iii. Play must be stopped in order to adjudicate the penalty for third dodgeball interference.",
                  "a. Officials may delay the stoppage under advantage or delayed penalty as appropriate."
                ]
              }
            ],
            "violations": [
              {
                "description": "third dodgeball interference",
                "penalty": "BackToHoops, VolleyballTurnover, DoubleDodgeballTurnover"
              }
            ]
          },
          {
            "ruleId": "5.5.2",
            "ruleTitle": "Claiming dodgeball immunity",
            "description": "When there is a third dodgeball, a beater on the team with no dodgeballs may raise a hand above their shoulder, fist closed, to claim immunity from being beat.",
            "details": [
              {
                "point": "A. It is an improper immunity claim if a player claims immunity when the opposing team has two dodgeballs, but:",
                "subPoints": [
                  "i. The remaining dodgeball is still live.",
                  "ii. The third dodgeball was released by that player without attempting to beat an opponent.",
                  "iii. Their team's other beater is also claiming immunity.",
                  "a. If both beaters on a team attempt to claim immunity, one of them must put their fist back down to avoid a penalty. If neither beater puts their fist down, only one shall be penalized."
                ]
              },
              {
                "point": "B. It is an invalid immunity claim if a beater claims immunity when there is no third dodgeball, unless the opposing team has two dodgeballs and the remaining dodgeball is live.",
                "subPoints": [
                  "i. If the claim was unintentionally invalid, and did not affect play, the player may instead be penalized for a minor invalid immunity claim."
                ]
              },
              {
                "point": "C. The immune beater is not immune to dodgeballs made live before immunity was claimed."
              },
              {
                "point": "D. If an opponent begins the final singular natural motion on an attempted beat before the immune beater loses their immunity, the formerly immune beater cannot be beat by that attempt."
              },
              {
                "point": "E. If the immune beater opens their fist, or lowers their fist below their shoulder, they shall lose their immunity until they return to having a closed fist above their shoulder.",
                "subPoints": [
                  "i. While the immune beater is directly attempting to pick up the third dodgeball, the beater shall retain their immunity until they gain possession of the third dodgeball, even if their fist is lowered below the shoulder or opened during that process.",
                  "ii. Losing immunity in this manner does not relieve the player of their obligations under 5.5.3 Immunity limitations."
                ]
              }
            ],
            "violations": [
              {
                "description": "improper immunity claim",
                "penalty": "BackToHoops"
              },
              {
                "description": "minor invalid immunity claim",
                "penalty": "BackToHoops"
              },
              {
                "description": "invalid immunity claim",
                "penalty": "BlueCard"
              }
            ]
          },
          {
            "ruleId": "5.5.3",
            "ruleTitle": "Immunity limitations",
            "description": "After legally claiming immunity:",
            "details": [
              {
                "point": "A. The beater must directly and immediately proceed to gain possession of the third dodgeball.",
                "subPoints": [
                  "i. The beater may approach the ball from any direction they prefer.",
                  "ii. Taking any other action after claiming immunity is an immunity violation."
                ]
              },
              {
                "point": "B. The beater remains subject to the above limitations until one of the following occurs:",
                "subPoints": [
                  "i. There is no longer a third dodgeball",
                  "a. If the status of the third dodgeball changes, the immune beater immediately loses immunity and must lower their hand.",
                  "ii. The beater becomes dismounted.",
                  "iii. Another dodgeball becomes unpossessed.",
                  "a. The player must give up their immunity to attempt to gain possession of the newly unpossessed dodgeball.",
                  "b. If the player chooses to retain their immunity, they must continue to attempt to gain possession of the third dodgeball."
                ]
              }
            ],
            "violations": [
              {
                "description": "immunity violation",
                "penalty": "BlueCard"
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "5.6",
        "subSectionTitle": "Natural motion",
        "content": [
          {
            "ruleId": "5.6.1",
            "ruleTitle": "Natural motion",
            "description": "When a player is knocked off stick or becomes a struck beater, that player may finish one singular natural motion that they had already started if that motion cannot be reasonably stopped."
          },
          {
            "ruleId": "5.6.2",
            "ruleTitle": "Natural motion conditions",
            "details": [
              {
                "point": "A. For natural motion to be called for propelling a ball, the following conditions apply:",
                "subPoints": [
                  "i. The player must release any possessed ball as part of the singular natural motion begun before being knocked off stick.",
                  "a. Any motion begun after the player is knocked off stick does not qualify as a natural motion.",
                  "ii. The player must already be in contact with the ball when knocked off stick."
                ]
              },
              {
                "point": "B. If a player propels a ball immediately after being knocked off stick without meeting the above conditions for natural motion, it is a natural motion violation."
              },
              {
                "point": "C. A dodgeball released by completing natural motion is considered dead."
              },
              {
                "point": "D. For the purpose of this rule, a struck beater is treated as off stick."
              }
            ],
            "violations": [
              {
                "description": "unintentional natural motion violation",
                "penalty": "Turnover"
              },
              {
                "description": "intentional natural motion violation",
                "penalty": "YellowCard"
              }
            ]
          },
          {
            "ruleId": "5.6.3",
            "ruleTitle": "Unscorable volleyball",
            "description": "If a player is touching the volleyball when they become off stick and releases it or otherwise propels it according to natural motion, the volleyball becomes an unscorable volleyball.",
            "details": [
              {
                "point": "A. An unscorable volleyball cannot result in a goal, even if the volleyball goes entirely through a hoop."
              },
              {
                "point": "B. The volleyball remains live and play continues normally."
              },
              {
                "point": "C. The volleyball becomes scorable again once either of the following occur:",
                "subPoints": [
                  "i. It is touched by an eligible chaser on the same team as the player who released it.",
                  "ii. It is possessed by any player."
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "sectionId": "6",
    "sectionTitle": "PHYSICAL CONTACT AND INTERACTIONS",
    "subSections": [
      {
        "subSectionId": "6.1",
        "subSectionTitle": "General interactions",
        "content": [
          {
            "ruleId": "6.1.1",
            "ruleTitle": "Illegal physical contact",
            "description": "The following forms of physical contact are always illegal unless the contact is determined by the referee to have been incidental:",
            "details": [
              {
                "point": "A. Intentionally contacting a player of another position."
              },
              {
                "point": "B. Intentionally contacting the flag runner, except for seekers."
              },
              {
                "point": "C. Kicking an opponent."
              },
              {
                "point": "D. Making forcible contact using the head."
              },
              {
                "point": "E. Making contact with an opponent's head, neck, or groin."
              },
              {
                "point": "F. Initiating contact or exerting force at or below the knees of an opponent."
              },
              {
                "point": "G. Tripping an opponent."
              },
              {
                "point": "H. Sliding or diving into an opponent."
              },
              {
                "point": "I. Jumping, leaping, or climbing onto any player."
              },
              {
                "point": "J. Intentionally lifting or continuing to hold another player off the ground, either an opponent or a teammate."
              },
              {
                "point": "K. Grabbing the stick or clothing of an opponent."
              },
              {
                "point": "L. Attempting to steal the volleyball from, contacting, or otherwise interacting with an opposing protected keeper who is in sole possession of the volleyball (See rule 7.2.2 Keeper-specific powers)."
              }
            ],
            "violations": [
              {
                "description": "illegal physical contact",
                "penalty": "StandardContactPenalty"
              }
            ]
          },
          {
            "ruleId": "6.1.10",
            "ruleTitle": "Limited contact from behind",
            "details": [
              {
                "point": "A. It is legal to place a hand or hands on an opponent from behind without applying force.",
                "subPoints": [
                  "i. This includes using an arm, without pushing, to prevent an opponent from moving toward oneself."
                ]
              },
              {
                "point": "B. Limited contact from behind is allowed in the following circumstances:",
                "subPoints": [
                  "i. Jostling for position.",
                  "ii. During an attempt to steal.",
                  "iii. Between two bent over players who are both attempting to gain possession of the same loose ball."
                ]
              },
              {
                "point": "C. Contact initiated from behind under this rule does not allow a player to engage in the contacts listed in 6.1.9."
              }
            ]
          },
          {
            "ruleId": "6.1.11",
            "ruleTitle": "Adjusting illegal contact",
            "details": [
              {
                "point": "A. A player who is forced to make illegal contact on an opposing player due to the direct actions of the opposing player must act immediately to readjust the contact to a legal position or discontinue the contact to avoid penalty.",
                "subPoints": [
                  "i. The player's readjustment must not use or further the illegal contact.",
                  "ii. If the player has enough time to adjust to a legal position prior to initiating contact, they must do so."
                ]
              }
            ]
          },
          {
            "ruleId": "6.1.12",
            "ruleTitle": "Playing recklessly",
            "description": "It is illegal to play recklessly. This includes playing with complete disregard for danger to others.",
            "violations": [
              {
                "description": "playing recklessly",
                "penalty": "YellowCard"
              },
              {
                "description": "playing egregiously recklessly",
                "penalty": "RedCard"
              }
            ]
          },
          {
            "ruleId": "6.1.13",
            "ruleTitle": "Egregious contact",
            "description": "Particularly egregious illegal contact is prohibited. The following are always egregiously illegal contact:",
            "details": [
              {
                "point": "A. Making contact using excessive force.",
                "subPoints": [
                  "i. Using excessive force is defined as when a player both exceeds by far the necessary use of force to complete the action initiated and as a result is in danger of injuring an opponent."
                ]
              },
              {
                "point": "B. Deliberately injuring or attempting to deliberately injure any person by using one's body or any equipment, including the balls."
              },
              {
                "point": "C. Striking or attempting to strike another person including but not limited to intentionally kneeing, elbowing, or headbutting an opponent."
              },
              {
                "point": "D. Intentionally physically contacting another person's head, neck, or groin."
              },
              {
                "point": "E. Intentionally physically contacting an official other than the flag runner."
              },
              {
                "point": "F. Charging a helpless receiver (See rule 6.1.7 Helpless receiver)."
              },
              {
                "point": "G. Tackling a helpless receiver (See rule 6.1.7 Helpless receiver)."
              }
            ],
            "violations": [
              {
                "description": "egregiously illegal contact against a teammate",
                "penalty": "Ejection"
              },
              {
                "description": "egregiously illegal contact against an opponent, spectator, official, or event staffer",
                "penalty": "RedCard"
              }
            ]
          },
          {
            "ruleId": "6.1.2",
            "ruleTitle": "Picks",
            "description": "A pick is when a player gets to a legal position on the field in the path of an opposing player for the purpose of slowing them down or making them change direction without initially engaging in a push, charge, or wrap.",
            "details": [
              {
                "point": "A. A pick is considered set once the picking player positions themselves in the anticipated path of their opponent."
              },
              {
                "point": "B. All picks are subject to the following rules and restrictions, regardless of whether either player involved has a ball:",
                "subPoints": [
                  "i. It is illegal to pick a player of another position.",
                  "ii. It is illegal to extend a single point of one's body during a pick, such as the elbow or point of the shoulder, causing the picked player to run into it.",
                  "iii. If the player initiates contact rather than being run into, this shall not be considered a pick.",
                  "iv. The player's feet do not need to be set in order for the play to be legal.",
                  "a. If the would-be picking player is moving directly at their opponent during the pick and contact is forceful, the play will instead be considered a charge."
                ]
              },
              {
                "point": "C. If neither player has possession of a ball, the following restrictions apply in addition to the general pick restrictions:",
                "subPoints": [
                  "i. A pick set from behind must initially give the picked player a step of room to stop and/or change direction.",
                  "ii. A pick set on a moving player must be set with enough time for the player to stop and/or change direction, as determined by the picked player's speed at the time that the pick is set, not by their actual awareness of the pick.",
                  "iii. The picked player must make every attempt to avoid charging the picking player, either by slowing down so that the initiation of contact is non-forceful or by avoiding the opposing player entirely.",
                  "a. Incidental contact shall not be penalized."
                ]
              },
              {
                "point": "D. If a picked player reacts to the pick by changing their path, any motion to move into the new path shall be considered a new pick."
              },
              {
                "point": "E. A player charging through an illegal pick shall not be penalized provided they do not increase their force in response to the pick."
              }
            ],
            "violations": [
              {
                "description": "illegal pick",
                "penalty": "StandardContactPenalty"
              },
              {
                "description": "illegally charging a picking player",
                "penalty": "StandardContactPenalty"
              }
            ]
          },
          {
            "ruleId": "6.1.3",
            "ruleTitle": "Kicking a contested ball",
            "description": "It is generally legal to kick a ball that an opponent is attempting to play. The following rules apply:",
            "details": [
              {
                "point": "A. A player must not kick any opponent."
              },
              {
                "point": "B. Kicking a ball that an opponent is touching with their hand is a dangerous kick."
              },
              {
                "point": "C. If the referee determines that a player's kick would have been illegal if the opponent had not reacted to the kick by actively getting out of the way, the kick must be ruled a dangerous kick."
              },
              {
                "point": "D. If the referee determines that the kicked or nearly kicked player was at fault for being kicked or nearly kicked because they moved into the way of the kick late, there is no foul under this rule."
              }
            ],
            "violations": [
              {
                "description": "dangerous kick",
                "penalty": "YellowCard"
              },
              {
                "description": "kicking an opponent",
                "penalty": "YellowCard"
              },
              {
                "description": "violent or egregious illegal kick",
                "penalty": "RedCard"
              }
            ]
          },
          {
            "ruleId": "6.1.4",
            "ruleTitle": "Sliding and diving",
            "description": "Players may slide or dive. However, it is illegal to:",
            "details": [
              {
                "point": "A. Slide or dive into an opponent."
              },
              {
                "point": "B. Slide or dive directly toward an opponent in a way that forces the opponent to change their movement to avoid the slide or dive."
              },
              {
                "point": "C. A player going straight down onto a ball is not considered to be sliding or diving."
              },
              {
                "point": "D. Dives or slides that do not violate the above conditions (e.g. side-by-side motion) and are not reckless, dangerous, or otherwise illegal are legal."
              }
            ],
            "violations": [
              {
                "description": "illegal slide",
                "penalty": "StandardContactPenalty"
              },
              {
                "description": "illegal dive",
                "penalty": "StandardContactPenalty"
              }
            ]
          },
          {
            "ruleId": "6.1.5",
            "ruleTitle": "Hurdling",
            "description": "Jumping or diving fully over any person is considered hurdling.",
            "details": [
              {
                "point": "A. It is illegal for a player to hurdle or attempt to hurdle any person who is not contacting the ground with any part of their body other than their feet.",
                "subPoints": [
                  "i. If the hurdling player was forced, by the sudden movement of the hurdled person, to make an illegal hurdle to avoid more dangerous contact, the hurdle shall not be penalized."
                ]
              },
              {
                "point": "B. If a player jumps so as to reach over or past another person, including but not limited to attempting to make a throw or catch the flag, and they come back down on the same side of the would-be hurdled person, this shall not be ruled a hurdle.",
                "subPoints": [
                  "i. If a player attempts to jump or dive fully over any person, but fails to do so, this shall be ruled as an attempted hurdle."
                ]
              },
              {
                "point": "C. If a player jumps without attempting a hurdle but falls over another person due to being contacted while in the air, it shall not be ruled as a hurdle."
              }
            ],
            "violations": [
              {
                "description": "illegally hurdling or attempting to hurdle any person",
                "penalty": "YellowCard"
              },
              {
                "description": "violently or egregiously illegally hurdling any person",
                "penalty": "RedCard"
              }
            ]
          },
          {
            "ruleId": "6.1.6",
            "ruleTitle": "Contact through a teammate",
            "details": [
              {
                "point": "A. It is illegal for any player to primarily contact a teammate with the intent of causing or otherwise affecting that teammate's physical interaction with any opponent."
              },
              {
                "point": "B. Incidental or secondary contact through a teammate shall not be penalized."
              }
            ],
            "violations": [
              {
                "description": "illegal contact through a teammate",
                "penalty": "StandardContactPenalty"
              }
            ]
          },
          {
            "ruleId": "6.1.7",
            "ruleTitle": "Helpless receiver",
            "description": "A receiver who is in the process of attempting to catch a ball that is in the air is considered a helpless receiver.",
            "details": [
              {
                "point": "A. A receiver does not have to leave the ground in order to be considered a helpless receiver."
              },
              {
                "point": "B. An airborne receiver remains helpless until their legs have absorbed the shock of the landing after either gaining sole and complete possession of the ball or abandoning the attempt to catch the ball."
              },
              {
                "point": "C. A helpless receiver may not be pushed, wrapped, charged, or tackled by any opponent."
              },
              {
                "point": "D. A player who the referee determines to have thrown a ball to themselves in an attempt to draw a card for illegal contact with a helpless receiver shall not be considered a helpless receiver on that throw."
              },
              {
                "point": "E. Incidental contact that results from attempts to play the ball shall not be penalized under this rule.",
                "subPoints": [
                  "i. If the contacting player was directly attempting to apply force to the helpless receiver, this contact shall be ruled as non-incidental."
                ]
              }
            ],
            "violations": [
              {
                "description": "illegally contacting a helpless receiver",
                "penalty": "YellowCard"
              },
              {
                "description": "charging a helpless receiver",
                "penalty": "RedCard"
              },
              {
                "description": "tackling a helpless receiver",
                "penalty": "RedCard"
              }
            ]
          },
          {
            "ruleId": "6.1.8",
            "ruleTitle": "Stealing",
            "description": "A steal consists of a player's attempt to extract a ball from an opponent by either stripping or poking it loose.",
            "details": [
              {
                "point": "A. A player may attempt to steal from an opponent while wrapping them."
              },
              {
                "point": "B. A player must not wind up or swing at the ball in an attempt to punch it loose."
              },
              {
                "point": "C. For the purposes of contact between the stealing player and the player being stolen from only, the player being stolen from is considered to have sole possession during the steal attempt until they lose direct control of the ball."
              }
            ],
            "violations": [
              {
                "description": "illegal attempt to steal",
                "penalty": "StandardContactPenalty"
              }
            ]
          },
          {
            "ruleId": "6.1.9",
            "ruleTitle": "Initial point of contact",
            "description": "When pushing, body blocking, charging, or wrapping, a player must not make initial contact with an opponent from behind.",
            "details": [
              {
                "point": "A. The contact must be initiated from the front of the opponent's torso.",
                "subPoints": [
                  "i. The front of the torso is defined by a flat plane bisecting the player at the middle of both shoulders.",
                  "ii. To be considered to the front of the opponent, the navel of the player initiating contact must be in front of this flat plane when contact is initiated.",
                  "iii. As long as the body of the contacting player is positioned in this manner the actual point of contact may occur at any legal part of the opponent's torso, arms, or legs above the knee."
                ]
              },
              {
                "point": "B. If a player is bent over during the process of attempting to pick up a ball (including standing up afterwards), or while in the process of standing back up after having been grounded, initiating contact from any direction shall be treated as initiating contact from behind.",
                "subPoints": [
                  "i. A player shall be considered bent over whenever the axis through their spine is more than 45 degrees off from a fully upright position.",
                  "ii. A player who maintains a bent over position after gaining possession of the ball, or after ceasing to be grounded, without being forced, shall not be treated as bent over."
                ]
              },
              {
                "point": "C. If the contacting player has both feet planted and no substantial forward momentum, they may initiate contact on a player in possession of a ball from behind.",
                "subPoints": [
                  "i. The contacting player may step forward in order to initiate contact but must initiate contact before both feet have moved from where they were initially planted."
                ]
              },
              {
                "point": "D. If a player initiates contact by leading with their back, the opposing player may continue the contact, and there is no foul."
              },
              {
                "point": "E. If a player spins, turns, or becomes bent over just prior to contact, and the opposing player did not have reasonable time to react and completely avoid contact, the opposing player may initiate contact, and there is no foul."
              },
              {
                "point": "F. Once contact has been legally established, a player may continue contact even when it results in contact from behind, so long as contact is not broken.",
                "subPoints": [
                  "i. This includes changing the type of contact."
                ]
              }
            ],
            "violations": [
              {
                "description": "illegal contact from behind",
                "penalty": "StandardContactPenalty"
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "6.2",
        "subSectionTitle": "Specific contact",
        "content": [
          {
            "ruleId": "6.2.1",
            "ruleTitle": "Body blocking",
            "description": "A body block consists of applying force to an opponent using body parts other than arms or hands not pinned to the torso, where any significant force of the contact is applied after non-forceful contact has already been established by the blocking player's aforementioned body parts.",
            "details": [
              {
                "point": "A. It is illegal to body block using the head, legs, or feet."
              },
              {
                "point": "B. It is illegal to extend the point of the elbow into an opponent during a body block."
              },
              {
                "point": "C. It is illegal to body block if contact was initiated from behind (See rule 6.1.9 Initial point of contact)."
              }
            ],
            "violations": [
              {
                "description": "illegal body block",
                "penalty": "StandardContactPenalty"
              }
            ]
          },
          {
            "ruleId": "6.2.2",
            "ruleTitle": "Pushing",
            "description": "A push consists of initiating force upon an opponent with an extended arm, be it extended during or before the initiation of contact.",
            "details": [
              {
                "point": "A. Only one arm may be used to push."
              },
              {
                "point": "B. It is illegal to push using the point of an elbow."
              },
              {
                "point": "C. It is illegal to push if contact was initiated from behind (See rule 6.1.9 Initial point of contact)."
              },
              {
                "point": "D. It is illegal to directly push an opponent's stick.",
                "subPoints": [
                  "i. Incidental pushing of an opponent's stick is not illegal."
                ]
              }
            ],
            "violations": [
              {
                "description": "illegal push",
                "penalty": "StandardContactPenalty"
              }
            ]
          },
          {
            "ruleId": "6.2.3",
            "ruleTitle": "Charging",
            "description": "A charge consists of forcefully making contact with an opponent using body parts other than arms or hands not pinned to the torso, except in cases of body blocking.",
            "details": [
              {
                "point": "A. It is illegal to charge using the head, legs, or feet."
              },
              {
                "point": "B. It is illegal to charge an opponent who is not in complete and sole possession of a ball unless the charging player has possession of a ball.",
                "subPoints": [
                  "i. A beater without a ball must not charge an opponent without trying to wrap that player around their torso or their legs above the knee."
                ]
              },
              {
                "point": "C. It is illegal to initiate contact during a charge so that a single point of the charging player's body initiates the contact, such as leading with the point of a shoulder or elbow.",
                "subPoints": [
                  "i. Point-of-shoulder to point-of-shoulder contact is allowed."
                ]
              },
              {
                "point": "D. It is illegal for both of a charging player's feet to be completely off the ground while applying the primary force of a charge, unless the player left their feet as a part of a direct attempt to pass, shoot, or otherwise throw a ball.",
                "subPoints": [
                  "i. The player does not need to actually throw the ball in order to be ruled to have left their feet as part of a direct attempt to throw a ball."
                ]
              },
              {
                "point": "E. It is illegal to charge if contact was initiated from behind (See rule 6.1.9 Initial point of contact)."
              }
            ],
            "violations": [
              {
                "description": "illegal charge",
                "penalty": "StandardContactPenalty"
              }
            ]
          },
          {
            "ruleId": "6.2.4",
            "ruleTitle": "Wrapping",
            "description": "A wrap consists of encircling any part of an opponent with an arm or arms. The arm includes the hand.",
            "details": [
              {
                "point": "A. It is illegal to wrap an opponent who is not in possession of a ball."
              },
              {
                "point": "B. It is illegal for a player to leave the ground during a wrap in an attempt to spear or otherwise propel their body into an opponent."
              },
              {
                "point": "C. Once a wrap has been initiated legally, the wrapping player may continue the already initiated motion of the wrap due to momentum even if the player being wrapped releases the ball.",
                "subPoints": [
                  "i. The referee must shout \"ball out\" the moment the ball is released.",
                  "ii. Once aware of the ball being released the player cannot continue contact beyond previously created momentum."
                ]
              },
              {
                "point": "D. It is illegal to wrap if contact was initiated from behind (See rule 6.1.9 Initial point of contact)."
              },
              {
                "point": "E. A grab is a form of wrap that involves holding an opponent or any part of an opponent with a closed hand.",
                "subPoints": [
                  "i. It is illegal to grab an opponent's stick or clothing.",
                  "ii. It is illegal to yank any part of an opponent or pull their arm that is holding the stick during a grab."
                ]
              },
              {
                "point": "F. It is illegal to apply sharp and sudden force directly through the arm of an opponent during any type of wrap."
              },
              {
                "point": "G. A tackle is the act of wrapping a player and bringing them to the ground."
              }
            ],
            "violations": [
              {
                "description": "illegal wrap",
                "penalty": "StandardContactPenalty"
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "6.3",
        "subSectionTitle": "Seekers and the flag runner",
        "content": [
          {
            "ruleId": "6.3.1",
            "ruleTitle": "Seeker interactions with the flag runner",
            "description": "While seekers have the standard contact and interaction rules with regard to interactions with each other, different rules apply to interactions with the flag runner.",
            "details": [
              {
                "point": "A. The following interactions are legal for a seeker to do to a flag runner:",
                "subPoints": [
                  "i. Body blocking the flag runner, subject to standard body block rules (See rule 6.2.1 Body blocking).",
                  "ii. Pushing or moving the flag runner's arms.",
                  "iii. Reaching around or over the flag runner with one or both arms.",
                  "a. Any arm reaching around the flag runner must only have incidental contact with them.",
                  "b. It is illegal to squeeze or otherwise restrict the flag runner's body with an arm that is reaching around them.",
                  "c. If the flag runner moves into the seeker's arm while the seeker is reaching around them, the seeker must move their arm to avoid restricting the flag runner's motion."
                ]
              },
              {
                "point": "B. The following interactions are illegal for a seeker to do to a flag runner:",
                "subPoints": [
                  "i. Contacting the head, neck, or groin of the flag runner.",
                  "ii. Charging the flag runner.",
                  "a. If the would-be charge fails to make contact with the legs, waist, or torso of the flag runner, it shall not be ruled to be a charge.",
                  "iii. Pushing the flag runner's legs, waist, or torso.",
                  "iv. Holding down or grabbing the flag runner's arms.",
                  "v. Hurdling or attempting to hurdle over the flag runner while they are not contacting the ground with any part of their body other than their feet.",
                  "vi. Tackling or attempting to tackle the flag runner.",
                  "vii. Grabbing the flag runner's clothing.",
                  "a. No penalty shall apply if the seeker immediately releases the clothing.",
                  "b. Any catch made by the offending seeker during, immediately after or as a result of grabbing the flag runner's clothing shall still be ruled invalid, even if no penalty is assessed.",
                  "viii. Making forceful contact with the flag runner while sliding or diving.",
                  "a. Minor incidental contact shall not be penalized.",
                  "ix. Making egregiously illegal contact with the flag runner (See rule 6.1.13 Egregious contact)."
                ]
              },
              {
                "point": "C. If the flag runner's arms are held tight against or are otherwise pinned against their torso, they shall be treated as part of their torso."
              }
            ],
            "violations": [
              {
                "description": "illegal interaction with the flag runner",
                "penalty": "StandardContactPenalty"
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "6.4",
        "subSectionTitle": "Right of way",
        "content": [
          {
            "ruleId": "6.4.1",
            "ruleTitle": "Interposition right of way",
            "description": "Players of different positions may not physically interact with each other. The following rules apply to these interactions:",
            "details": [
              {
                "point": "A. The following is the order of priority for right of way between two players of different positions from highest to lowest priority:",
                "subPoints": [
                  "i. A stationary player with a ball.",
                  "ii. A stationary chaser without a ball.",
                  "iii. A moving player with a ball.",
                  "iv. A stationary beater or seeker without a ball.",
                  "v. A moving player without a ball."
                ]
              },
              {
                "point": "B. Players with lower priority must yield to players with higher priority, which may include moving out of the way.",
                "subPoints": [
                  "i. Players of lower priority who fail to yield are generally \"at fault.\""
                ]
              },
              {
                "point": "C. When two players of the same priority interact, the player whom the referee judges to be at fault for the interaction shall be deemed at fault.",
                "subPoints": [
                  "i. If the players are judged to be equally at fault for the interaction, no penalty shall be given."
                ]
              },
              {
                "point": "D. If a player clearly acts with the intent of causing an illegal interposition interaction, that player shall be deemed at fault, regardless of their priority."
              },
              {
                "point": "E. If a player moves with the intent of causing an opponent to enter an illegal interposition interaction with or yield to another player of equal or higher priority, that player shall be deemed at fault rather than either of the interacting parties."
              },
              {
                "point": "F. If the referee determines that there was not enough time for the at fault player to reasonably react and yield, the interaction shall be deemed incidental and no penalty shall be given.",
                "subPoints": [
                  "i. This provision shall not activate if the at fault player could be reasonably expected to be aware or acted to ensure they would be unaware of the opposing player with whom they interacted."
                ]
              },
              {
                "point": "G. Only the at fault player is penalized for an illegal interposition interaction.",
                "subPoints": [
                  "i. If the illegal interposition interaction was accidental, and overall gameplay was unaffected, they shall instead be penalized for a minor illegal interposition interaction."
                ]
              }
            ],
            "violations": [
              {
                "description": "minor illegal interposition interaction",
                "penalty": "BackToHoops"
              },
              {
                "description": "illegal interposition interaction",
                "penalty": "YellowCard"
              },
              {
                "description": "violent or egregious illegal interposition interaction",
                "penalty": "RedCard"
              }
            ]
          },
          {
            "ruleId": "6.4.2",
            "ruleTitle": "Interactions with off stick players",
            "details": [
              {
                "point": "A. It is illegal for any player to intentionally attempt to initiate contact, continue contact, or otherwise interact with an off stick opponent.",
                "subPoints": [
                  "i. If contact was initiated before or as the knock off stick occurred, reasonable allowance shall be made for the player to safely disengage from the off stick opponent.",
                  "ii. Off stick players must still make all reasonable efforts to avoid interacting with play while they are off stick."
                ]
              }
            ],
            "violations": [
              {
                "description": "illegally interacting with an off stick opponent",
                "penalty": "YellowCard"
              },
              {
                "description": "violently or egregiously illegally interacting with an off stick opponent",
                "penalty": "RedCard"
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "6.5",
        "subSectionTitle": "Unsporting behaviour",
        "content": [
          {
            "ruleId": "6.5.1",
            "ruleTitle": "Unsportsmanlike conduct",
            "details": [
              {
                "point": "A. Players must not engage in unsportsmanlike conduct such as taunting, rude, or antagonistic behavior with players, spectators, officials, or event staff."
              },
              {
                "point": "B. Use of explicit, vulgar, extreme, or abusive language or gestures at any time is considered unsportsmanlike conduct.",
                "subPoints": [
                  "i. It is egregious unsportsmanlike conduct if the language is directed at another person and any of the following are true:",
                  "a. The language is extreme or abusive.",
                  "b. The language includes vulgar words used for their meaning, rather than solely for emphasis.",
                  "c. The language is discriminatory, including but not limited to racial epithets, ethnic slurs, or other phrases that demean or debase any person or group of people based on their race, sex, gender, sexual orientation, religion, or country of origin.",
                  "ii. It is egregious unsportsmanlike conduct to direct obscene, explicit, or vulgar gestures at another person."
                ]
              },
              {
                "point": "C. Egregiously rude or hostile behavior, including threats, are egregious unsportsmanlike conduct."
              }
            ],
            "violations": [
              {
                "description": "unsportsmanlike conduct",
                "penalty": "YellowCard"
              },
              {
                "description": "egregious unsportsmanlike conduct",
                "penalty": "RedCard"
              }
            ]
          },
          {
            "ruleId": "6.5.2",
            "ruleTitle": "Internal unsportsmanline conduct",
            "description": "Unsportsmanlike conduct that is undirected or solely directed at one's teammates or oneself is internal unsportsmanlike conduct.",
            "details": [
              {
                "point": "A. Internal unsportsmanlike conduct is not penalized unless it is either:",
                "subPoints": [
                  "i. Repeated use of explicit or vulgar language.",
                  "ii. Egregious."
                ]
              },
              {
                "point": "B. The penalties for this section apply in lieu of the penalties in 6.5.1 Unsportsmanlike conduct."
              }
            ],
            "violations": [
              {
                "description": "repeated use of explicit or vulgar language",
                "penalty": "BlueCard"
              },
              {
                "description": "egregious internal unsportsmanlike conduct",
                "penalty": "Ejection"
              }
            ]
          },
          {
            "ruleId": "6.5.3",
            "ruleTitle": "Physical altercations",
            "description": "It is illegal to engage in physical altercations with any person.",
            "violations": [
              {
                "description": "engaging in a physical altercation with a teammate",
                "penalty": "Ejection"
              },
              {
                "description": "engaging in a physical altercation with an opponent, spectator, official, or event staffer",
                "penalty": "RedCard"
              }
            ]
          },
          {
            "ruleId": "6.5.4",
            "ruleTitle": "Spitting",
            "description": "Players must not intentionally spit at or on any player, spectator, official, or event staffer.",
            "violations": [
              {
                "description": "intentionally spitting at or on a teammate",
                "penalty": "Ejection"
              },
              {
                "description": "intentionally spitting at or on an opponent, spectator, official, or event staffer",
                "penalty": "RedCard"
              }
            ]
          },
          {
            "ruleId": "6.5.5",
            "ruleTitle": "Serious foul play",
            "description": "It is illegal to commit serious foul play, including egregious conduct and flagrant cheating.",
            "details": [
              {
                "point": "A. If an instance of serious foul play cannot be attributed to a specific player, the speaking captain must receive the penalty."
              }
            ],
            "violations": [
              {
                "description": "serious foul play",
                "penalty": "RedCard"
              }
            ]
          },
          {
            "ruleId": "6.5.6",
            "ruleTitle": "Faking a foul",
            "description": "It is illegal to pretend to be fouled.",
            "violations": [
              {
                "description": "pretending to be fouled",
                "penalty": "YellowCard"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "sectionId": "7",
    "sectionTitle": "BOUNDARIES AND BALLS",
    "subSections": [
      {
        "subSectionId": "7.1",
        "subSectionTitle": "Using the balls",
        "content": [
          {
            "ruleId": "7.1.1",
            "ruleTitle": "Use of the ball",
            "description": "Players may possess, touch, kick, throw, or otherwise use the ball associated with their own position.",
            "details": [
              {
                "point": "A. A player is considered to have possession of a ball when that player has sole and complete control of it. This includes when a player is the only player in contact with the ball during a kick.",
                "subPoints": [
                  "i. Swatting a ball out of an opponent's hands or out of the air is not considered possession.",
                  "a. Swatting a ball that is on the ground is considered possession."
                ]
              },
              {
                "point": "B. Players may only possess, touch, kick, throw, or otherwise use one ball associated with their position at any given time.",
                "subPoints": [
                  "i. A beater may temporarily possess two dodgeballs if they are in the process of catching a live dodgeball propelled by an opponent.",
                  "a. In this scenario, the beater must drop one of the two dodgeballs immediately to avoid penalty."
                ]
              },
              {
                "point": "C. Players may kick any ball, other than the flag, that they may legally possess."
              },
              {
                "point": "D. Players may not use a ball associated with their position to mimic the actions of a ball of a different position."
              },
              {
                "point": "E. Players may not use a ball of their position to intentionally interact with the flag runner."
              }
            ],
            "violations": [
              {
                "description": "illegally using a ball of one's own position",
                "penalty": "BlueCard"
              },
              {
                "description": "using a ball to intentionally interact with the flag runner",
                "penalty": "YellowCard"
              }
            ]
          },
          {
            "ruleId": "7.1.2",
            "ruleTitle": "Interposition ball interactions",
            "description": "Players are forbidden from possessing, touching, kicking, throwing, or in any way using a ball not associated with their position. The following guidelines apply:",
            "details": [
              {
                "point": "A. Any mounted player who may not play the volleyball must take any and all reasonable actions to avoid a propelled volleyball.",
                "subPoints": [
                  "i. It is a failure to avoid a propelled volleyball if the player is required to avoid it and is hit by the volleyball.",
                  "a. It is a minor failure to avoid a propelled volleyball if the player attempted to avoid it and failed, but the overall play was not affected.",
                  "b. Intentionally moving into, or remaining in, the path of the volleyball to block it is an interposition ball interference.",
                  "c. If a player's unintentional failure to avoid the propelled volleyball directly blocks it from scoring, they must be penalized for illegally unintentionally blocking a propelled volleyball from scoring.",
                  "ii. A beater in the way of the volleyball may attempt to propel their dodgeball at the volleyball to divert it. However, they are still penalized if hit by the volleyball.",
                  "iii. A player unaware of an incoming volleyball is not penalized for not avoiding it unless they have acted to ensure they would be unaware.",
                  "a. If the player acted to ensure they would be unaware, the interaction shall be treated as intentional.",
                  "iv. A player without time to reasonably avoid an incoming volleyball is not penalized for failing to avoid it."
                ]
              },
              {
                "point": "B. A player allowing a dodgeball to hit them, including by intentionally getting in the way of a dodgeball, is shielding against that dodgeball.",
                "subPoints": [
                  "i. Any mounted player may shield against a dodgeball made live by an opponent.",
                  "a. It is illegal shielding for a player who may not play a dodgeball to shield against a dodgeball that is dead, or made live by a teammate.",
                  "1. If the referee determines that the player was not reasonably aware that the dodgeball was either dead or made live by their own teammate and the play was otherwise legal, the player shall not be penalized.",
                  "2. The penalty for illegal shielding is given instead of the penalty for interpositional ball interference.",
                  "ii. A player who may not play a dodgeball may attempt to shield against a dodgeball before it is made live as long as they do not make contact with the dodgeball before it is live, nor with the beater possessing that dodgeball.",
                  "iii. The player may allow the dodgeball to bounce off of any part of their body or equipment at any angle. However, any attempt to propel a live dodgeball with any part of their body is an illegal dodgeball swat. (See rule 5.4.2 Swatting dodgeballs).",
                  "a. The penalty for an illegal dodgeball swat shall be given instead of the penalty for interposition ball interference."
                ]
              },
              {
                "point": "C. Players may legally possess a dead volleyball to return it to the formerly defending keeper after a score (See rule 4.2.1 Dead volleyball)."
              },
              {
                "point": "D. Any other intentional interaction with a ball not associated with one's position is an interposition ball interference."
              },
              {
                "point": "E. Unintentionally and illegally acting on a ball not associated with one's position in a manner that significantly affects the position or trajectory of that ball is an incidental interposition ball interference."
              },
              {
                "point": "F. Intentionally blocking a score by committing interposition ball interference is intentionally and illegally blocking a score."
              }
            ],
            "violations": [
              {
                "description": "minor failure to avoid a propelled volleyball",
                "penalty": "BackToHoops"
              },
              {
                "description": "incidental interposition ball interference",
                "penalty": "Turnover"
              },
              {
                "description": "failure to avoid a propelled volleyball",
                "penalty": "BlueCard"
              },
              {
                "description": "illegal dodgeball swat",
                "penalty": "BlueCard"
              },
              {
                "description": "illegal shielding",
                "penalty": "BlueCard"
              },
              {
                "description": "interposition ball interference",
                "penalty": "YellowCard"
              },
              {
                "description": "illegally unintentionally blocking a propelled volleyball from scoring",
                "penalty": "YellowCard"
              },
              {
                "description": "intentionally and illegally blocking a score",
                "penalty": "RedCard"
              }
            ]
          },
          {
            "ruleId": "7.1.3",
            "ruleTitle": "Interference by substitutes and off stick players",
            "description": "Substitutes and off stick players must make a reasonable effort, at the discretion of the referee, not to interact with any ball.",
            "violations": [
              {
                "description": "illegally failing to make a reasonable effort to avoid a ball",
                "penalty": "BlueCard"
              },
              {
                "description": "intentionally and illegally blocking a score",
                "penalty": "RedCard"
              }
            ]
          },
          {
            "ruleId": "7.1.4",
            "ruleTitle": "Dodgeball vs volleyball",
            "details": [
              {
                "point": "A. Players may not propel or use a held ball of their position to interact with a ball of another position with the following exceptions:",
                "subPoints": [
                  "i. Beaters may propel dodgeballs at a live volleyball.",
                  "ii. Chasers may use a held or propelled volleyball to hit or deflect a dodgeball made live by an opponent. (See rule 5.4.1 Blocking and batting dodgeballs)",
                  "a. If the referee determines that the player was not reasonably aware that the airborne dodgeball was either dead or made live by their own teammate and the play was otherwise legal, the player shall not be penalized."
                ]
              },
              {
                "point": "B. Any intentional illegal use of a held ball to interact with a ball not associated with one's position is an interposition ball interference."
              },
              {
                "point": "C. Unintentionally and illegally acting on a ball not associated with one's position by using a held ball in a manner that significantly affects the position or trajectory of that ball is an incidental interposition ball interference."
              }
            ],
            "violations": [
              {
                "description": "incidental interposition ball interference",
                "penalty": "Turnover"
              },
              {
                "description": "interposition ball interference",
                "penalty": "YellowCard"
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "7.2",
        "subSectionTitle": "Keeper zone",
        "content": [
          {
            "ruleId": "7.2.1",
            "ruleTitle": "Inside the keeper zone",
            "description": "A player with any part of their body behind or touching their own keeper zone line is considered to be in the keeper zone."
          },
          {
            "ruleId": "7.2.2",
            "ruleTitle": "Keeper-specific powers",
            "description": "A keeper within their own keeper zone, except in the situation described in 7.2.2.B., is considered to be a protected keeper.",
            "details": [
              {
                "point": "A. A protected keeper has the following powers:",
                "subPoints": [
                  "i. While a protected keeper has sole possession of the volleyball, opposing players may not contact, interact with, or attempt to steal the volleyball from the keeper (See rule 6.1.1 Illegal physical contact).",
                  "a. Sole possession of the volleyball must be established before this immunity from contact goes into effect.",
                  "ii. A protected keeper is immune from being beat.",
                  "a. There is no penalty for beaters throwing dodgeballs at immune players."
                ]
              },
              {
                "point": "B. Once any player on the keeper's team possesses the volleyball outside their keeper zone:",
                "subPoints": [
                  "i. The keeper loses all powers listed above.",
                  "ii. The powers listed above can be regained when their team's drive ends."
                ]
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "7.3",
        "subSectionTitle": "Offense, defense, and drives",
        "content": [
          {
            "ruleId": "7.3.1",
            "ruleTitle": "Drives",
            "details": [
              {
                "point": "A. A drive is initiated for a team when one of the following occurs:",
                "subPoints": [
                  "i. A player on that team is the first player to gain possession of the volleyball at the beginning of the game.",
                  "ii. A player on that team gains possession of the volleyball during the opposing team's drive, thus ending the opposing team's drive.",
                  "iii. A player on that team makes the volleyball live after a good goal."
                ]
              },
              {
                "point": "B. A drive ends for a team when one of the following occurs:",
                "subPoints": [
                  "i. The opposing team gains possession of the volleyball, initiating their own drive.",
                  "ii. A goal is scored for either team"
                ]
              },
              {
                "point": "C. A drive ends and a new drive begins for the same team when the defensive team is assessed a penalty card or third dodgeball interference penalty."
              }
            ]
          },
          {
            "ruleId": "7.3.2",
            "ruleTitle": "Offense and defense",
            "details": [
              {
                "point": "A. During a team's drive, it is the \"offensive team.\"",
                "subPoints": [
                  "i. The opposing team is the \"defensive team.\""
                ]
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "7.4",
        "subSectionTitle": "Pace of play",
        "content": [
          {
            "ruleId": "7.4.1",
            "ruleTitle": "Delay of game",
            "description": "Delay of game is defined as delaying the start of the game by any means, or attempting to stop or significantly impede the volleyball game from continuing. The exact determination of what constitutes delay of game is at the discretion of the referee, within the following guidelines:",
            "details": [
              {
                "point": "A. Delaying the start of the game by failing to be present on time, or failing to send out the starters when directed by the officials is delay of game.",
                "subPoints": [
                  "i. If multiple individuals on one team are delaying the start of the game, the penalty shall be given to the speaking captain."
                ]
              },
              {
                "point": "B. A beater or beaters may guard a volleyball to prevent the opposing team from gaining possession of it. However, it is delay of game if a beater continues to protect the volleyball while their chasers are making no reasonable attempt to retrieve it."
              },
              {
                "point": "C. Keeper delay:",
                "subPoints": [
                  "i. A protected keeper must directly and immediately advance the volleyball out of the keeper zone, attempt to complete a pass, or drop the volleyball to the ground.",
                  "ii. After a goal, the keeper on the formerly defensive team must not substitute out of the game until they have made the volleyball live."
                ]
              },
              {
                "point": "D. The volleyball carrier must at least advance the volleyball at a normal walking pace until they have crossed the midfield line.",
                "subPoints": [
                  "i. If the volleyball carrier is taking a non-direct path, their forward progress must equal or exceed the forward progress of a normal walking pace on a path perpendicular to the midfield line.",
                  "ii. If the volleyball carrier is blocked by a defender, they may temporarily delay their forward progress but must clearly attempt to find a way to bypass the defender.",
                  "a. The volleyball carrier is considered blocked by a defender if that defender is between the volleyball carrier and any part of the defender's endline and that defender is:",
                  "1. An opposing chaser within approximately 2 meters of the volleyball carrier.",
                  "2. An opposing beater in possession of a dodgeball within approximately 4 meters of the volleyball carrier."
                ]
              },
              {
                "point": "E. Stalling:",
                "subPoints": [
                  "i. On each drive, the chasers on the offensive team must act with the overall primary intent to score. Players in possession of the volleyball may not act with the overall primary intent to waste time for any reason."
                ]
              },
              {
                "point": "F. The head referee may issue a warning when the referee determines that the team is beginning to delay the game.",
                "subPoints": [
                  "i. Teams must respond immediately to this warning to avoid a penalty for delay of game. Multiple warnings may be given for delay of game during a single game, as the referee determines to be appropriate.",
                  "ii. Warnings do not need to be issued before calling delay of game."
                ]
              }
            ],
            "violations": [
              {
                "description": "delay of game",
                "penalty": "BlueCard, VolleyballTurnover"
              }
            ]
          },
          {
            "ruleId": "7.4.2",
            "ruleTitle": "Stalled volleyball",
            "description": "A volleyball is considered stalled if the volleyball is either possessed by a grounded player who is in contact with an opponent, or jointly controlled by two or more players, one of whom is grounded and the volleyball is not significantly moving in the general direction of either set of hoops.",
            "details": [
              {
                "point": "A. Upon the volleyball becoming stalled, the head referee shall begin a 10 second countdown.",
                "subPoints": [
                  "i. The first 5 seconds of the countdown shall be silent.",
                  "ii. The remainder of the countdown shall be conducted out loud.",
                  "iii. If the volleyball ceases to be stalled, even momentarily, prior to the official beginning to say \"zero\" the count shall end. If the volleyball becomes stalled again, a new 10 second count begins."
                ]
              },
              {
                "point": "B. If the volleyball is still stalled when the head referee begins to say \"zero,\" the head referee shall verbally declare a \"stalled volleyball.\"",
                "subPoints": [
                  "i. The team that was on defense the last time the volleyball was possessed by a non-grounded player shall be declared the \"receiving team\" (See rule 7.3.2 Offense and defense).",
                  "ii. The volleyball shall be inbounded by the receiving team.",
                  "a. The inbounding point shall be the closest point along the boundary to the location of the volleyball at the time when the stalled volleyball was declared. (See rule 7.5.4 Inbounding procedure)",
                  "b. The inbounding player shall be the closest eligible chaser on the receiving team to the inbounding point.",
                  "iii. If the volleyball was in the receiving team's keeper zone when the stalled volleyball was declared, and that team's keeper is protected and had joint control of the volleyball, \"keeper ball\" shall be declared instead. The keeper must take possession of the volleyball where it was stalled, and no inbounding shall be necessary."
                ]
              },
              {
                "point": "C. The head referee generally should not stop play to adjudicate a stalled volleyball."
              }
            ]
          },
          {
            "ruleId": "7.4.3",
            "ruleTitle": "Resetting the volleyball",
            "description": "Teams are partially restricted from carrying or propelling the volleyball backward toward their own hoops. The following rules apply:",
            "details": [
              {
                "point": "A. Each team has two restrictor lines during their drives, each of which extend completely across the width of the pitch at:",
                "subPoints": [
                  "i. The team's own keeper zone line.",
                  "ii. The midfield line."
                ]
              },
              {
                "point": "B. The volleyball is considered to have crossed a restrictor line when it moves from being completely on one side of that line, to being completely on the other side of that line.",
                "subPoints": [
                  "i. A player in possession of the volleyball is treated as an extension of the volleyball for purposes of crossing a restrictor line.",
                  "ii. The volleyball does not have to touch the ground on either side of the line in order to have crossed it."
                ]
              },
              {
                "point": "C. If an offensive player carries or propels the volleyball backward across one of their restrictor lines, it shall be ruled a reset, with the following exceptions:",
                "subPoints": [
                  "i. A defensive player deflects the volleyball, during or after the propulsion and before the volleyball travels backward across a restrictor line.",
                  "a. This includes if the deflection is done with a dodgeball.",
                  "ii. A defender strips the volleyball causing it to travel across a restrictor line.",
                  "a. Once the volleyball becomes loose, the offensive team must act to carry or propel the volleyball forward across that restrictor line as soon as reasonably possible or it shall be considered a reset.",
                  "iii. The player who initiates a drive carries or propels the volleyball backward across one or both restrictor lines immediately upon the beginning of the drive.",
                  "a. This action is still subject to all other rules, including delay of game and stalling.",
                  "b. If the player started the drive while engaged in physical contact with an opponent, they may carry or propel the volleyball backward across the restrictor lines during or immediately after that contact without it counting as a reset, provided they did not significantly advance the volleyball during that contact.",
                  "iv. The volleyball was carried across the midline to request a stoppage of play to fix the opponents dislodged hoops, and all of the following were true:",
                  "a. Two of the opponent's hoops were dislodged.",
                  "b. Before crossing the midline, the volleyball carrier clearly communicated to the head referee that they were retreating in order to make the request.",
                  "c. The volleyball carrier was not in contact with any opponent while crossing the midline."
                ]
              },
              {
                "point": "D. If a single resetting action causes the volleyball to cross backward across both restrictor lines, it shall be considered two resets."
              },
              {
                "point": "E. Upon the first legal reset of each drive, the head referee shall loudly declare \"reset used\" and signal the same by swinging one arm out, palm down, toward the offensive teams' hoops."
              },
              {
                "point": "F. There are two types of illegal resets:",
                "subPoints": [
                  "i. It is illegal to reset the volleyball more than once on a single drive.",
                  "ii. It is illegal to reset the volleyball by propelling it backward across a restrictor line without either attempting a pass to an eligible receiver or attempting to score a goal through their opponents' hoops.",
                  "a. A receiver's eligibility is determined at the arrival of the volleyball, not the time of the pass.",
                  "b. This restriction does not apply to loose balls, unless a player intentionally made the volleyball loose in order for their team to attempt a reset."
                ]
              },
              {
                "point": "G. If an illegal reset is called, play must be stopped.",
                "subPoints": [
                  "i. If the opposing team would clearly recover the volleyball without the turnover call, the referee may allow play to continue under a \"no harm no foul\" call."
                ]
              }
            ],
            "violations": [
              {
                "description": "illegal reset",
                "penalty": "VolleyballTurnover"
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "7.5",
        "subSectionTitle": "Boundaries",
        "content": [
          {
            "ruleId": "7.5.1",
            "ruleTitle": "Out of bounds",
            "details": [
              {
                "point": "A. The area within the boundary lines is inbounds."
              },
              {
                "point": "B. The boundary lines, and any area beyond them, are out of bounds."
              }
            ]
          },
          {
            "ruleId": "7.5.2",
            "ruleTitle": "Boundaries and balls",
            "details": [
              {
                "point": "A. A possessed ball becomes out of bounds only when the player possessing it becomes out."
              },
              {
                "point": "B. An unpossessed ball becomes out of bounds when one of the following occur:",
                "subPoints": [
                  "i. The ball touches anything that is out of bounds, other than a player in play.",
                  "ii. The volleyball is in contact with a player who is out of bounds."
                ]
              },
              {
                "point": "C. A live dodgeball becomes dead immediately upon becoming out of bounds."
              },
              {
                "point": "D. Play is not stopped for a dodgeball going out of bounds."
              },
              {
                "point": "E. When a live volleyball goes out of bounds, the referee shall declare \"boundary\" and indicate the inbounding player.",
                "subPoints": [
                  "i. If a player on the opposing team possesses the volleyball, they must drop it.",
                  "ii. All chasers on the non-inbounding team must return or remain inbounds and cease interfering with the inbounding player.",
                  "iii. Play is stopped if the non-inbounding team fails to follow the above requirements, or if the head referee judges that retrieval of the volleyball may unnecessarily delay the game."
                ]
              },
              {
                "point": "F. When a dead volleyball goes out of bounds after a score, it is returned to the formerly defending keeper, and does not need to be inbounded.",
                "subPoints": [
                  "i. Play is not stopped for a dead volleyball going out of bounds unless the head referee judges that retrieval of the volleyball may unnecessarily delay the game."
                ]
              },
              {
                "point": "G. It is illegal to propel a ball with the intent of sending any ball out of bounds."
              },
              {
                "point": "H. A ball that is out of bounds cannot be used to beat an opponent or score a goal until it has been properly inbounded."
              }
            ],
            "violations": [
              {
                "description": "propelling a ball with the intent of sending any ball out of bounds",
                "penalty": "BlueCard"
              },
              {
                "description": "intentionally or blatantly ignoring a \"boundary\" call",
                "penalty": "YellowCard"
              }
            ]
          },
          {
            "ruleId": "7.5.3",
            "ruleTitle": "Players out of bounds",
            "details": [
              {
                "point": "A. Players are considered out of bounds upon touching the ground out of bounds.",
                "subPoints": [
                  "i. A player remains out of bounds until the player re-establishes themselves inbounds by touching the ground only inbounds.",
                  "ii. If a ball possessed by a player touches the ground out of bounds, that player is also out of bounds."
                ]
              },
              {
                "point": "B. Players may not go out of bounds unless specifically allowed or required by rule.",
                "subPoints": [
                  "i. A player who accidentally steps out of bounds for a short time shall not be penalized.",
                  "a. This does not negate any out of bounds turnovers.",
                  "ii. A player who legally goes out of bounds must directly and immediately return inbounds once the reason for legally going out of bounds no longer applies."
                ]
              },
              {
                "point": "C. Players may attempt to force opponents out of bounds through otherwise legal contact.",
                "subPoints": [
                  "i. Once the opposing player is out of bounds, the forcing player must discontinue contact as soon as they can safely do so.",
                  "ii. There is no penalty for being forced out of bounds by an opponent.",
                  "a. This does not negate any out of bounds turnovers.",
                  "b. The player must directly and immediately act to return inbounds.",
                  "iii. If a ball carrier is forced out through illegal contact by an opponent, or by an opponent who is off stick, they are not considered out of bounds.",
                  "a. To avoid being called out of bounds, the ball carrier must act to return inbounds immediately."
                ]
              },
              {
                "point": "D. Players may go out of bounds while attempting to force a ball carrier out of bounds."
              },
              {
                "point": "E. Players may go out of bounds in the process of attempting to prevent a ball from becoming out of bounds."
              }
            ],
            "violations": [
              {
                "description": "intentionally or egregiously illegally going or remaining out of bounds",
                "penalty": "BackToHoops"
              }
            ]
          },
          {
            "ruleId": "7.5.4",
            "ruleTitle": "Inbounding procedure",
            "details": [
              {
                "point": "A. The inbounding player takes possession of the out of bounds ball and moves to the inbounding point.",
                "subPoints": [
                  "i. The inbounding point for the volleyball is the approximate location where the volleyball crossed the boundary line.",
                  "ii. The inbounding point for a dodgeball is approximately at the closest point on the boundary line to the inbounding beater when they take possession of the out of bounds dodgeball.",
                  "iii. The inbounding player is immune from being beat while out of bounds to inbound a ball."
                ]
              },
              {
                "point": "B. If play was stopped, the head referee shall restart play."
              },
              {
                "point": "C. An official shall count down five seconds."
              },
              {
                "point": "D. The inbounding player must inbound the ball by either carrying the ball back inbounds or throwing the ball inbounds before the official starts saying \"zero.\"",
                "subPoints": [
                  "i. If the ball is thrown, it is considered inbounds once it completely crosses the sideline or endline.",
                  "ii. If the ball is carried inbounds, it is considered inbounds once the player re-establishes themselves inbounds.",
                  "iii. No player on the opposing team may physically prevent the inbounding player from fully re-entering the pitch at the inbounding point."
                ]
              },
              {
                "point": "E. The inbounding player may only move in a primarily perpendicular direction to the boundary line.",
                "subPoints": [
                  "i. This does not prevent a player from stepping into their throw."
                ]
              },
              {
                "point": "F. A dodgeball inbounded by a throw is dead."
              },
              {
                "point": "G. A volleyball inbounded by a throw is unscorable (See rule 5.6.3 Unscorable volleyball)."
              },
              {
                "point": "H. If there is an inbounding procedure violation, the player receiving the resulting turnover does not need to inbound the ball."
              }
            ],
            "violations": [
              {
                "description": "inbounding procedure violation",
                "penalty": "BackToHoops, Turnover"
              },
              {
                "description": "illegally physically preventing the inbounding player from reentering the pitch",
                "penalty": "BackToHoops"
              }
            ]
          },
          {
            "ruleId": "7.5.5",
            "ruleTitle": "Determining the inbounding player",
            "details": [
              {
                "point": "A. An inbounding player must be eligible.",
                "subPoints": [
                  "i. An eligible player is a player who meets all of the following conditions.",
                  "a. The player is on stick.",
                  "b. The player is legally allowed to possess the ball.",
                  "c. The player is not in possession of another ball.",
                  "d. The player is not already the inbounding player for another currently out of bounds ball."
                ]
              },
              {
                "point": "B. When a loose dodgeball goes out of bounds, the inbounding player is the nearest eligible player to the ball at the time that the dodgeball became out of bounds.",
                "subPoints": [
                  "i. If the inbounding player becomes ineligible for any reason before gaining possession of the out of bounds dodgeball or declines to pursue the out of bounds dodgeball, the next nearest eligible beater shall be designated as the inbounding player.",
                  "ii. If there are no eligible beaters near the inbounding point and no beater on either team is attempting to pursue the out of bounds dodgeball, the nearest official shall retrieve the dodgeball and place it approximately 2 meters inside the inbounding point.",
                  "a. This ball no longer needs to be inbounded."
                ]
              },
              {
                "point": "C. When the volleyball goes out of bounds the inbounding player is the nearest eligible chaser to the inbounding point who is on the team that did not last touch the volleyball.",
                "subPoints": [
                  "i. When the volleyball becomes out due being in contact with an out of bounds player, that player shall be deemed to have touched the volleyball last.",
                  "ii. The inbounding chaser is immune from being beat from the time they are designated as the inbounding player until they return to the pitch after the volleyball is inbounded."
                ]
              },
              {
                "point": "D. When a ball goes out of bounds while in the possession of a player, the inbounding player is the nearest eligible player on the opposing team."
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "sectionId": "8",
    "sectionTitle": "THE FLAG RUNNER",
    "subSections": [
      {
        "subSectionId": "8.1",
        "subSectionTitle": "The role of the flag runner",
        "content": [
          {
            "ruleId": "8.1.1",
            "ruleTitle": "Role of the flag runner",
            "description": "The role of the flag runner is to prevent the flag ball from being caught by either team's seeker for as long as possible while also serving as a fair and impartial official."
          },
          {
            "ruleId": "8.1.2",
            "ruleTitle": "The flag runner's uniform",
            "details": [
              {
                "point": "A. The flag runner must wear shorts or pants with the flag ball affixed.",
                "subPoints": [
                  "i. The flag shorts and ball must meet all the requirements in section 2.3.3 The flag."
                ]
              },
              {
                "point": "B. The flag runner must wear a shirt or jersey and be easily identifiable as distinct from either team."
              },
              {
                "point": "C. The flag runner is strongly encouraged to wear shorts or pants that are all yellow or gold."
              },
              {
                "point": "D. The flag runner's outermost layer of clothing must not have any pockets unless the pockets are zipped, sewn, taped, or otherwise sealed shut."
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "8.2",
        "subSectionTitle": "Flag runner requirements",
        "content": [
          {
            "ruleId": "8.2.1",
            "ruleTitle": "Flag runner code of conduct",
            "description": "A flag runner must not:",
            "details": [
              {
                "point": "A. Make contact with a seeker's head, neck, or groin.",
                "subPoints": [
                  "i. Minor incidental contact with the head is ignored."
                ]
              },
              {
                "point": "B. Make contact with a seeker's legs at or below the knee unless contact with the seeker has already been established in another manner."
              },
              {
                "point": "C. Interact with any players other than the seekers."
              },
              {
                "point": "D. Play recklessly or dangerously."
              },
              {
                "point": "E. Intentionally injure anyone."
              },
              {
                "point": "F. Play with a bias toward one team."
              },
              {
                "point": "G. Cooperate with a seeker who is defending them for more than a few seconds.",
                "subPoints": [
                  "i. A seeker is defending the flag runner when they are putting more effort into interfering with the opposing seeker than they are putting into attempting to catch the flag.",
                  "ii. The flag runner must move out of the area being defended by that seeker, attempt to steal that seeker's stick, or otherwise significantly interfere with that seeker's attempt to defend them within approximately three seconds of recognizing they are being defended.",
                  "iii. If a flag runner is in doubt as to whether a seeker is attempting to defend them, they should assume that they are being defended."
                ]
              },
              {
                "point": "H. Remain on one team's side of the pitch for an extended period of time."
              },
              {
                "point": "I. Remain within 2 meters of the pitch boundary for an extended period of time."
              },
              {
                "point": "J. Intentionally leave the pitch."
              },
              {
                "point": "K. Intentionally attempt to become down in any manner unless injured, unable to play, avoiding a dangerous situation, adjusting equipment, or asked to do so by a referee (See rule 8.4.1 Down flag runner)."
              },
              {
                "point": "L. Intentionally touch any ball, including holding or shielding the flag ball itself."
              },
              {
                "point": "M. Intentionally pull a seeker's headband, clothing, or equipment other than the stick."
              },
              {
                "point": "N. Throw a stolen stick a significant distance away in any direction.",
                "subPoints": [
                  "i. The flag runner shall immediately either drop the stolen stick, toss it gently a short distance away (preferably in the direction of the seeker's hoops), or hand it directly back to the player."
                ]
              },
              {
                "point": "O. Intentionally make an incorrect call or lie about a call to deceive players."
              },
              {
                "point": "P. Disobey a directive from the head referee."
              },
              {
                "point": "Q. Bring any props into the player area."
              }
            ]
          },
          {
            "ruleId": "8.2.2",
            "ruleTitle": "Breach of standards by the flag runner",
            "details": [
              {
                "point": "A. The head referee may remove any flag runner due to injury, breach of the standards listed in 8.2.1 Flag runner code of conduct, or for being overly aggressive or irresponsible."
              },
              {
                "point": "B. A referee must warn the flag runner of violations or breaches of the standards listed in 8.2.1 Flag runner code of conduct.",
                "subPoints": [
                  "i. Major violations may warrant removal of the flag runner without a previous warning."
                ]
              },
              {
                "point": "C. If the flag runner commits a major violation against one seeker, play should be stopped immediately and any flag catch by the opposing team before play is stopped must be called no good."
              }
            ]
          },
          {
            "ruleId": "8.2.3",
            "ruleTitle": "Flag runners during stoppages",
            "description": "The flag runner may move around during stoppages, however:",
            "details": [
              {
                "point": "A. The flag runner must return to roughly where they were when play was stopped before play is restarted."
              },
              {
                "point": "B. The flag runner must not delay the restart of play."
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "8.3",
        "subSectionTitle": "Flag runner's timing",
        "content": [
          {
            "ruleId": "8.3.1",
            "ruleTitle": "The flag runner's release",
            "description": "The flag runner must be released onto the pitch from the scorekeeper's table between the 19- and 20-minute marks of game time."
          },
          {
            "ruleId": "8.3.2",
            "ruleTitle": "Remaining on the pitch",
            "description": "Once the flag runner has been released onto the pitch, the flag runner may not intentionally leave the pitch until they are caught."
          },
          {
            "ruleId": "8.3.3",
            "ruleTitle": "Flag handicaps",
            "details": [
              {
                "point": "A. The following handicaps on the flag runner are cumulative and must be implemented at their assigned times as measured in game time.",
                "subPoints": [
                  "i. Upon the release of the seekers, the flag runner is required to remain between the keeper zone lines.",
                  "ii. 25 minutes into the game, the flag runner is required to remain within roughly 1.5 meters of the midfield line.",
                  "iii. 30 minutes into the game, the flag runner is required to use only one arm.",
                  "iv. 35 minutes into the game, the flag runner is required to remain within roughly 1.5 meters of the intersection of the midfield and volleyball runner starting lines (See rule 2.1.5 Volleyball runner starting line)."
                ]
              },
              {
                "point": "B. Flag runners may choose to further handicap themselves during a game, however event staff and game officials must neither order nor request that they do so."
              },
              {
                "point": "C. No flag catch shall be invalidated due to a flag runner not being in compliance with the handicaps, unless in doing so the flag runner commits a major breach of standards against the non-catching team."
              },
              {
                "point": "D. Repeated violations of the handicaps is grounds for the replacement of the flag runner."
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "8.4",
        "subSectionTitle": "Ruled as down",
        "content": [
          {
            "ruleId": "8.4.1",
            "ruleTitle": "Down flag runner",
            "details": [
              {
                "point": "A. A flag runner is considered down when:",
                "subPoints": [
                  "i. The flag runner is grounded.",
                  "a. The flag sock itself touching the ground does not cause the flag runner to be considered down.",
                  "ii. Any part of the flag runner contacts the ground on or outside the boundary of the pitch.",
                  "iii. The flag runner's clothing needs to be adjusted, as described in 8.4.2 Adjusting the flag runner's clothing.",
                  "iv. Play is restarted after any stoppage."
                ]
              },
              {
                "point": "B. When the flag runner is down, the flag is uncatchable, regardless of whether the flag runner went down intentionally or unintentionally.",
                "subPoints": [
                  "i. The flag runner is considered down until the completion of their three second head start (See rule 8.4.3 Resetting a down flag runner)."
                ]
              }
            ]
          },
          {
            "ruleId": "8.4.2",
            "ruleTitle": "Adjusting the flag runner's clothing",
            "details": [
              {
                "point": "A. The flag runner's clothing needs to be adjusted if the flag runner's shorts are notably low or off center, the flag runner' other clothing obscures the flag, or the flag runner's clothing impedes the flag runner."
              },
              {
                "point": "B. If the flag runner's clothing needs to be adjusted, the flag runner is considered down and the flag is uncatchable from the moment the clothing is askew, at the discretion of the referee.",
                "subPoints": [
                  "i. If the clothing is made askew because a seeker had grabbed the flag sock and it did not release from the shorts, the flag runner shall not be considered down until the seeker lets go of the flag sock so long as the seeker did not also grab other parts of the flag runner's clothing.",
                  "a. This does not prevent or delay the flag runner from being ruled as down for reasons other than the clothing needing to be adjusted."
                ]
              }
            ]
          },
          {
            "ruleId": "8.4.3",
            "ruleTitle": "Resetting a down flag runner",
            "description": "Once a flag runner has been ruled down, the seekers must:",
            "details": [
              {
                "point": "A. Cease directly pursuing the flag."
              },
              {
                "point": "B. Release all parts of the flag runner's body, clothing, and the flag."
              },
              {
                "point": "C. Allow the flag runner to rise to their feet."
              },
              {
                "point": "D. Allow the flag runner to adjust all clothing and equipment as necessary."
              },
              {
                "point": "E. Allow an additional three-second head start as counted off by the flag referee before directly pursuing the flag again."
              }
            ],
            "violations": [
              {
                "description": "illegally pursuing the flag",
                "penalty": "BackToHoops"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "sectionId": "9",
    "sectionTitle": "PENALTIES",
    "subSections": [
      {
        "subSectionId": "9.1",
        "subSectionTitle": "Disciplinary sanctions",
        "content": [
          {
            "ruleId": "9.1.1",
            "ruleTitle": "No harm no foul",
            "description": "In the case of a minor offense that has not given either team an advantage, a referee may decide to verbally warn players about a potential infraction rather than calling a foul."
          },
          {
            "ruleId": "9.1.2",
            "ruleTitle": "Repeat procedure",
            "description": "If a player commits a foul that results in a repeat procedure penalty, the player must repeat the violated procedure from the point of the procedure that was violated.",
            "details": [
              {
                "point": "A. The player does not need to return to the location of the violation unless it is necessary to complete the procedure correctly."
              },
              {
                "point": "B. The player is ineligible to otherwise interact with play until the procedure is correctly completed."
              }
            ]
          },
          {
            "ruleId": "9.1.3",
            "ruleTitle": "Back to hoops",
            "description": "If a player commits a foul that results in a back to hoops penalty:",
            "details": [
              {
                "point": "A. Play should generally not be stopped."
              },
              {
                "point": "B. A referee informs the player of the infringement and tells them \"back to hoops.\""
              },
              {
                "point": "C. The player must dismount and follow the back-to-hoops procedure."
              },
              {
                "point": "D. If any ball is propelled by a player while or immediately after commiting a foul for which they are sent back to hoops, that ball must be turned over to the opposing team under the turnover procedure."
              }
            ],
            "violations": [
              {
                "description": "disregarding an official's directive",
                "penalty": "YellowCard"
              }
            ]
          },
          {
            "ruleId": "9.1.4",
            "ruleTitle": "Turnover",
            "description": "Turnovers result in possession of a specific ball being given to the opposing team. If a player commits a foul that results in a turnover:",
            "details": [
              {
                "point": "A. The referee may choose to stop play or complete the turnover while play continues unless required to stop play by rule.",
                "subPoints": [
                  "i. If multiple balls are to be turned over simultaneously, the referee should generally stop play in order to complete the turnover."
                ]
              },
              {
                "point": "B. If play is not stopped to complete the turnover:",
                "subPoints": [
                  "i. The referee calls for the turnover.",
                  "ii. If a player on the fouling team has the ball, they must drop it.",
                  "iii. If the ball is loose any eligible player for the receiving team may retrieve it.",
                  "iv. The referee may pass the ball to the nearest eligible player.",
                  "v. The fouling team may not touch the ball until the receiving team gains possession of it or declines the turnover.",
                  "vi. The fouling team may not delay the receiving team from getting the ball.",
                  "vii. The receiving team must immediately move to possess the ball or decline the turnover.",
                  "a. Failure to do either after being clearly informed of the turnover shall be treated as declining the turnover."
                ]
              },
              {
                "point": "C. If play is stopped to complete the turnover:",
                "subPoints": [
                  "i. The referee stops play.",
                  "ii. The referee gives the ball to the closest eligible player to the location of the ball.",
                  "a. If the ball was thrown during or after the foul, the ball is turned over to the closest eligible player to the spot of the throw."
                ]
              },
              {
                "point": "D. If there is no eligible player to receive the ball, the ball is placed at or thrown to the center hoop of the receiving team.",
                "subPoints": [
                  "i. If there are no eligible players to receive a dodgeball because all the receiving team's beaters already have dodgeballs, the ball is dropped or left in place instead of being turned over."
                ]
              },
              {
                "point": "E. A volleyball to be turned over is unable to result in a goal against the receiving team until the procedure is complete."
              },
              {
                "point": "F. Once a turnover is called for a dodgeball, that dodgeball is unable to knock a player off stick until the turnover procedure is complete."
              },
              {
                "point": "G. If both teams have committed fouls that would turn over the same ball, possession of that ball is determined by:",
                "subPoints": [
                  "i. The procedure for the foul receiving the most severe penalty card, if any.",
                  "ii. If multiple fouls tie for the most severe penalty card, among the tied fouls, the procedure for the foul committed last"
                ]
              }
            ],
            "violations": [
              {
                "description": "delaying the completion of the turnover procedure",
                "penalty": "BackToHoops"
              },
              {
                "description": "willfully ignoring a turnover call",
                "penalty": "YellowCard"
              }
            ]
          },
          {
            "ruleId": "9.1.5",
            "ruleTitle": "Penalty cards",
            "description": "If a foul results in a penalty card:",
            "details": [
              {
                "point": "A. Play is stopped."
              },
              {
                "point": "B. The referee signals that there was a penalty by showing the appropriate card(s) and communicating the nature of the foul."
              },
              {
                "point": "C. The player who committed the foul is sent to the penalty box.",
                "subPoints": [
                  "i. The fouling team must play down a player at the position of the fouling player for the duration of the penalty time.",
                  "a. The player serving the penalty time may not be substituted while in the penalty box unless they are injured or ejected.",
                  "ii. A player who receives a red card is ejected and their substitute is sent to the penalty box.",
                  "a. All requirements and procedures for ejected players must be followed (See rule 9.1.6 Ejection)."
                ]
              },
              {
                "point": "D. Penalty cards result in the following turnovers:",
                "subPoints": [
                  "i. Any ball that the fouling player possessed or acted on from the time of the foul until play was stopped must be turned over to the opposing team. This includes any balls that the fouled team was prevented from possessing by the foul.",
                  "ii. If a delayed penalty results in a card and the fouled team lost the volleyball between the time of the foul and the stoppage of play, the volleyball is turned over to the fouled team.",
                  "iii. For yellow and red cards, if the fouling team is in possession of the volleyball or if the volleyball is loose, the volleyball is turned over to the opposing team."
                ]
              },
              {
                "point": "E. If a player receives a second yellow card in the same game, the player must be ejected after being shown the yellow card. Their replacement must serve their penalty."
              },
              {
                "point": "F. Play is resumed."
              }
            ]
          },
          {
            "ruleId": "9.1.6",
            "ruleTitle": "Ejection",
            "description": "If a foul or penalty results in an ejection:",
            "details": [
              {
                "point": "A. The ejected player must leave the player area and may not return for the remainder of the game."
              },
              {
                "point": "B. If the player refuses to leave the player area:",
                "subPoints": [
                  "i. The player's team must assist in escorting the player away from the player area.",
                  "ii. If the player persists in refusing to leave or becomes dangerous, the head referee may end the game resulting in a forfeit for the fouling player's team."
                ]
              },
              {
                "point": "C. The referee may require the player to leave the vicinity of the pitch."
              },
              {
                "point": "D. Ejected players must not re-enter the player area or communicate with anyone inside the player area.",
                "subPoints": [
                  "i. This rule does not prohibit the ejected player from cheering for their team."
                ]
              },
              {
                "point": "E. If the ejected player was in play, the team must substitute a player in for the fouling player."
              },
              {
                "point": "F. If the ejected player had any penalty time assessed that had not been fully served, their substitute must serve the remainder of the penalty time.",
                "subPoints": [
                  "i. If the ejected player was not in play, then the speaking captain must designate a player on the pitch to go to the penalty box and serve that time."
                ]
              }
            ],
            "violations": [
              {
                "description": "illegally communicating with people in the player area as an ejected player",
                "penalty": "CaptainBlueCard"
              },
              {
                "description": "persistently refusing to leave the player area after being ejected",
                "penalty": "Forfeit"
              },
              {
                "description": "endangering others after being ejected",
                "penalty": "Forfeit"
              }
            ]
          },
          {
            "ruleId": "9.1.7",
            "ruleTitle": "Forfeit",
            "description": "If a foul results in a forfeit penalty, the fouling team forfeits the game (See rule 3.6.1 Declaring a forfeit).",
            "details": [
              {
                "point": "A. If both teams receive forfeit penalties on the same play or incident, a double forfeit shall be declared."
              },
              {
                "point": "B. If a forfeit penalty would be assessed to a single team during overtime, the head referee must first offer the offending team's speaking captain the opportunity to concede before administering the forfeit. If the speaking captain concedes the forfeit will not be administered (See rule 3.5.4 Conceding during overtime)."
              }
            ]
          },
          {
            "ruleId": "9.1.8",
            "ruleTitle": "Standard contact penalties",
            "description": "When a penalty for a foul is listed as the standard contact penalty, the following set of penalties shall apply to that foul:",
            "details": [
              {
                "point": "A. The default penalty for the foul is a yellow card."
              },
              {
                "point": "B. Minor fouls that do not affect overall gameplay and were, if applicable, immediately adjusted may receive a back to hoops penalty in place of the yellow card."
              },
              {
                "point": "C. Violent or egregious fouls must receive a red card instead of the yellow card."
              }
            ]
          },
          {
            "ruleId": "9.1.9",
            "ruleTitle": "Speaking captain penalty cards",
            "description": "When a penalty for a foul is listed as a speaking captain card, the listed penalty card is given to the team's speaking captain rather than the individual directly committing or causing the foul."
          }
        ]
      },
      {
        "subSectionId": "9.2",
        "subSectionTitle": "General foul procedures",
        "content": [
          {
            "ruleId": "9.2.1",
            "ruleTitle": "Violations caused by opponents' fouls",
            "details": [
              {
                "point": "A. Any player who violates a rule as a direct result of the illegal actions of an opponent must correct the violation as soon as possible in order to avoid penalty."
              }
            ]
          },
          {
            "ruleId": "9.2.2",
            "ruleTitle": "Plays after a foul",
            "description": "Any goal, beat, or flag catch performed by a player while or immediately after committing a foul does not count.",
            "details": [
              {
                "point": "A. If either advantage or a delayed penalty are called, the fouling player may knock opponents off stick during the delay as normal so long as the attempts were not made while or immediately after committing the foul."
              }
            ]
          },
          {
            "ruleId": "9.2.3",
            "ruleTitle": "Bench fouls",
            "description": "In certain limited cases, when substitutes or team staffers commit fouls, the penalty may be assessed to the speaking captain as a speaking captain penalty.",
            "details": [
              {
                "point": "A. If a single identifiable substitute or team staffer commits a foul, only the fouling individual shall be assessed the penalty."
              },
              {
                "point": "B. If a single substitute or team staffer commits a foul but the individual cannot be identified, the penalty shall be assessed to the speaking captain instead."
              },
              {
                "point": "C. If multiple substitutes or team staffers jointly commit the same or directly related offenses, only the speaking captain shall receive a penalty card, if applicable, for the foul committed.",
                "subPoints": [
                  "i. The speaking captain shall only receive a single penalty card for the offense.",
                  "ii. If the penalty for the offense is a straight red card or ejection, all substitutes and team staffers who are identified as having committed the red card or ejection offense themselves, shall be ejected from the game."
                ]
              },
              {
                "point": "D. If multiple unconnected offenses are committed by substitutes or team staffers, they shall be treated as separate incidents for the purposes of applying this rule.",
                "subPoints": [
                  "i. If this would result in multiple penalty cards being given to the speaking captain, including multiple red cards, on a single stoppage, then the speaking captain or their replacement shall serve only the single most severe of the cards. A separate player must be pulled off of the pitch to serve the time for each of the remaining cards.",
                  "a. The players pulled off the pitch do not get credited with the cards.",
                  "b. If the speaking captain is given two yellow cards in this manner, they shall still be ejected."
                ]
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "9.3",
        "subSectionTitle": "Timing of the foul",
        "content": [
          {
            "ruleId": "9.3.1",
            "ruleTitle": "Simultaneous penalty",
            "description": "If a player commits multiple fouls, the player shall be assessed the appropriate penalty for each offense except as follows:",
            "details": [
              {
                "point": "A. If a player commits multiple penalty card offenses simultaneously, the referee only adjudicates the single most severe penalty of those fouls."
              },
              {
                "point": "B. If a player commits multiple directly related penalty card offenses in quick succession, the referee only adjudicates the most severe penalty of those fouls."
              }
            ]
          },
          {
            "ruleId": "9.3.2",
            "ruleTitle": "Fouls before a goal",
            "details": [
              {
                "point": "A. If the fouled team scores a good goal between the time of the foul and the adjudication of the penalty for that foul, the penalty shall not result in a turnover of the volleyball."
              }
            ]
          },
          {
            "ruleId": "9.3.3",
            "ruleTitle": "Fouls after a goal",
            "details": [
              {
                "point": "A. If a player on the formerly defending team receives a penalty for a foul committed while the volleyball is dead:",
                "subPoints": [
                  "i. If the foul was committed as part of a play to defend against the goal, the penalty shall not result in a turnover of the volleyball.",
                  "ii. If the foul was not committed as part of a play to defend against the goal, the penalty is assessed in full including any prescribed turnovers.",
                  "iii. The goal does not negate any penalty time for the foul."
                ]
              }
            ]
          },
          {
            "ruleId": "9.3.4",
            "ruleTitle": "Fouls prior to the game",
            "description": "If a player receives a penalty card before the game begins:",
            "details": [
              {
                "point": "A. The offending team begins the game with the offending player (or the player's replacement in the case of a red card) in the penalty box and one fewer player on the starting lines."
              },
              {
                "point": "B. The player's penalty time officially begins at the call of \"sticks up.\""
              }
            ]
          },
          {
            "ruleId": "9.3.5",
            "ruleTitle": "Seeker penalties during the seeker floor",
            "description": "If a seeker receives a penalty card during the seeker floor:",
            "details": [
              {
                "point": "A. The offending seeker is sent to the penalty box."
              },
              {
                "point": "B. The seeker's penalty time officially begins at the expiration of the seeker floor."
              },
              {
                "point": "C. Goals cannot release the seeker prior to their penalty time beginning"
              }
            ]
          },
          {
            "ruleId": "9.3.6",
            "ruleTitle": "Fouls after the end of the game",
            "description": "If a player is assessed a foul after the game ends, the penalty must be noted normally on the scorecard for the game."
          }
        ]
      },
      {
        "subSectionId": "9.4",
        "subSectionTitle": "The penalty box",
        "content": [
          {
            "ruleId": "9.4.1",
            "ruleTitle": "Time of penalty",
            "details": [
              {
                "point": "A. Penalty cards result in one- or two-minute penalties for the penalized person.",
                "subPoints": [
                  "i. When all of a player's penalties have expired they are released from the penalty box.",
                  "ii. If a player is serving time for multiple penalties, the penalties are served consecutively in the order they are assessed.",
                  "iii. A two-minute penalty expires when a player spends two minutes of game time in the penalty box.",
                  "iv. A one-minute penalty expires when the player either spends one minute of game time in the penalty box or the opposing team scores by any method.",
                  "a. A single score causes a single one-minute penalty of the player with the fewest remaining one-minute penalties to expire.",
                  "b. If two players have the same number of one-minute penalties which have not expired, the one-minute penalty with the least amount of time remaining expires.",
                  "c. If two players have the same number of unspent penalties and the same amount of penalty time remaining, the head referee shall use their discretion to choose which one-minute penalty expires.",
                  "v. If the fouled team scores between the time of the foul resulting in a one-minute penalty and when play is stopped, and no other one-minute penalty would expire due to that score, the one-minute penalty immediately expires.",
                  "a. If multiple one-minute penalties are assessed, only one shall expire in this manner.",
                  "b. If the penalized player has their only one-minute penalty spent by the goal, they do not go to the penalty box.",
                  "vi. If the player leaves the penalty box early for any reason, time spent outside the penalty box is not counted towards the penalty.",
                  "a. If a score would cause the player's penalty to expire while the player is improperly outside of the penalty box, the penalty does not expire until the player returns to the penalty box."
                ]
              },
              {
                "point": "B. A red card results in a two-minute penalty to be served by the penalized player's replacement."
              },
              {
                "point": "C. Blue and yellow cards result in a one-minute penalty being assessed to the fouling player."
              },
              {
                "point": "D. If a person serving time in the penalty box for their own penalty receives a blue or yellow penalty card, they must serve an additional one-minute penalty."
              },
              {
                "point": "E. If a person serving time in the penalty box for a teammate's penalty receives a penalty card:",
                "subPoints": [
                  "i. Another substitute must serve the remainder of the original penalty.",
                  "ii. The offending player's penalty shall then be treated as a foul by a substitute (See rule 9.2.3 Bench fouls)."
                ]
              }
            ]
          },
          {
            "ruleId": "9.4.2",
            "ruleTitle": "Proceeding to the penalty box",
            "description": "Play is stopped while the penalized player, team staffer, or appropriate substitute is sent to the penalty box.",
            "details": [
              {
                "point": "A. Any substitution or position change made by the fouling player after the foul and before receiving the penalty card must be undone, and the fouling player must serve their penalty time at the position at which they committed the initial foul.",
                "subPoints": [
                  "i. If the foul is illegal substitution, the entering player receives the penalty card and time."
                ]
              },
              {
                "point": "B. If the keeper is sent to the penalty box, they must switch headbands with another chaser on their team before going to the penalty box.",
                "subPoints": [
                  "i. The keeper must not switch with a player who is serving time in the penalty box.",
                  "ii. If all of the team's other chasers are already serving time in the penalty box, the keeper must switch positions by switching headbands with a seeker or beater on their team instead."
                ]
              },
              {
                "point": "C. If the speaking captain receives a speaking captain penalty card while they happen to be in play, they may switch game positions with another non-keeper on their team who is in play before proceeding to the penalty box.",
                "subPoints": [
                  "i. If the speaking captain was in play as the keeper, they must switch headbands with another player.",
                  "ii. They must not switch with a player who is already serving time in the penalty box.",
                  "iii. If the speaking captain is already serving time in the penalty box for their own penalty when they receive the speaking captain penalty card, they shall not be allowed to change positions with another player."
                ]
              },
              {
                "point": "D. The person going to the penalty box must proceed immediately to the penalty box without delay and remain there until the penalty expires.",
                "subPoints": [
                  "i. If a player is given a blue or yellow card but is deemed to be too injured to serve their penalty by the head referee or the fouling player themselves, the speaking captain must choose an eligible substitute to serve the penalty.",
                  "a. If a carded player is replaced in the penalty box due to an injury, that player may not re-enter play until their substitute is released from the penalty box."
                ]
              },
              {
                "point": "E. Penalty time begins as soon as the head referee resumes play."
              },
              {
                "point": "F. If the player's penalty time is negated by a score before they are shown the penalty card the player shall not be moved to the penalty box.",
                "subPoints": [
                  "i. If the player was legally mounted when play was stopped, then they shall remain mounted upon the restart unless they are assessed a back to hoops penalty for a separate foul."
                ]
              }
            ],
            "violations": [
              {
                "description": "failing to immediately proceed to the penalty box after being carded",
                "penalty": "YellowCard"
              }
            ]
          },
          {
            "ruleId": "9.4.3",
            "ruleTitle": "Penalty box considerations",
            "details": [
              {
                "point": "A. Players serving penalty time are considered in play."
              },
              {
                "point": "B. If a player is serving time for another player's card, the carded player, not the player serving the time, is considered in play for the purposes of the gender maximum rule and positions for the duration of the penalty.",
                "subPoints": [
                  "i. This does not apply to cases where a player is serving time for a team staffer's penalty."
                ]
              },
              {
                "point": "C. Players in the penalty box are subject to the same restrictions and penalties regarding interacting with play as substitutes.",
                "subPoints": [
                  "i. If a player leaves the penalty box due to reasonably but mistakenly believing their penalty time had expired, and they do not interact with play prior to returning to the penalty box, they shall not be penalized.",
                  "a. Their penalty time will not run while they are outside of the box (See: 9.4.1.A.vi.)"
                ]
              },
              {
                "point": "D. Players serving time in the penalty box may not be mounted on a stick."
              },
              {
                "point": "E. If a player illegally substitutes while serving time in the penalty box, the substitution must be undone, and a penalty for an illegal substitution in the penalty box must be assessed instead of the penalty for a regular illegal substitution."
              }
            ],
            "violations": [
              {
                "description": "illegal substitution in the penalty box",
                "penalty": "CaptainYellowCard"
              }
            ]
          },
          {
            "ruleId": "9.4.4",
            "ruleTitle": "Tracking penalty time",
            "details": [
              {
                "point": "A. Penalty time begins when the referee blows the whistle to restart play."
              },
              {
                "point": "B. As soon as a player's penalty time expires, the timekeeper must release the player from the penalty box.",
                "subPoints": [
                  "i. When a player is released from the penalty box they are dismounted and must follow the back-to-hoops procedure to re-enter play.",
                  "ii. Any player serving time in the penalty box may return to the pitch as soon as their penalty time expires."
                ]
              }
            ]
          },
          {
            "ruleId": "9.4.5",
            "ruleTitle": "Penalties to substitutes and team staffers",
            "description": "If a substitute or team staffer receives a penalty card, that team must play a player down. The following procedure applies:",
            "details": [
              {
                "point": "A. The speaking captain must designate a player in play who is not already serving penalty time.",
                "subPoints": [
                  "i. If more than one substitute or team staffer is sent to the penalty box, a separate player in play must be designated for each.",
                  "ii. The designated player must not be the keeper unless there is no other player whose designation would not result in a violation of the gender maximum rule."
                ]
              },
              {
                "point": "B. If the substitute receiving the card is not ejected, they substitute into the game for the designated player.",
                "subPoints": [
                  "i. The fouling substitute proceeds to the penalty box.",
                  "ii. The designated player returns to the bench and is eligible to substitute back into the game through the normal substitution procedure."
                ]
              },
              {
                "point": "C. If the substitute receiving the card is ejected, the designated player must proceed to the penalty box to serve the penalty time."
              },
              {
                "point": "D. If a team staffer receives a penalty card, the designated player proceeds to the penalty box and serves the penalty time.",
                "subPoints": [
                  "i. If the team staffer was not ejected, they must join the designated player in the penalty box.",
                  "a. Once the team staffer's penalty time expires, the player is released and the team staffer shall return to the team bench."
                ]
              }
            ]
          },
          {
            "ruleId": "9.4.6",
            "ruleTitle": "All players in the penalty box",
            "description": "If all players in play for a team are simultaneously serving time in the penalty box, that team must forfeit the game.",
            "details": [
              {
                "point": "A. If both teams reach this situation on the same play or incident, a double forfeit shall be declared."
              }
            ],
            "violations": [
              {
                "description": "having all players in play serving penalty time",
                "penalty": "Forfeit"
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "9.5",
        "subSectionTitle": "Advantage",
        "content": [
          {
            "ruleId": "9.5.1",
            "ruleTitle": "Calling advantage",
            "description": "If the head referee determines that stopping play due to a foul would provide an advantage in the volleyball game to the fouling team, the referee may delay stopping play by calling advantage.",
            "details": [
              {
                "point": "A. If advantage is called the following procedure applies:",
                "subPoints": [
                  "i. The referee throws a marker indicating the location of the volleyball at the time of the foul and raises one hand straight into the air.",
                  "ii. The referee may send the fouling player back to hoops at the start of the advantage if the situation warrants.",
                  "iii. Play continues until the fouling team would no longer benefit from play being stopped including but not limited to the following situations:",
                  "a. The fouling team gains possession of the volleyball.",
                  "b. A goal is scored for the fouled team.",
                  "c. The fouled team is not actively moving to score.",
                  "d. The fouled team commits a separate foul.",
                  "e. There is a flag catch by either team."
                ]
              },
              {
                "point": "B. When advantage abates, the referee must stop play, and any penalties shall be adjudicated as normal.",
                "subPoints": [
                  "i. If no penalty is assessed against the team that was on defense during the advantage call, play shall be restarted as though advantage was not called."
                ]
              }
            ]
          },
          {
            "ruleId": "9.5.2",
            "ruleTitle": "Advantage restart procedure",
            "description": "Play is restarted as follows after an advantage call:",
            "details": [
              {
                "point": "A. If a goal is scored for the non-fouling team, play restarts according to standard procedure for a goal (See rule 4.2 Restarting after a goal)."
              },
              {
                "point": "B. If the originally fouled team did not score before the advantage abated:",
                "subPoints": [
                  "i. The volleyball carrier at the time of the foul (or their substitute) is returned to the location of the advantage marker and is given the volleyball before play is resumed.",
                  "a. If this player has been off stick, they are returned to the location of the advantage marker as an eligible player.",
                  "b. If this player committed a back to hoops foul during the advantage or has been sent to the penalty box, the eligible volleyball player from that team nearest to the location of the advantage marker shall move there and receive the volleyball instead.",
                  "c. If the volleyball is turned over to the originally fouling team, no players shall be moved to the location of the advantage marker.",
                  "ii. All other players remain where they were at the time of the stoppage and, if off stick before the stoppage, continue to be off stick.",
                  "iii. Play is resumed by the head referee."
                ]
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "9.6",
        "subSectionTitle": "Delayed penalties",
        "content": [
          {
            "ruleId": "9.6.1",
            "ruleTitle": "Delayed penalties",
            "description": "All blue, yellow, and red card penalties, as well as third dodgeball interference penalties, called by officials other than the head referee are considered delayed penalties.",
            "details": [
              {
                "point": "A. If the head referee also sees and calls the foul themselves, then it is not treated as a delayed penalty."
              },
              {
                "point": "B. If play is stopped under this procedure and no cards or third dodgeball interference penalties are assessed as a result, it shall be treated as though it was not a delayed penalty."
              }
            ]
          },
          {
            "ruleId": "9.6.2",
            "ruleTitle": "Calling a delayed penalty",
            "details": [
              {
                "point": "A. If an official other than the head referee sees a player or team staffer commit a foul, that official raises their hand and play continues as a delayed penalty."
              },
              {
                "point": "B. The assistant referee may send the fouling player back to hoops during the delay if the situation warrants."
              },
              {
                "point": "C. The referee visually and verbally signals to the head referee that a foul has occurred and which team committed the foul.",
                "subPoints": [
                  "i. If the head referee determines that it is appropriate to immediately stop play, the head referee may do so.",
                  "ii. The head referee may allow play to continue as in an advantage situation until the advantage abates in any way, unless the foul continues or escalates.",
                  "a. If the head referee continues play as in an advantage situation, they shall raise their own arm as well."
                ]
              },
              {
                "point": "D. If another foul is committed by either team during a delayed penalty, the head referee should stop play and adjudicate both fouls immediately."
              },
              {
                "point": "E. After all penalties are adjudicated, play is restarted."
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "9.7",
        "subSectionTitle": "Alternative post-penalty restart",
        "content": [
          {
            "ruleId": "9.7.1",
            "ruleTitle": "Alternate restart positioning",
            "description": "After a penalty card or third dodgeball interference penalty is assessed, the chaser in possession of the volleyball on the restart shall have a choice of where they will be when play resumes.",
            "details": [
              {
                "point": "A. The options available to that player are determined by where they would resume by default in the absence of this rule as follows:",
                "subPoints": [
                  "i. That player may choose to resume play where the default procedures would have them resume play, regardless of their location on the field.",
                  "ii. If they would resume play outside of the opposing team's keeper zone, they may instead move back to any location on the nearest restrictor line in the direction of their own hoops.",
                  "iii. If they would resume play in the opposing team's keeper zone, they may instead move to any location on the opposing team's endline and inbound the volleyball from that point when play resumes."
                ]
              },
              {
                "point": "B. The chaser must make their decision and, if applicable, move to the selected location immediately.",
                "subPoints": [
                  "i. If the chaser delays in making their choice, the referee shall direct them to resume play where the default procedures would have them resume play."
                ]
              },
              {
                "point": "C. This choice shall not be available to the chaser if any of the following are true:",
                "subPoints": [
                  "i. A good goal is scored during the delay between the foul and the stoppage.",
                  "ii. The chaser is in their own keeper zone.",
                  "iii. All penalty cards and third dodgeball interference penalties assessed during the stoppage were assessed to the chaser's own team."
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "sectionId": "10",
    "sectionTitle": "GAME OFFICIALS",
    "subSections": [
      {
        "subSectionId": "10.1",
        "subSectionTitle": "The officials",
        "content": [
          {
            "ruleId": "10.1.1",
            "ruleTitle": "The head referee",
            "details": [
              {
                "point": "A. Event officials must appoint a head referee for each game."
              },
              {
                "point": "B. The head referee has the authority to enforce the rules and take disciplinary action from the moment they enter the player area until they leave the player area after the final whistle."
              },
              {
                "point": "C. The head referee may stop play at any time to enforce rules or otherwise facilitate safe and fair gameplay."
              },
              {
                "point": "D. The head referee is the only official who may directly issue penalty cards.",
                "subPoints": [
                  "i. Other officials may advise the head referee to issue penalty cards."
                ]
              },
              {
                "point": "E. The head referee may replace any official with an appropriate replacement if the official is injured or, in the opinion of the head referee, needs to be dismissed."
              },
              {
                "point": "F. All other officials must defer to the authority of the head referee."
              }
            ]
          },
          {
            "ruleId": "10.1.2",
            "ruleTitle": "Appointing additional officials",
            "description": "The head referee or event officials must appoint at least two assistant referees, a flag referee, a scorekeeper, and a flag runner and may appoint other officials (up to two additional assistant referees, a timekeeper, and two goal judges) for each game.",
            "details": [
              {
                "point": "A. The flag referee may act as an assistant referee while the flag runner is not in play if there are less than four other assistant referees appointed for the game.",
                "subPoints": [
                  "i. If the flag referee is not serving as an assistant referee when the flag runner is out of play:",
                  "a. They shall assist with watching sticks up, and then immediately leave the player area.",
                  "b. If the game would continue after the flag is caught, they shall leave the player area after the catch has been confirmed."
                ]
              },
              {
                "point": "B. The flag referee must be appointed in addition to the two required assistant referees."
              }
            ]
          },
          {
            "ruleId": "10.1.3",
            "ruleTitle": "Officiating with a minimum crew",
            "description": "It is highly recommended that two goal judges and a timekeeper are appointed for each game.",
            "details": [
              {
                "point": "A. If a separate timekeeper is not appointed, the scorekeeper assumes the responsibilities of the timekeeper."
              },
              {
                "point": "B. If goal judges are not appointed, the head referee assumes the responsibilities of the goal judges."
              }
            ]
          },
          {
            "ruleId": "10.1.4",
            "ruleTitle": "Assistant referees",
            "details": [
              {
                "point": "A. The primary focuses of the assistant referees, subject to the discretion of the head referee, are:",
                "subPoints": [
                  "i. Calling whether players are off stick.",
                  "ii. Watching plays away from the volleyball.",
                  "iii. Watching for balls and players going out of bounds."
                ]
              }
            ]
          },
          {
            "ruleId": "10.1.5",
            "ruleTitle": "Flag referee",
            "details": [
              {
                "point": "A. The primary focuses of the flag referee, subject to the discretion of the head referee are:",
                "subPoints": [
                  "i. Watching for false starts on sticks up.",
                  "ii. Watching plays around the flag runner including beats, dismounts, and potential catches.",
                  "iii. Ruling whether the flag runner is down and counting the three second head start.",
                  "iv. Enforcing flag handicaps.",
                  "v. Informing the flag runner when they believe that a seeker is defending the flag runner and they believe that the flag runner may not have noticed."
                ]
              },
              {
                "point": "B. The flag referee must not provide any additional advice or warnings to the flag runner during the game to help them avoid being caught, including but not limited to the locations, substitutions, and tactics of the seekers."
              },
              {
                "point": "C. The flag referee may stop play only in the following instances:",
                "subPoints": [
                  "i. They believe that a flag catch may have been successful.",
                  "ii. The flag runner is injured or needs to be replaced.",
                  "iii. The flag ball or flag shorts become defective and need to be replaced.",
                  "iv. They believe a false start has occurred on sticks up."
                ]
              }
            ]
          },
          {
            "ruleId": "10.1.6",
            "ruleTitle": "Goal judges",
            "details": [
              {
                "point": "A. The primary focuses of the goal judges, subject to the discretion of the head referee, are:",
                "subPoints": [
                  "i. Watching shots taken toward the goals.",
                  "ii. Ruling whether the volleyball is out of bounds on their endline."
                ]
              }
            ]
          },
          {
            "ruleId": "10.1.7",
            "ruleTitle": "Scorekeeper",
            "details": [
              {
                "point": "A. The primary focuses of the scorekeeper are:",
                "subPoints": [
                  "i. Keeping track of the game's score.",
                  "ii. Updating the game's scoreboard.",
                  "iii. Recording the player number and reason for all penalty cards.",
                  "iv. Announcing the score at regular intervals and upon request.",
                  "v. Announcing and displaying the target score in a similar manner as the game score during overtime."
                ]
              }
            ]
          },
          {
            "ruleId": "10.1.8",
            "ruleTitle": "Timekeeper",
            "details": [
              {
                "point": "A. The primary focuses of the timekeeper are:",
                "subPoints": [
                  "i. Keeping track of game time.",
                  "ii. Keeping track of penalty time and releasing players from the penalty box after their penalty time is served.",
                  "iii. Clearly announce the 19-minute mark of gametime (See rule 3.3.4 Timeouts).",
                  "iv. Acknowledging the seekers and flag runner when they report to the scorekeeper's table and releasing them onto the pitch at the appropriate time.",
                  "v. Watching for seeker false starts."
                ]
              },
              {
                "point": "B. The game clock does not need to be displayed in a way that is visible to the players on the pitch. However, if the game clock is displayed it must:",
                "subPoints": [
                  "i. Be directly and solely controlled by the timekeeper.",
                  "a. If there are multiple displays on the field, the displays must be controlled by a single set of controls such that the displays cannot fail to match.",
                  "ii. Be clearly and fairly visible to both teams.",
                  "iii. Be the official clock.",
                  "a. No displayed game clock may ever be unofficial.",
                  "b. If a displayed game clock malfunctions or otherwise ceases to be the official clock, it must be turned off until it is corrected and becomes the official clock again."
                ]
              }
            ]
          },
          {
            "ruleId": "10.1.9",
            "ruleTitle": "The flag runner",
            "details": [
              {
                "point": "A. The flag runner is an official and may advise the other officials on any call."
              },
              {
                "point": "B. The flag runner may only make direct calls on the following:",
                "subPoints": [
                  "i. Beats and dismounts around the flag runner.",
                  "ii. Illegal contact committed against the flag runner.",
                  "iii. Down calls when their clothing is askew and needs to be adjusted."
                ]
              },
              {
                "point": "C. If the flag runner and another official disagree on a direct call, the flag runner must defer to the other official while play is live."
              }
            ]
          }
        ]
      },
      {
        "subSectionId": "10.2",
        "subSectionTitle": "Officials' calls",
        "content": [
          {
            "ruleId": "10.2.1",
            "ruleTitle": "Referee's discretion",
            "description": "In cases where intent or severity are relevant to a call, the referee retains full discretion in judging that severity or intent."
          },
          {
            "ruleId": "10.2.2",
            "ruleTitle": "Basis of calls",
            "description": "Calls made by any official must be made only based on their observations and those of the other officials appointed for the game."
          },
          {
            "ruleId": "10.2.3",
            "ruleTitle": "Adjusting calls during a stoppage",
            "description": "The head referee may freely change calls made during a stoppage before resuming play.",
            "details": [
              {
                "point": "A. Once the head referee blows the three whistles indicating the end of the game, goal and flag catch calls for the game become final and must not be adjusted."
              }
            ]
          },
          {
            "ruleId": "10.2.4",
            "ruleTitle": "Adjusting a goal call",
            "description": "The head referee may adjust a goal or no-goal call at any time prior to the formerly defending team having possession of the volleyball outside of the keeper zone and a subsequent significant interaction or play by the player with possession of the volleyball."
          }
        ]
      },
      {
        "subSectionId": "10.3",
        "subSectionTitle": "Players and officials",
        "content": [
          {
            "ruleId": "10.3.1",
            "ruleTitle": "Interactions with officials",
            "details": [
              {
                "point": "A. Players and team staff must abide by the decisions and directives of the head referee and all other officials."
              },
              {
                "point": "B. Players and team staff must not show disrespect to any official including persistently questioning the decisions of the officials."
              }
            ],
            "violations": [
              {
                "description": "disrespecting an official",
                "penalty": "BlueCard or YellowCard"
              },
              {
                "description": "disregarding an official's directive",
                "penalty": "YellowCard"
              }
            ]
          },
          {
            "ruleId": "10.3.2",
            "ruleTitle": "Using referee commands",
            "description": "Players and team staff may not use verbal or visual referee signals or commands.",
            "violations": [
              {
                "description": "illegally using verbal or visual referee signals or commands",
                "penalty": "BlueCard"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "sectionId": "A",
    "sectionTitle": "DEFINITIONS",
    "subSections": [
      {
        "subSectionId": "A.1",
        "subSectionTitle": "Definitions",
        "content": [
          {
            "ruleId": "A.1.1",
            "ruleTitle": "Definitions",
            "description": "Key terms and definitions used throughout the rulebook:",
            "details": [
              {
                "point": "Axis through spine — Line extended through the top and bottom of a player's spine"
              },
              {
                "point": "Bat — To propel a ball by hitting it with another ball that is still in one's possession at the time of the hit."
              },
              {
                "point": "Beaters — Two players on each team who throw, kick, or in any way propel the dodgeballs to disrupt the flow of the game by beating other players."
              },
              {
                "point": "Bent over — A player shall be considered bent over whenever the axis through their spine is more than 45 degrees off from a fully upright position."
              },
              {
                "point": "Chasers — Four players on each team who attempt to send the volleyball through the opposing team's hoops and attempt to stop the other team from doing so."
              },
              {
                "point": "Dead dodgeball — A dodgeball that cannot knock anyone off stick due to not being live (See rule 5.2.2 Live dodgeball)."
              },
              {
                "point": "Dead volleyball — A volleyball during the time between when a good goal is scored and when volleyball play is restarted. A dead volleyball cannot be used to score. (See rule 4.2.1 Dead volleyball)."
              },
              {
                "point": "Default procedures — The procedures that would be followed in the absence of the three digit rule in which the term is used."
              },
              {
                "point": "Dislodged hoop — A hoop that is broken, displaced, in any way knocked down, or unplayable."
              },
              {
                "point": "Dodgeball — One of three inflated rubber balls that may only be used by the beaters and are used to temporarily knock opponents off stick. (See rule 2.3.2 Dodgeballs)."
              },
              {
                "point": "Dodgeball immunity — A player with dodgeball immunity is not knocked off stick by live dodgeballs. A protected keeper is immune in that keeper's own keeper zone. A beater retrieving the third dodgeball gains dodgeball immunity by raising a hand in a fist above their shoulder. (See rule 5.5.2 Claiming dodgeball immunity)."
              },
              {
                "point": "Egregious — Shockingly bad"
              },
              {
                "point": "Excessive force — Using excessive force is defined as when a player both exceeds by far the necessary use of force to complete the action initiated and as a result is in danger of injuring an opponent."
              },
              {
                "point": "Flag — The flag is a ball contained within a fabric sleeve or sock. Seekers attempt to catch the flag to earn 30 points (See rule 2.3.3 The flag)."
              },
              {
                "point": "Flag runner — A game official who is tasked with protecting the flag from being caught (See rule 2.3.3 The flag)."
              },
              {
                "point": "Flag sock — The fabric sleeve that contains the flag ball and must be attached to the back of the flag runner's shorts."
              },
              {
                "point": "Formerly defensive team — The team against whom a goal was just scored."
              },
              {
                "point": "Formerly offensive team — The team for whom a goal was just scored."
              },
              {
                "point": "Free dodgeball — A dodgeball that is not in the possession of a beater on either team."
              },
              {
                "point": "Game — A singular competition between two teams for the purpose of declaring a winner."
              },
              {
                "point": "Game time — The official time of any given game, measured from the first \"S\" sound of \"sticks up\" until the end of the game but paused for stoppages in play."
              },
              {
                "point": "Gender maximum rule — The rule that limits the number players who identify as the same gender a team can have in play at the same time. (See rule 1.2.3 Gender maximum rule)."
              },
              {
                "point": "Good goal — Ten points are scored for a team when the volleyball in any way passes entirely through their opponent's hoops and the goal is confirmed as good (See rule 4.1.1 Good goal)."
              },
              {
                "point": "Grounded (Person) — A person who is in contact with the ground with any part of their body other than their hands or feet."
              },
              {
                "point": "Headbeat — Live dodgeballs whose first contact is with the head or neck of an opponent are considered headbeats."
              },
              {
                "point": "Helpless receiver — A receiver who is in the process of catching a ball that is in the air. The receiver does not have to leave the ground in order to be considered a helpless receiver. It is illegal to push, charge, tackle, or wrap a helpless receiver (See rule 6.1.7 Helpless receiver)."
              },
              {
                "point": "Hoop — A hoop-loop and the pole it is attached to (See rule 2.2.2 Hoop shape). The hoop base is not considered part of the hoop."
              },
              {
                "point": "Hoop-Loop — The 81-86 centimeters inner diameter circle through which the volleyball must pass to score a goal (See rule 2.2.2 Hoop shape)."
              },
              {
                "point": "Incidental — Occurring merely by chance or without intention or calculation."
              },
              {
                "point": "Intentional — An action performed with a specific purpose in mind."
              },
              {
                "point": "Joint control — When two or more players have a grip on, or otherwise share control of, the same ball, leaving neither player with possession."
              },
              {
                "point": "Keeper — The chaser on each team with additional privileges in their own keeper zone."
              },
              {
                "point": "Kick — To strike with a foot or feet, or with any part of the leg below the knee. At the time of a kick the player striking the ball is considered to have possession of that ball, if they are the only player in contact with it. It is illegal to kick an opponent."
              },
              {
                "point": "Live dodgeball — A dodgeball that has been thrown, kicked, or otherwise intentionally propelled by a beater who is in play, unless they are inbounding the ball, off stick, or struck. A live dodgeball can knock opponents off stick (See rule 5.2.2 Live dodgeball)"
              },
              {
                "point": "Live play — Play is live from the first \"S\" of \"sticks up\" to the final whistle, whenever play is not stopped."
              },
              {
                "point": "Live volleyball — A volleyball that is not a dead volleyball, whenever play is live."
              },
              {
                "point": "Natural motion — A player's continued movement in making a play, one singular natural motion that the player had already started, if that motion cannot be stopped (See rule 5.6.1 Natural motion)."
              },
              {
                "point": "Negligable force — the force a dodgeball makes when hitting the ground after being dropped from a height of 2 m or less."
              },
              {
                "point": "Opponents' half — The half of the pitch or player area containing the hoops that a team is assigned to attack."
              },
              {
                "point": "Opponents' hoops — The hoops that a team is assigned to attack."
              },
              {
                "point": "Opponents' keeper zone — The keeper zone containing the hoops that a team is assigned to attack."
              },
              {
                "point": "Opponents' live dodgeball — A live dodgeball most recently made live by the player's opponent"
              },
              {
                "point": "Overtime — The portion of the game that occurs after the flag has been caught. It only occurs when the flag catch does not leave the catching team with a lead, and lasts until either team reaches the target score (See rule 3.5 Ending the game and overtime)."
              },
              {
                "point": "Own half — The half of the pitch or player area containing the hoops that a team is assigned to defend."
              },
              {
                "point": "Own hoops — The hoops that a team is assigned to defend."
              },
              {
                "point": "Own keeper zone — The keeper zone containing the hoops that a team is assigned to defend."
              },
              {
                "point": "Penalty box — A 5.5 by 4 meter box bordering the midfield line, the pitch, and the player area boundary where players must remain for a certain amount of time after committing a foul. Each team has a penalty box on their own side of the midfield line. Players in the penalty box may not interact with play, but are considered in play for purposes of the gender maximum rule and positions (See rule 2.1.9 Penalty boxes)."
              },
              {
                "point": "Penalty time — The time a player must spend in the penalty box due to a foul. Penalty time is measured in game time and therefore does not run during a stoppage of play."
              },
              {
                "point": "Pitch boundary — The 33 by 60 meter rectangular area marked by the boundary lines where play is generally restricted (See rule 2.1.1 Boundary lines)."
              },
              {
                "point": "Player — Any person on a team's roster who is eligible to be in play."
              },
              {
                "point": "Player area — The 44 by 66 meter rectangular area that includes and surrounds the pitch. Spectators may not enter the player area. Anything outside the player area is the spectator area (See rule 2.1.12 The player area)."
              },
              {
                "point": "Possessing team — In the context of the third dodgeball, the possessing team is the team that initially possessed two dodgeballs when the remaining free dodgeball became the third dodgeball."
              },
              {
                "point": "Possession — Complete and sole control of a ball. A player who is intentionally kicking a ball is considered to have possession of that ball while they are the sole person in contact with the ball. A player who is swatting a ball that is on the ground is considered to have possession of that ball while they are the sole person in contact with the ball (See rule 7.1.1 Use of the ball)"
              }
            ]
          }
        ]
      }
    ]
  }
]